{"AES-Anthologies":{"title":"AES Anthologies","links":[],"tags":[],"content":"www.aes.org/publications/anthologies/downloads/jaes_loudspeaker-anthology-1.pdf\nwww.aes.org/publications/anthologies/downloads/jaes_loudspeaker-anthology-2.pdf\nwww.aes.org/publications/anthologies/downloads/jaes_loudspeaker-anthology-3.pdf\nwww.aes.org/publications/anthologies/downloads/jaes_loudspeaker-anthology-4.pdf"},"Amplifiers/Amp-Power":{"title":"Amp Power","links":[],"tags":[],"content":"0 dBFS digital = 18 dBFS analog\nanalog 0 VU = +4 dBu\n1 dBu = 0.775 V"},"Amplifiers/Amplifier-chips":{"title":"Amplifier chips","links":[],"tags":[],"content":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNameAMP ClassNoteDatasheetLM1875LM1876Class ABBigger the filter coil is betterwww.ti.com/lit/ds/symlink/lm1875.pdfLM3886Class ABBestwww.ti.com/lit/ds/symlink/lm3886.pdfTDA7293Class ABTDA7498Class DTPA3116D2Class Dwww.ti.com/lit/ds/symlink/tpa3116d2.pdfTPA3118Class DTPA3221Class Dwww.ti.com/lit/ds/symlink/tpa3221.pdfTPA3251Class Dwww.ti.com/lit/ds/symlink/tpa3251.pdfTPA3255Class DBest of it classwww.ti.com/lit/ds/symlink/tpa3255.pdfPAM8403Class Dlow power"},"Amplifiers/EP1-ของแท้-ไม่แท้":{"title":"EP1 ของแท้ ไม่แท้","links":[],"tags":[],"content":"\n\n\nมือใหม่หัดซื้อ amp\nของแท้ของปลอมต่างกันอย่างไร?\n(ขอส่วนของภาคขยายก่อนนะ ส่วน Bluetooth ยังไม่ได้ศึกษา)\nอย่างแรกคือต้องตอบคำถามก่อนว่าอะไรคือของแท้\nเท่าที่ผมศึกษามา วงจร amp ตัวเล็กที่เรานิยมเล่นกัน\n(MT21 TB21 C50H) จะเป็นวงจรของชิปหมายเลข\nTPA3116D2 จาก ti หรือ Texas instruments\nซึ่งเป็น amp class D ที่ดีระดับหนึ่ง\nหรือถ้าเป็นรุ่นใหญ่ AS21 ที่มีพัดลม\nก็มีรุ่นย่อยอีก 2 รุ่นคือ\nS350 ใช้ชิป TPA3251 ของ ti\nS250 ใช้ชิป TDA7498E อันนี้ของเจ้าไหนไม่แน่ใจ น่าจะของ ST\nและจะมีสวนขยายก่อนเข้าแอปอีกชุดนึงใช้ชิป NE5532 ของ ti เช่นกัน\nคลาวนี้ของปลอมหน้าตาเป็นอย่างไร\nถ้าดูจากผ่านๆ แล้วแทบจะเหมือนกันเลย\nแต่ถ้าเปิดซิ้งระบายความร้อนออกมาดู\nก็จะเห็นหน้าตาเลยว่ามันไม่เหมือนกัน !\nตัวอย่างในรูปเป็นชิปจีนเบอร์ HT326C?\n(มองไม่ชัด หา datasheet ยังไม่เจอ)\nและถ้ามาดูส่วนขยายก่อนเข้าแอปก็จะเป็น NE5532 แต่ไม่ใช้ ti\nในตัวอย่างเป็นของ HGSEMI\nข้อสังเกตเพิ่มเติม\nTPA3116D2 จะมีซิ้งระบายความร้อนอยู่ตรงกลาง\nTPA3118 อันนี้ดูยากหน่อยเพราะอยู่ใต้ชิป\nNE5532 ดูสัญลักษณ์ ti เป็นหลักได้เลย\nหากผิดพลาดหรือไม่ครบม่วนตรงในก็แสดงความคิดเห็นกันมาได้นะครับ\nเดี๋ยววันหลังจะมาชวนคุยเรื่อง filter ต่อ"},"Amplifiers/EP2-filter-ไม่-filter":{"title":"EP2 filter ไม่ filter","links":[],"tags":[],"content":"มือใหม่หัดซื้อแอป ep2\nความเดิมตอนที่แล้ว\nwww.facebook.com/groups/791461357947350/\nตอนนี้มาดูเรื่อง filter กันดีกว่า\nถ้าคุณได้ลองเล่นแอมป์ ZK-TB21 กับ ZK-MT21 ก็อาจจมีข้อสงใสบ้างว่าทั้งสองตัวมันต่างกันอย่างไร\nแอมป์ทั้งสองตัวนี้เป็นแอมป์ 2.1 มีกำลัง W เท่ากัน แล้วเผลอ ๆ ยังใช้ชิปเดียวกันอีกต่างหากถ้าคุณได้ TB21 ชิปจีนมา\nเมื่อเแาแผงวงจรออกมาดู คุณจะเห็นสิ่งหนึ่งใน TB-21 ที่ MT-21 ไม่มี\nคือก้อนสี่เหลี่ยมดำๆ วางกันเป็นตับอยู่ 6 ตัว และก็มีชิ้นสี่เหลี่ยมเล็กๆ เหลืองบ้าง ดำบ้าง อยู่อีกประมาณสิบตัว\nวงจรพวกนี้คืออะไรลองตามมาดูในรูปกันเลยครับ\nขอบคุณข้อมูลการวัดจาก Tonehub Studio ติดตามได้ที่ www.youtube.com/@tonehubstudio\nMT-21\n\nTB-21\n\nเทียบกัน\n\nส่วนที่แตกต่างของแอมป์ทั้งสองตัว\n\nถ้าเข้าไปดูใน datasheet ของ TPA3116D2\nจะเห็นใน simple application ก่อนเข้าลำโพงจะมี\nLC Filter อยู่\n\nดูในวงจรตัวอย่าง\n\n\nซูมเข้ามาในในส่วนก่อนออกลำโพง subwoofer\nจะเห็นกรอบสี่เหลี่ยม 2 ส่วน\n\n\nOutput LC Filter\nส่วนนี้เป็น low pass filter ที่กลองย่านสูงมากๆ เกิน 20k Hz\nเดี๋ยวจะลองมาคำนวณกันต่อไป\n\n\nEMI C-RC Snubber\nส่วนนี้ใช้สำหรับกันกระแสย้อนกลับจากการกระเพื่อมของลำโพง หรือ EMI (Electromagnetic interference) ผมคิดว่าส่วนนี้อาจจะใช้ป้องกันชิปแอมป์เสียหาย ส่วนจริง ๆ ใช้ทำอะไรยังต้อง\nศึกษาต่อไป หรือถ้าท่านใดรู้ก็สามารถบอกใน comment ได้นะครับ\n\n\n\nคำนวณ LC Filter ตามวงจรตัวอย่างจะเห็นค่า -3dB cutoff ที่ 50kHz\n\nมาลองดูของจริง ด้านซ้ายคือ MT-21 ขวาคือ TB-21 ชิปจีน\nด้านขวาจะเป็น filter โดยใช้ L ขนาด 15 uH\nด้านซ้ายเห็น C อยู่ 6 ตัว\n\nMT-21 ขณะวัดนั้นมีเสียง noise แปลก ๆ เข้ามาตอน monitor ตลอดเวลา ปรับ EQ ได้ยากมาก\nสุดท้ายปรับ EQ ยังไม่สำเร็จแต่ interface เสียงไม่เข้าซะแล้วตัวนี้เลยเป็นผลลัพท์สุดท้ายที่วัดได้\nTB-21 ไม่มี noise แบบ MT-21 พยายามบิด Treble Bass ให้เรียบที่สุดเท่าที่ทำได้\nจะเห็นย่านสูงที่โดนกดลงอาจจะเป็นเพราะ Filter ที่ใส่มาใหญ่ไป หรืออาจจะเป็นเพราะ\nชิปจีน อันนี้เดี๋ยวของแท้มาเมื่อไหร่เดี๋ยวผมวัดอีกที\n\nดูกราฟ distortion จะเห็นได้ชัดเจนว่า TB-21 มี noise น้อยกว่าเยอะ\n\nอันนี้เป็นกราฟ reference ที่วัดได้จาก Topping L70 เพื่อดูว่าเครื่องวัดไม่ได้มีปัญหา"},"Amplifiers/EP3-สะอาด-ไม่สะอาด":{"title":"EP3 สะอาด ไม่สะอาด","links":[],"tags":[],"content":"กลับมากับตอนที่ 3 ว่าด้วยเรื่อง frequency response และ distortion\nความเดิมตอนที่แล้ว\nEP1 ของแท้ ไม่แท้  www.facebook.com/groups/791461357947350/permalink/1872169166543225/\nEP2 filter ไม่ filter www.facebook.com/groups/791461357947350/permalink/1873899479703527/\nรอบนี้ผมได้ TB21 ชิบแท้มาแล้ว เดี๋ยวจะเอามาเทียบกับ\nTB1 ที่ mod มาจากบ้านหมอ (แน่นอนชิปจีน) ว่าต่างกันอย่างไร\nและไหน ๆ ก็ไหน ๆ เอาแอมป์ตัวอื่น ๆ ที่ใช้อยู่มาวัดด้วยเลยละกัน\nและวันนี้ก็ต้องขอขอบคุณ Tonehub Studio เช่นเคยที่มาให้ข้อมูลและช่วยวัด\nฝากติดตามผลงานที่ www.youtube.com/@tonehubstudio\nอุปกรณ์ที่ใช้วัด\nโน๊ตบุค Asus Zen Book ไม่เสียบสายชาร์จ\nAudio Interface: Apogee duet 3\nการเชื่อมต่อดังภาพ\nPower supply ของแอมป์ทั่วไปจะใช้เป็น power supply 19V บ้าน ๆ จาก Shoppee\nถ้าตัวไหนใช้ power supply ตัวอื่นจะระบุอีกที\nทุกครั้งที่ทดสอบจะพยายามหมุนความดังของแอมป์ให้เท่ากับความดังจากสาย Reference\nความดังสูงสุดจะอยู่ประมาณ -5 dbFs (ขออภัยที่ยังไม่สามารถทำให้เป็น 0 dbFs ได้)\nดังนั้นความดังที่วัดของแอมป์แต่ละตัวจะไม่เท่ากัน แต่จะห่างกันไม่มาก\nและในการวัดถ้าแอมป์ตัวไหนปรับ Eq หรือ Treble Bass ได้ ผมจะพยายามปรับให้ flat ที่สุดก่อนวัดเสมอ\nถ้าท่านใดเห็นว่าควรปรับปรุงวิธีการวัดอย่างไรก็คอมเม้นต์ได้นะครับ\n\nเอาหละงั้นมาเริ่มวัดกันเลย\nเริ่มจากแอมป์ตัวแรก ขอเป็นตัวมีมาตรฐานหน่อย เพื่อเป็นตัวอย่าง\nCAMBRIDGE AUDIO CXA80 INTEGRATED AMPLIFIER\nภาพแรกของแอมป์แต่ละตัว\nด้านบนจะเป็นรูปผลิตภัณฑ์\nกราฟด้านล่างเป็น Frequency Response หรือ FR\nปกติแล้วแอมป์ที่มามาตรฐานเราจะคาดหวังให้กราฟนี้เป็นเส้นตรงตั้งแต่ 20-20k Hz\nมารู้ภายหลังว่าตอน sweep ลืมปรับค่าควาทแรงเป็น 0 ตอนนี้เป็น -12dBFs เลยจะต่ำกว่า -10dB นิดหน่อย\n\nรูปที่สอง\nกราฟด้านบนจะเป็น distortion หรือความบิดเบือนคือเมื่อสั่งให้เล่นเสียงที่ความถี่นี้\nจะต้องไม่มีเสียงความถี่อื่นออกมา ถ้ามีมากค่าก็จะสูง ถ้ามีน้อยค่าก็จะต่ำ\nและถ้าต่ำกว่า noise floor ก็จะกลายเป็นสีเทา\ndistortion ที่วัดจะมีหลาย order เช่น 2nd order, 3rd order ไปเรื่อยๆ จนถึง 9th order\nซึ่งขอไม่พูดถึงใน EP นี้ และจะมี distortion รวมของทุก order เรียกว่า Total Hamonic Distortion\nหรือ THD นั่นเอง\nจากในกราฟจะเป็นเส้นบนสุดประมาณ -20dB เรียกว่าเส้น Fundamental\nเส้นที่สองลองลงมาจะเป็น THD จากรูปจะเห็นสองเส้นซ้อนๆ กันอยู่\nเส้นหนึ่งเป็น THD อีกเส้นเป็น 2nd order\nเนื่องจากการวัดแต่ละครั้งยังไม่สามารถวัดที่ระดับสัญญาณเดียวกันได้\nเวลาดูกราฟนี้เลยอยากให้ดูส่วนแตกต่างระหว่างเส้น Fundamental และ THD เป็นหลักครับ\nกราฟด้านล่าง คือ Fast Fourier Transform หรือ FFT\nถ้าใครเป็นช่างอิเล็กทรอนิคก็คงจะคุ้นฟังชันก์นี้ของ oscilloscope กันดี\nในทาง audio จะนิยมวัดค่านี้โดยส่งสัญญาณ 1kHz ไปแล้วดูว่ามี distortion หรือ harmonic ที่ไหนบ้าง\nส่วนที่น่าสนใจของกราฟนี้คือจะเห็นว่ามี harmonic ของ 50 Hz ซึ่งเป็นความถี่ของไฟบ้านด้วย\nหรือบ้างก็ว่าโดนเหนี่ยวนำจากเครื่องใช้ไฟฟ้าใกล้ๆ ได้เหมือนกัน\n\nกลับมาที่รุ่นน้องตัวเล็กๆ\nC50L เป็นชิปจีน ไม่มี filter กำลังขับ 50Wx2\nจาก FR จะเห็นเส้นสั่นๆ และมี boost bass ขึ้นมาประมาณ 8 dB\nส่วนเสียงสูงเห็นเส้นหนาๆ เป็นสัญญาณที่ไม่ดีเท่าไหร่\n\nมาดู distortion จะเห็นว่าสูงกว่า CXA80 มาก\nTHD ประมาณ 20% เลย\nและ Harmonic ของ 50 Hz เต็มไปหมด\n\nตัวต่อมา\nMT21 เป็นชิปจีน ไม่มี filter กำลังขับ 50Wx2 + 100W\nสภาพคล้ายๆ C50L แต่เส้นหนาๆ หยักๆ เยอะกว่ามาก\n\nDistortion ไม่ได้ต่างจาก C50L ซักเท่าไหร่\n\nTB-21 ชิป 3116D2 แท้ๆ\nมี filter กำลังขับ 50Wx2 + 100W\nRF มี roll off ย่านสูงและต่ำบ้างประมาณ -2 ถึง -3 db\n\nDistortion เทียบกับสองตัวก่อนแล้วดีขึ้นเยอะ\nTHD สูงสุดอยู่ที่ 0.195%\n\nTB-21 ชิปจีน แท้ๆ โมด์มาจากบ้านหม้อ\nมี filter กำลังขับ 50Wx2 + 100W\nRF มี roll off มากกว่าของแท้หน่อย\nอยู่ที่ประมาณ -4 ถึง -6 db\n\nDistortion มากกว่าตัวแท้\nTHD สูงสุดอยู่ที่ 0.318%\nและมี noise ย่าน sub bass สูงกว่าด้วย\n\nตัวต่อมา ตัวนี้ผมชอบมาก ใช้งานสนุกดี\nต่อแอป streaming อย่าง Spotify หรือ Tidal ตรงๆ ได้เลย\nและสั่งให้เล่นเพลงพร้อมๆ กันหลายๆ ตัวผ่าน LAN network ได้อีกด้วย\nArylic Up2Stream Amp 2.1 50Wx2 + 100W\nชิปเป็น 3115D2\nRF จะเห็นมี roll off ที่ bass เพราะเป็น amp 2.1\nถ้าจะปรับต้องซื้อแอปจาก Arylic เพิ่ม ซึ่งตอนนี้ผมยังไม่มีงบ\nถ้าใครสนใจแล้วไม่มี subwoofer ผมแนะนำให้ซื้อ 2.0 ไปจะดีกว่า\nตรงย่านสูงมีแอบสั่นนิดๆ\n\nTHD สูงสุดที่ 0.176% พอๆ กับ TB-21\nแต่เฉลี่ยแล้วดีกว่า\n\nมาถึงตัวสุดท้ายของวันนี้\nFosi V3 300Wx2\nชิป TPA3255 ตัวเดียวกับตระกูล AS21\nไม่มีพัดลม ใช้เคสในการระบายความร้อน\nRF มองผ่านๆ แทบเห็น เกือบจะเรียบเหมือน CXA80\nแบบมียกย่านแหลมนิด ๆ เห็นใน audio science review (ASR)\nบอกว่าขึ้นอยู่กับ load ถ้า 8 ohm จะยกขึ้น ถ้า 4 จะตกลงเล็กน้อย\n\nDistortion คือเงียบเลยผมวัดได้น้อยกว่า 0.004% จากที่เขาเครมไว้ที่ 0.001%\nซึ่งยังไงก็ดีมากแล้ว\n\n"},"Amplifiers/ZK-APTX1":{"title":"ZK-APTX1","links":[],"tags":[],"content":"ผลการวัด Wuzhi Audio ZK-APTX1\nใช่ Adapter 24V บ้าน ๆ (และบ้านมากไปหน่อย เดี๋ยวจะเห็นในผลการวัด)\nวัดเฉพาะ channel L-R\nใช้ output ประมาณ 1Vrms\nload 8 ohm\n\nผลการวัดสามารถ download ได้ที่\ndrive.google.com/file/d/1_Fgx_K4sUFgdMDzlSNH52pVPOjwyMK-_/view\n\nหมายเหตุเล็กน้อย\n\nใช้กำลังค่อนข้างต่ำ power &lt; 1W\nตอนวัดไม่ได้ทำการ calibrate Voltage\n\n\n\nวัด tone volume\nหมุนทั้ง Treble และ Bass\nสีน้ำเงินหมุนลงสุด\nสีเขียวหมุนอยู่ตรงกลาง\nสีแดงหมุนสูงสุด\n\n\n\nneutral tone\n\nบิด bass สูงสุด และ treble ตรงกลาง\n\n\nวัด Noise Floor\n\nคือสัญญาณเงียบ ๆ ที่ยังไม่ได้เล่นอะไร\nจะเห็นว่ามี 50Hz และ harmonic ขึ้นมาสูงมาก ๆ\nซึ่งก็เกิดจาก adapter ที่เสียบไฟบ้านอยู่ 50Hz นี่ก็มาจากไฟบ้านนี่แหละ\nอีกอย่างหนึ่งคือตัวแอมป์เองก็ไม่ได้มีการป้องกัยตัวนี้ไว้ด้วย\nซึ่งก็ไม่แปลกด้วยราคาและการออกแบบมาเพื่อใช้ลำโพง Bluetooth ที่ใช้แบตเตอรีเป็นหลักอยู่แล้ว\nnoise 50Hz นี่ก็จะหายไป\n\n\nทดสอบ single tone 1k Hz\n\nเป็นการยิง sine wave ความถี่เดียว คือ 1000 Hz\n\n\nผลทดสอบ single tone 1k\nมี harmonic ของ 1k เล็กน้อย ถ้าไม่สน 50Hz THD+N น่าจะต่ำกว่า 0.02% ตามสเป็คอยู่\n\n\n\nทดสอบ SMPTE\nเป็นการทดสอบดู  intermodulation distortion (IMD) หรือการทดสอบดูความเพี้ยนเมื่อมีสัญญาณตั้งแต่ 2 สัญญาณขึ้นไป\nSMPTE จะใช้สัญญาณความถี่ต่ำและความถี่สูง พร้อม ๆ กัน\n\n\n\nผลทดสอบ SMPTE\n\n\n\nทดสอบ DIN\nคล้าย ๆ SMPTE แต่เปลี่ยนเป็นคู่ 250 Hz และ 8k Hz\n\n\n\nผลทดสอบ DIN\n\n\n\nทดสอบ CCIF\nเป็นการทดสอบสัญญาณที่อยู่ใกล้ ๆ กัน\nแอมป์ที่มีปัญหาจะมี distortion ที่ความถี่ส่วนต่างระหว่างสองสัญญาณ\n\nอย่างตัวนี้ 19k Hz และ 20k Hz ถ้าแอมป์มีปัญหาจะเห็นแท่ง 1k Hz ขึ้นมา\n\n\nผลทดสอบ CCIF\nจะมีแท่ง 1k Hz ขึ้นมาเล็กน้อย แจ่ด้วย noise floor ที่สูงจึงเห็นไม่ชัดนัก\n\n\n\nทดสอบ Multitone\n\nทดสอบยิงสัญญาณ 16 ความถี่พร้อม ๆ กัน\n\n\nผลทดสอบ Multitone\n\n"},"Cable":{"title":"Cable","links":[],"tags":[],"content":"Isolator\n\nPVC\n\nworst\nrust / corrosion\nrecyclable\n\n\nPTFE\nXLPE\n\nno chloride\n\n\n\nTechnical About Cable\nwww.canare.co.jp/en/products/cables/index.php\nwww.transformer-tester.com/info/the-difference-between-pe-pvc-and-xlpe-cable-74276000.html"},"Cables--and--Connectors":{"title":"Cables & Connectors","links":[],"tags":[],"content":"Connectors\nXLR\nNeutrik ⭐⭐⭐\nAmphenol ⭐⭐\nmagnetic\nRean ⭐⭐\nnon-magnetic\nLIDGE ⭐\nNeutrik copy\nVLOG EP503 โต ติงต๊อง ชอบใช้หัวปลั๊ก XLR ยี่ห้ออะไร? - YouTube\nTS/TSR - 6.5\nNeutrik ⭐⭐⭐\n\nNP3-XB\n\nMITSUMI ⭐\n\nTS only\nmagnetic\n\nAmphenol ⭐⭐\n\nSuper strong cable camp\nmagnetic\n\nLIDGE ⭐⭐\n\nmagnetic\n\nTS/TSR - 3.5\nMITSUMI ⭐ (BIG)\nmagnetic\nAmphenol ⭐⭐⭐\nmagnetic\nRean ⭐⭐\nChina Neutrik\nmagnetic\nRCA\nMITSUMI ⭐⭐⭐\nRean ⭐⭐⭐\nAmphenol ⭐\n\nonly compatible with bigger wire\nmagnetic\n\nVLOG EP504 โต ติงต๊อง ชอบหัวปลั๊ก TS TRS และ RCA ยี่ห้ออะไร - YouTube"},"Crossover/C-vs-Crossover/C-vs-Crossover-1":{"title":"C vs Crossover 1","links":[],"tags":[],"content":"สวัสดีส่งท้ายปีทุกท่าน\nวันนี้ผมมีของขวัญเป็นเทคนิคเล็กๆ น้อยๆ มาฝาก\n\nโปรเจคนี้ ทำเตรียมวัด\nC vs Crossover ตามคำขอ\nคิดว่าน่าจะได้ลงวันปีใหม่พอดี : D\n\nสีข้างขาวๆ นั่นคือแอบทำแตกแหละ  : D\n\n\nลำโพงปูน\n\n\n\nbi-wire หรือ bi-wiring บ้างก็ว่าเอาไปใช้กับ bi-amp แล้วเสียงดี\nแต่ผมว่าเอามาต่อออกแบบ crossover นี่แหละดีที่สุด\n\n\n\nกาวดินนำมันสารพัดประโยชน์ ติดได้ทุดที่ ที่คิดว่าจะรั่ว\n\n\n\nเบื่อไขควงเจาะลำโพงมาหลายดอกแล้ว ใช้หกเหลียมดีกว่า ปลอดภัย\n\n\n\nตอนต่อไป วัดลำโพงออกแบบ Crossover\n\n"},"Crossover/C-vs-Crossover/C-vs-Crossover-2":{"title":"C vs Crossover 2","links":[],"tags":[],"content":"ตอนนี้ผมจะเล่าขั้นตอนการออกแบบ crossover ที่ใช้ทดลอง\n\nขั้นตอนแรกในการออกแบบ crossover จะต้องเริ่มจากกัดวัดเสียก่อน\n( บางท่านอาจจะตบเข่าแล้วกล่าวว่า กุว่าแล้วววว~ )\n\nคุณอาจจะสามารถเอากราฟจาก datasheet ที่โรงงานให้มา มาใช้ในการออกแบบ crossover ก็ได้\nแต่ถ้าจะให้แม่นยำที่สุดก็ต้องวัดจริงหลังจากใส่ลำโพงลงตู้เรียบร้อยแล้ว (ซึ่งอันนี้สำคัญมาก จะวัดลำโพงโดยยังไม่ใส่ตู้ก็จะไม่ได้ผลดีที่สุด)\nอันนี้เป็นเหตุผลที่ผมใช้ bi-wire เพราะจะทำให้ต่อ woofer และ tweeter แยกจากกันได้ง่ายขึ้น บางท่านสามารถเดินสายออกมาทาง port ได้เช่นกัน แต่ในกรณีของผมการเดินสายไฟผ่าน port นั้นทำได้ยากเพราะ port ค่อนข้างยาวและขดอยู่สองชั้น\nขั้นตอนการวัดผมทำตามบทความ\ndocs.google.com/document/d/1K_Ayk_l8lwntYFocBcB9dnN_VmSE6B11esgMWWMnqXw\nซึ่งหวังว่าทุกคนจะคุ้นเคยกันดี : D\nเอาเป็นว่าผมไม่ลงวิธีวัดละเอียดนะ ใครสงใสตรงไหนก็คอมเม็นถามได้เลย\n\n\nวัดลำโพงผมใช้แรงดันไฟไม่มาก\n\n\n\nจัดห้องเล็กน้อยและวางลำโพงห่าง 50 ซม.\n\n\n\nImpulse\n\nImpulse Response วันนี้จัดว่าดูดีเลย\nfirst reflection เข้ามาหลัง 5 ms\n\n\nวัด woofer far field\n\n\n\nวัด tweeter far field\n\n(รูปลำโพงผมไม่ได้ถ่ายตอนย้ายสายมา ให้คิดว่าสายลำโพงเสียบอยู่ที่ binding post คู่บน)\n\n\nวัด woofer และ tweeter พร้อมกัน\n(รูปไม่ได้ถ่ายเช่นกัน อันนี้จะมีสายอีกคู่หนึ่งเชื่อมระหว่าง binding post ชุดบนและล่าง)\n\n\n\n\nวัด woofer และ port แบบ near field\n\n\n\nรวมค่า Frequency Response (FR) ของ woofer\n\n\nวิธีการโดยสังเขป\n0. ปรับเสียง port ตามสมการ 20 x log(Dp/Ds) โดย Dp คือเส้นผ่านศูนย์กลางของ port และ Ds คือเส้นผ่านศูนย์กลางลำโพง หรือ 10 x log(Ap/Sd) Ap พื้นที่หน้าตัดของปาก port และ Sd คือพื้นที่หน้าลำโพงจาก T/S parameter\n\nเอาเสียงจาก port และ woofer มารวมกัน\nแก้ diffraction ด้วยโปรแกรมคำนวณอื่นๆ\nทำ alignment ผลลัพธ์หลังแก้กับ woofer far field\nต่อ FR ทั้งสองเข้าด้วยกัน\n\nก็จะได้ FR ของ woofer\n\n\nโยนค่าต่างๆ ลงโปรแกรมออกแบบ crossover\n\nซึ่งผมใช้โปรแกรม VituixCAD 2\nผมก็ใส่ค่าทั้ง FR และ Impedance ของลำโพงลงไป\nและต่อลำโพงกับสัญญาณแบบเปล่า ๆ ก่อน\n\n\nปรับ delay ของ tweeter\n\nผมก็จะ overlay FR ที่ได้จากการเปิด woofer และ tweeter พร้อมกัน ลงบน Power &amp; DI\nจากนั้นก็ปรับเวลาในวงกรมสีฟ้า ให้กราฟทั้งสองเส้นใกล้เคียงกันที่สุด\n\n\nออกแบบ crossover\n\nวิธีการออกแบบนั้น คุณอาจจะต้องศึกษาวงจร crossover แบบต่าง ๆ มาก่อน\nจากนั้นก็ลอง “มั่ว” ปรับนู้น ปรับนี้ดู จนผลออกมาดีที่สุด\nวงจรที่ควรศึกษาได้แก่\n\nFirst order high/low/band-pass filter\nSecond order high/low/band-pass filter\nThird order high/low/band-pass filter\nL-pad\nSerial/Parallel notch filter\n\nซึ่งผมอาจจะเอามาเล่าวันหลัง แต่น่าจะนานซักหน่อย\nระหว่างนี้โปรแกรมจะมี LIB ตัวอย่าง ซึ่งสามารถใช้ศึกษาได้เช่นกัน\n\n\nสิ่งสำคัญอย่างนึงของวงจร crossover\nคือ phase ของ woofer และ tweeter ที่ตำแหน่งจัดตัด crossover จะต้องเท่ากัน\n\nวิธีเช็คง่าย ๆ วิธีนึงคือ invert ลำโพงดอกนึง ถ้าเสียงมันหักลงไปเยอะ ๆ นั้นคือใช้ได้เลย\n\n\nวงจร C ที่ tweeter ตัวเดียว\nแต่เนื่องจาก tweeter มันดังกว่า woofer มากผมขอใส่ R เพิ่มอีกตัวหนึ่ง\nส่วนผลจะออกมาเป็นอย่างไร เสียงจะดีไหม โปรติดตามตอนต่อไป\n\n"},"Crossover/C-vs-Crossover/C-vs-Crossover-3":{"title":"C vs Crossover 3","links":[],"tags":[],"content":"เอาหละทำผลทดสอบครบแล้ว\nวิธีการทดสอบ ผมจะอัดเพลงมาช่วงนึงโดยใช้วงจรทั้งสองแบบ\nวีดีโอจะเปิดเพลงที่อัดและเพลงต้นฉบับสลับ ๆ กัน\nโดย Baseline คือเพลงต้นฉบับ\n(บางวีดีโอเขียน Base Line อันนั้นเขียนผิด จริง ๆ ต้อง Baseline แต่ผมขี้เกียจกลับไปแก้ : P )\nA และ B เป็นเสียงที่อัดจากลำโพงทั้งใช้ C และ Crossover สลับ ๆ กัน\nวงจร A ในวีดีโอนึง อาจจะเป็น B ในอีกวีดีโอนึง\nคำเฉลยว่า A B ในแต่ละเพลงคืออะไรจะอยู่ที่รูปสุดท้าย\nเวลาฟังผมแนะนำให้ใช้หูฟัง หรือลำโพง monitor และเปิดดังกว่าปกติเล็กน้อย\nพร้อมแล้วไปทดสอบกันเลย\ndrive.google.com/drive/folders/1A0gP2zrCeO6RJVZAEDsLYuONNyEseOok\n\n\nหนู มิเตอร์ - เสียงขลุ่ยเรียกนาง\nคิดว่า A กับ B คืออะไร ก่อนดูเฉลยคอมเม็นด้านล่างเลยครับ\n\n\nJennifer Warnes - Somewhere, Somebody\nคิดว่า A กับ B คืออะไร ก่อนดูเฉลยคอมเม็นด้านล่างเลยครับ\n\n\nPolyphia - Ego Death feat. Steve Vai\nคิดว่า A กับ B คืออะไร ก่อนดูเฉลยคอมเม็นด้านล่างเลยครับ\n\n\nDisclaimer\nThis video is for educational purposes only.\n\n\nผลการวัด C ตัวเดียว\nจะเห็นว่าเสียงแหลมนั้นสูงมาก เวลาทดสอบเลยไม่ได้ใช้วงจรนี้\n\n\n\nC + R\n\n\nตัวนี้เป็นตัวที่ใช้อัดเสียงจริง\nใส่ R เพิ่มเพื่อกดเสียงสูงลงมาหน่อย\nมีจุดนึงที่อยากให้สังเกตคือ ยอดแหลม ๆ ที่ 10k Hz\nซึ่งจะเห็นว่ามีส่วนที่ยื่น ๆ ออกมาด้วยใน waterfall\nส่วนนี้เป็นเสียงที่เกิดจากการสั่นพ้องในดอกลำโพง woofer ที่เรียกว่า cone breakup\nซึ่งตำแหน่งทีเกิดของดอกลำโพงแต่ละดอกจะไม่เท่ากัน ส่วนใหญ่ดอกที่ Fs ต่ำ ๆ ก็จะเกิดไว 2k Hz บ้าง 3k Hz บ้างก็มี\n\n\nCrossover (ผิด)\nตัวนี้บังเอินว่าต่อผิดลืมใส่ไปชิ้นนึง พอเดาได้ไหมว่าลืมอะไร?\n\n\n\nCrossover\n\nวงจรนี้ต่อถูกต้องแล้ว วงจรที่แล้วลืม R ไปตัวนึง\nจากกราฟจะไม่เห็น cone breakup แล้ว\n\n\nเฉลย\n\nเป็นอย่างไรกันบ้างครับ ทายถูกกันหมดไหมครับ\n\nExtra\nทำไมผมถึงชอบเอาพอร์ตด้านหลังมากกว่าพอร์ตด้านหน้า\nถ้าสังเกตดูจะเห็นว่ามีเสียงย่าน 500 และ 1800 ดังขึ้นมา\nเสียงนี้เรียกว่า Internal standing wave หรือ คลื่นนิ่งภายในตู้\nซึ่งมันอาจจะเกิดจากการสั่นพ้องภายในตู้หลุดออกมา\nซึ่งเสียงย่านนี้จะมีทิศทาง ถ้าเราเอาพอร์ตเปิดออกมาด้านหน้า\nมันก็จะออกมาให้ผู้ฟังได้ยิน แต่ถ้าย้ายไปด้านหลัง\nมันก็จะพุ่งเข้ากำแพงไป\nส่วนเสียงย่านต่ำที่เราต้องการ ตัวนี้จะไม่มีปัญหา\nเพราะความยาวคลื่นมันยาวมาก ยกตัวอย่างในรูป 65 Hz\nความยาวคลื่นอยู่ที่ 343/65 = 5.28 เมตร\nซึ่งความยาว 5.28 ม. มันยาวกว่าหน้าตัดลำโพงที่ 20 ซม. มาก\nเสียงด้านหลังก็จะมาถึงด้านหน้าด้วย\nบทความอื่นๆ\nลองฟังเสียงเปรียบเทียบระหว่าง C ตัวเดียวกับ Crossover ดูหรือยัง?\nลองได้ที่โพสต์นี้เลย\nwww.facebook.com/groups/791461357947350/permalink/1916343838792424/\n"},"Crossover/Capacitor":{"title":"Capacitor","links":[],"tags":[],"content":"Dissipation factor\n\nESR\nWhy is ESR important?\nElectrolytic capacitors are used as input buffers to supply energy when the mains input voltage is too low, store energy while an AC/DC converter adapts to a new power level, and prevent switching noise from the converter reaching the power source. On the output of a converter, they act as a filter and current sink for inductive elements, and, in DC/DC conversion, function as an energy buffer when the power output demand changes.\nIn both cases, losses due to ESR will inhibit a capacitor’s ability to quickly source or sink charge. At the input, increasing ESR increases high frequency noise across the capacitor, decreasing filtering effectiveness. At the output, higher ESR causes more ripple, influencing stability of the control loop.\nESR is particularly important in applications with low duty-cycle, high-frequency current pulses. Here, the ripple voltage due to the ESR will be greater than expected based on capacitance alone, although the negative correlation of ESR with temperature means that ripple decreases as the assembly warms up.\nAlso, the introduction of a resistive element into what designers may assume is a purely reactive circuit can lead to unexpected shifts in phase response, again affecting stability.\nref. www.avnet.com/wps/portal/abacus/resources/article/understanding-esr-in-electrolytic-capacitors/\nClarity Cap\nSuper hi-end\nwww.claritycap.co.uk/products/pur.php\nDayton\nwww.samdee-audio.com/category/60/capacitor-for-crossover-network/dayton-audio-capacitor\nSolen\nwww.samdee-audio.com/category/59/capacitor-for-crossover-network/solen-capacitor\nSolen (counterfeit)\nshopee.co.th/เน็ตเวิร์ค-คาปาซิเตอร์เกรดออดิโอ-สีดำ-400V-i.44695276.5819055380\nMDL\nwww.samdee-audio.com/category/92/capacitor-for-crossover-network/m-d-l-capacitor\nSpec\nXc​=2πfC1​\nDF - Dissipation Factor\nDF=tan(δ)=Xc​ESR​\nESR - Equivalence Serial Resistance\nESR=tan(δ)⋅2πfC1​\nCapacitors Measurement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNameC (\\microF)F (Hz)ESR (\\ohm)DF (%)Qδ (deg)Nichi P 2220.991201.9383.07132.571.7591k1.061.0613.577.36910k0.6702106.40.940346.76Nichi BP 4745.511201.3734.65721.472.6661k0.709619.645.09111.1110k0.3606162.50.615358.4Solen 2.22.1812033.265.45718.333.1241k0.0071020.009733102800.00557610k0.49266.75414.813.864Solen 4747.041200.42761.51765.930.8691k0.506615.096.6258.58310k0.2994140.90.709554.64OHVL white 2.22.19512031.495.2219.162.9881k0.31080.4289233.20.245710k0.5617.68613.014.395OHVL blue 2.22.18512033.315.47618.263.1351k0.0070610.009681103300.00554710k0.49126.75314.813.863Nichi + OHVL47.781201.2984.62121.642.6461k0.687920.054.98811.3410k0.3436165.60.603958.87"},"Crossover/DIY-Inductor-results":{"title":"DIY Inductor results","links":[],"tags":[],"content":"1xx μH\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDateWire (mm)Inductance (μH)Resistance (\\ohm)Weight (g)2023-12-300.71200.299523.1\n3xx μH\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDateWire (mm)Inductance (μH)Resistance (\\ohm)Weight (g)2023-12-300.73110.52539.92024-01-120.73290.535400.7329.40.53140\n5xx μH\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDateWire (mm)Inductance (μH)Resistance (\\ohm)Weight (g)2024-01-120.7564.60.71452.30.7560.80.70251.70.9502.80.354111.10.9562.70.380118.5\n10xx μH\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDateWire (mm)Inductance (μH)Resistance (\\ohm)Weight (g)\n12xx μH\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDateWire (mm)Inductance (μH)Resistance (\\ohm)Weight (g)2024-01-120.912090.637195"},"Crossover/Inductor":{"title":"Inductor","links":[],"tags":[],"content":"Placement\n\nImportant spec\nThere is a limit called Isat​  (I saturated)\nIsat​ is a value of current that a inductor start to act like a normal resistor.\nDCR resistant at DC\nESR resistant at measure frequency\nProblem with iron core inductor\niron tent to hold residual charge so it will smear the signal\nthis will not critical in low frequency but I will color the sound of\nhigher frequency"},"Crossover/Type-of-Crossover":{"title":"Type of Crossover","links":[],"tags":[],"content":"Type by Order\n\n1st order – 6 dB / octave slope.\n2nd order – 12 dB / octave slope.\n3rd order – 18 dB / octave slope.\n4th order – 24 dB / octave slope.\n\nType by\n\nLinkwitz-Riley crossover – which matches the attenuation slopes, so they combine for a flat response at the crossover point.\nButterworth crossover – which creates a small peak in response at the crossover point.\nBessel crossover – is somewhere between the first two.\n\nCircuits\n\nFirst order high/low/band-pass filter\nSecond order high/low/band-pass filter\nThird order high/low/band-pass filter\nL-pad\nParallel notch filter\nZobel network\nSerial notch filter\n"},"Dayton/Selection":{"title":"Selection","links":["Dayton/TCP115-4"],"tags":[],"content":"Woofer\n15W\nDayton Audio ND65-8 - 2.5″ Full-range (loudspeakerdatabase.com)\n20W\nDayton Audio PC68-8 - 2.5″ Full-range (loudspeakerdatabase.com)\nDayton Audio DS90-8 - 3″ Full-range (loudspeakerdatabase.com)\nDayton Audio DSA90-8 - 3″ Full-range (loudspeakerdatabase.com)\nDayton Audio ND90-8 - 3.5″ Full-range (loudspeakerdatabase.com)\n30W\nDayton Audio PC83-8 - 3″ Full-range (loudspeakerdatabase.com)\nDayton Audio ND91-8 - 3.5″ Full-range (loudspeakerdatabase.com)\nFull-range\n15W\nDayton Audio - RS75-8 3” Reference Full-Range Driver 8 Ohm\n30W\nDayton Audio RS100-8 - 4″ Full-range (loudspeakerdatabase.com)\nTweeter\n15W\nDayton Audio - ND20FA-6 3/4” Neodymium Dome Tweeter 6 Ohm\n20W\nDayton Audio - ND25FA-4 1” Soft Dome Neodymium Tweeter 4 Ohm\nDayton Audio - ND25FN-4 1” Neo Silk Dome Tweeter Element 4 Ohm\nสามดีออดิโอ\n30W\nDayton Audio - ND28F-6 1-1/8” Neodymium Dome Tweeter 6 Ohm\nSubwoofer\n40W\nDayton Audio TCP115-4 - 4″ Woofer (loudspeakerdatabase.com)\nDesign\n\nTCP115-4\n\n50W\nDayton Audio DS135-8 - 5″ Woofer (loudspeakerdatabase.com)\nDayton Audio DSA135-8 - 5″ Woofer (loudspeakerdatabase.com)"},"Dayton/TCP115-4":{"title":"TCP115-4","links":[],"tags":[],"content":"Vented\nSize\nVb = 3L\nactual V = 3.3L\nInternal dim. 127.7 x 145.6 x 177.5 mm\nPort dim.\nDv =\nLp\n6th orders bandpass\nSize\nRear\nVb = 8 L\nFb =  28 Hz\nspeaker volume adjust:  0.22 L\ntarget volume: 8.22 L\nInternal dim.  185.0 x 185.0 x 240.2 mm\nVent dim. 185 x 11 mm\nDv = 4.364115 cm\nK = 0.85\nLv: 67.65 cm\nFront\nVb = 0.7 L\nFb = 88 Hz\nspeaker volume: 0.02 L\ntarget volume: 0.68 L\nInternal dim. 140 x 120 x 40.47 mm\nVent dim. 140 x 8 mm\nDv = 3.21505 cm\nK = 0.85\nLv: 42.08 cm"},"Enclosure-Types/Bandpass-Enclosure":{"title":"Bandpass Enclosure","links":[],"tags":[],"content":"Pros\n\nHigher efficiency, +5db more than sealed\nLow woofer excursion\nGood choice for high SPL applications\n\nCons\n\nenclosure can be big\ndifficult to design, no room for error\ntoo much efficiency make sound poor\nThe more order you go, the less quality you got\n\n4th order enclosure\n\nenclosure in front of speaker act like low pass filter\n\nAlignments\nS and Ripple\nS = 0.7 → Ripple = 0dB\nS = 0.6 → Ripple = 0.35dB\nS = 0.5 → Ripple = 1.25dB\nSensitivity\nlower sensitivity (likes -3dB) higher bandwidth\nTriple chambers\n\n2 drivers facing each other inside ported chamber\nmultiply volume of ported chamber by 2\n\n6th order enclosure\n\nno alignment yet\nBose patented this design\nvery low, very low\nparallel 6th order bandpass\nseries 6th order bandpass\n"},"Enclosure-Types/Enclosure-Dimension-Ratio":{"title":"Enclosure Dimension Ratio","links":[],"tags":[],"content":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBL1L211.171.4711.452.111.281.5411.261.611.141.3911.121.41"},"Enclosure-Types/Enclosure":{"title":"Enclosure","links":["Enclosure-Types/Enclosure-Dimension-Ratio","Enclosure-Types/Infinite-Baffle","Enclosure-Types/Sealed-or-Closed-Enclosure","Enclosure-Types/Vented-or-Ported-Enclosure","Enclosure-Types/Passive-Radiator-Enclosure","Enclosure-Types/Bandpass-Enclosure","Enclosure-Types/Transmission-Line","Enclosure-Types/Horn-Loudspeaker","ABC","Thiele-Small-Parameters","Horn-Londspeaker","Enclosure-Types/Isobaric-loading"],"tags":[],"content":"Calculate Enclosure Size\nLook at golden ratio of enclosure\n\nTypes\n\nInfinite Baffle\nSealed or Closed Enclosure\nVented or Ported Enclosure\nPassive Radiator Enclosure\n4th order enclosure\n6th order enclosure\nTransmission Line\nHorn Loudspeaker\nABC\n\nHow to select enclosure type\nFirst, you need to get Thiele-Small Parameters from speaker datasheet or measure by yourself.\nGenerally\n\nBass reflex is +3dB louder than sealed.\nBandpass has a narrower frequency response bandwidth, compared to bass reflex.\n\nHoffman’s Iron Law\nChoose 2 of\n\nEnclosure size\nEfficiency\nLow-end extension (deep bass)\n\n1. EBP (Efficiency Bandwidth Product)\nEBP=QesFs​\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEBPRecommended&lt; 50Sealed or 4th order50 - 100Either100 - 130Vented or 6th order&gt; 130Horn Londspeaker\n2. Qts\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nQtsRecommended&lt; 0.4Vented0.4 – 0.7Sealed&gt; 0.7free-air or infinite baffle application~ 0.7Most compatible with Transmission Line\n3. Isobaric drivers\nIsobaric loading\n\nPut 2 speakers series to each other (magnet to cone) or facing each other (cone to cone)\nsame Fs, same Qts\nbut cut Vas in half\nso smaller enclosure can be build\n"},"Enclosure-Types/Horn-Loudspeaker":{"title":"Horn Loudspeaker","links":[],"tags":[],"content":""},"Enclosure-Types/Infinite-Baffle":{"title":"Infinite Baffle","links":[],"tags":[],"content":"\nbaffle that larger than 17 meters (more than the length of 20 Hz frequency)\nVb​≫Vas eg, over size enclosure, or woofer in the car\n\nPros\n\ndoesn’t need much power\nless distortion compared to other\nin ideal case, there are no resonance and no diffraction issues\n\nCons\n\nwoofer can reach maximum excursion (Xmech) easily, prone to damage.\n"},"Enclosure-Types/Isobaric-loading":{"title":"Isobaric loading","links":[],"tags":[],"content":""},"Enclosure-Types/MTM-Speaker":{"title":"MTM Speaker","links":[],"tags":[],"content":"MTM = Mid-Tweeter-Mid\n2 Mid range speaker with tweeter on the center"},"Enclosure-Types/Passive-Radiator-Enclosure":{"title":"Passive Radiator Enclosure","links":[],"tags":[],"content":"Pros\n\nno vent resonant\nno air turbulence\nno small frequencies escapes\nspace efficient\n\nCons\n\nsteep roll-off\nless transient stability\nhigher cut off frequency\n\nVd = Sd * Xmax\nVd at least twice  as large as active speaker\npassive radiator Vd &gt; 2 * (Speaker Vd)\nPassive radiator parameter\n\n\nVas → Mms and Sd\nVas​=4π2⋅Fs2​⋅Mmsρ⋅c2⋅Sd2​​\nρ = 1204 g/m3\nc = speed of sound 343 m/s\n\n\nSd\n\n\nFs\n\n\nXmax\n\n\nQms\n\n\nMms = weight of  passive radiator cone + surround/2\n\n\nCms → use weight and measure?\n\n"},"Enclosure-Types/Sealed-or-Closed-Enclosure":{"title":"Sealed or Closed Enclosure","links":[],"tags":[],"content":"\nVb​&lt;Vas\n\nPros\n\nEfficient\nLow distortion\nEasier to build\nSmooth base dropout\nSome varies of box volume is not effect much\n\nCons\n\nLow Efficiency\n\nQtc\nQtc = Total Q (speaker + box)\nQts = Qms and Qes\nQtc = Qbox and Qts\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nQtcResponse PeakCharacter0.500 (Linkwitz-Riley)0Critically damped, lowered SPL, huge enclosure0.5770Optimal driver damping, lowered SPL, best transient response, huge enclosure0.707 (Butterworth)0Usually considered the “optimum” alignment by most designers, gives excellent transient response, low bass performance and power handling, and flattest response curve before F3. Enclosure may be fairly large.0.850+0.69 dBGood alignment if optimum is to large an enclosure, generally very good performance with only slightly accentuated (non-flat) bass, good low bass response. Medium sized enclosure.1.000+1.25 dBBest compromise enclosure. Much smaller box than optimum, fair transient response and low bass performance, more noticeable midbass peak. Medium-smaller sized enclosure.1.100+1.83 dBMaximum power handling and efficiency, smaller sized enclosure, more pronounced midbass peak. Smaller enclosure.1.300+3 dBDriver may sound noticeably boomy, especially smaller drivers with higher Fs and Qts. Fair (or worse) transient response and compromised low bass response. Pronounced mid-bass peak makes the enclosure louder but less accurate. Small enclosure.2.000+6 dBVery boomy and muddy, poor transient response and low bass performance. Very small enclosure.\n&gt; 0.7 call Chebyshev\nQ Value\nQl loss of the box\nQa loss of the absorb material\nFor sealed boxes (lined):\nQl=15\nQa=20\nor some other combo to get Qlt=~10\nFor sealed boxes (stuffed):\nQl=15\nQa=8\nor some other combo to get Qlt =~5\nStuffing\nIsothermal propagation??\nStuffing dumping material in the box can increase box size\nBox Volume (Vb​) Calculation\nVb​=(QtsQtc​)2−1Vas​​\nVb​Vas​​=(QtsQtc​)2−1\nVb = Vas / ((Qtc/Qts)**2 - 1)\n \nVas = Vb * (Qtc/Qts)**2 - Vb\nfb​=fs​⋅Vb​+1Vas​​​\nfb = fs * (Vas/(Vb+1))**0.5\n \nfb = fs * (Vas/(Vas / ((Qtc/Qts)**2 - 1)+1))**0.5\n \nfb = fs * ( Vb * ((Qtc/Qts)**2 - 1) /(Vb+1))**0.5\n \nf3​=2​fb​​⋅(Qtc2​1​−2)+(Qtc2​1​−2)2+4​​\nf3 = fb / 2**0.5 * ((1/Qtc**2 - 2) + ((1/Qtc**2-2)**2 + 4)**0.5)**0.5"},"Enclosure-Types/Transmission-Line":{"title":"Transmission Line","links":[],"tags":[],"content":"\nport length = 1/4 wavelength of driver Fs​\nport area ≈Sd​\n\nPros\n\nGreat low frequency response\nNot so sensitive to positioning\n\nCons\n\ndifficult to produce\nhard to design\nbad high frequency\nreach Xmech easily\n"},"Enclosure-Types/Vented-or-Ported-Enclosure":{"title":"Vented or Ported Enclosure","links":["Loudness","Thiele-Small-Parameters"],"tags":[],"content":"\nalso called bass reflex\n\nPros\n\nboost specific frequency below Fs\nReduced distortion\nHigher power\n\nCons\n\nSteep dropout (-24dB/Octave)\nNeed to be calculated precisely\nLarger than sealed\nport can be noisy\n\nParameters\n1. Speaker Fs and other T/S parameters\n\nThis is for simulate characteristic of the speaker.\nAdding vent will boost the frequency slightly below Fs.\n\n2. Size of Enclosure (Vb​)\n\nthe bigger the lower frequency boost\ndon’t forget to calculate volume of the speaker\n\nadd volume of a hole\nsubtract rigid part of the speaker\n\n\n\n4. Boost frequency\n\nUse WinISD to help\nUse Online Tone Generator for help\n\nLow bass (&lt;40 Hz) is only good for movies\nMid bass (40-60 Hz) is not matter much in music\nUpper bass (60-120 Hz)\nKick drum is around 40-100 Hz\n\n\n2 Strategies\n\nAs flat as possible\nBoost for compensate Loudness\n\n\n\n3. Vent Size\n\nNeed to be simulated\nGood starting point of vent area is around 3.6 cm^2/l\nIn WinISD, set signal source input power and then change graph to air velocity\n\nGood air speed should below 5% of speed of sound in the air (343 m/s)\n&lt; 17 m/s (&lt; 20 m/s should also be fine)\nIf you use flare port (filleted port) you may use 10% of speed of sound\n&lt; 30 m/s and don’t forget to cut port length by esposimate\nmore air velocity = higher turbulence = higher distortion\n\n\nBigger vent area = lower air velocity = longer vent\nsmaller vent area = higher air velocity = shorter vent\n\n4. Q Leakage\nThis slightly effect the final wave.\nQlt or Qb- Q leakage total is depended on 3 values\nQl is the Q-value due to unwanted enclosure and woofer leakage losses\nQa is the Q-value due to enclosure damping material (or absorption losses)\nQp is the Q-value due to port losses\nWhich\nQlt1​=Qa1​+Ql1​+Qp1​\nIn normal cases Ql is in the range 5-20. Ql is 7 in most cases, but 15 to 30 if the enclosure has very little leakage. Ql may be 7 even with an enclosure with no leakage because the driver unit itself may have leakages.\nA box with moderate lining has a Qa of about 30. A heavily stuffed box can have a Qa of 3. Qa is 7 for about a half-filled enclosure.\nA perfect port will have absolutely no losses in which case Qp is very large. A good port, one which does not significantly restrict air flow, has about 100 of Q-value.\nMeasurements of Ql, Qa and Qp are difficult unless you can assume that all the others are negligible when measuring one of them - which is not realistic in most cases.\nThe values Bullock uses as default:\nQl=14\nQa=28\nQp=28\nBullock’s values give you a Qlt of 7\nWhen running sims, I use:\nFor vented boxes\nQl=15\nQa=30\nQp=30\nSometime Ql can be selected by enclosure size\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nQlSize (l)3 - 5&gt; 70735 - 7010 - 15&lt; 35\n5. Alignment\nFlat\n\nSBB4 or Super Forth-Order Boom Box – is characterized by a large box, low tuning frequency (longer vent) and good transient response (which puts the term boom-box out of place).\nSC4 or Forth-Order Sub-Chebyshev – about the same enclosure size and f3 as the SBB4, but with different tuning frequency. Somewhat degraded transients compared to SBB4.\nQB3 or Third-Order Quasi-Butterworth – is the most popular vented alignment, because it yields a smaller box and a lower f3. However, the transient response is not as good as SBB4 or SC4.\nB4 Forth-Order Butterworth\nBE4 Forth-Order Bessel\nIB4 Butterworth Inter-Order\n\nNone-flat\n\nC4 or Forth-Order Chebyshev – can be useful for low values of ripple (less than 1 db).\nBB4 or Forth-Order Boom Box – has a peak in response close to roll-off, similar to high Qtc sealed boxes (1.2 or higher).\nSQB3 or Super Third-Order Quasi-Butterworth – is a high value Qts extension of the QB3 alignment.\n\n6. Measurement\nwhen measurement speaker and port\nyou need to adjust port SPL using this formula\nAs = Area of speaker same as Sd from S parameters\nAp = Area of port\nAdjust=20×log(AsAp​​)\nPort in-depth\nDv​ - diameter of circular port in cm\nNp​ - Number of ports\nk - correction\nVb​ - Box Volume in litters\nLv​ - port length in cm\nfb​=Vb​(Lv​+kDv​)2.35625×104⋅Dv2​Np​​​\nLv​=16π10c2​⋅Vb​fb2​Dv2​Np​​−kDv​\nLv​=Vb​fb2​2.35625×104⋅Dv2​Np​​−kDv​\nDv​ of other shape with Hydraulic Diameter\nSquare duct\na = Width of the duct\nb = Height of the duct\nWithout hydraulic effect\nD=2πab​​\nNormal\nD=a+b2ab​\nASHRAE’s\nD=1.3⋅(a+b)0.25(a⋅b)0.625​\nOblong ducts\n\nD=1.55⋅(πb+2a−2b)0.25(π4b2​+ab+b2)0.625​\n(1.55*(pibb/4+ab+bb)**0.625/(pib+2a-2*b)**0.25)\nwww.thermexcel.com/english/ressourc/no_circul.htm\nk\n\nfree = 0.307\nflanged = 0.425\nBoth ends flanged: k = 0.425 + 0.425 = 0.850\nOne end flanged, one end free: k = 0.425 + 0.307 = 0.732\nBoth ends free: k = 0.307 + 0.307 = 0.614\n\nPort Flare\nSince the air in the port needs to meet the flat front baffle I imagine that as x → 0, r → infinity. This boundary condition is met by any radius chamfer.\nIf port compression is caused by turbulence then we want laminar flow. From the Wikipedia article that suggests we want the Reynolds number of the fluid to stay below 1800.\nAssume the narrowest part of the port occurs at x=m and that Re​=1800 at that point. How should the port’s radius change to not increase Re while growing at the fastest rate possible?\nRe​=νAQD​\nD is the hydraulic diameter of the pipe (m) (which for round completely full pipes is 2× the radius)\nQ is the volumetric flow rate (m3/s)\nA is the pipe’s cross-sectional area (m2)\nu is the mean speed of the fluid (SI units: m/s);\nν is the kinematic viscosity of the fluid\nRe​=νπr22Qr​\nGroup all the constant terms into a coefficient K\nRe​=r2Kr​=rK​\nSo any increase in r will reduce Re. This implies any increasing are would meet the criteria. But clearly, in real life, it helps to have a more gradually expanding port. I tried to come up with an equation that considers both the axial and radial velocity of air particles, but no luck yet.\nRegarding the use of a 3D printer and more complicated geometries, it is not necessary for sure. I find this to be part of the fun.\nref. www.diyaudio.com/community/threads/optimal-port-flare-geometry.377259/\nReference\n\nBass reflex alignments explained - Step by step - Audio Judgement\nwww.mh-audio.nl/Calculators/WVC.html#volume\nwww.troelsgravesen.dk/vent_tuning.htm\n"},"Group-Delay---Transients":{"title":"Group Delay - Transients","links":["tags/GD","tags/transient"],"tags":["GD","transient"],"content":"GDtransient\nGroup Delay ≈ Transients (but not exact)\nGd​=−dωdΦ​\nGroup delay is the negative of the derivative of the phase curve with respect to radian frequency. So in loose terms, it’s in direct correlation to phase at different frequencies. Group delay (GD) is measured in milliseconds (ms).\n\nPhase is measured in radians.\nRadian frequency is measured in radians / second.\n\nAs a result, GD has units of time (seconds, most likely, milliseconds).\n\n\n\nIn other words, GD is a measure of how fast the acoustic phase changes at different frequencies. It tells how well time relationships between a small group of frequencies are preserved in a narrow frequency region, around the point in frequency where the group delay is evaluated.\nBest thresholds\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFrequency (kHz)Threshold (ms)Periods (Cycles)0.53.21.612221241.568216\nThe best thresholds of audibility table has been provided by Blauert and Laws\nfrom Audio Judgement\n\n1 kHz and above – anything less than 2 ms is good.\n200 Hz – 1000 Hz – less than 4 ms.\nUnder 200 Hz – Expect higher numbers. Even 30-40 ms for the very low frequencies.\n\nFrom testing (or experance)\n\nSpeaker with 30ms @ 50Hz and 10ms @ 60Hz is some what on the threshold of acceptable.\n"},"Hornresp/Hornresp-Bandpass-Enclosures":{"title":"Hornresp Bandpass Enclosures","links":[],"tags":[],"content":"There is a lot to tuning a Bandpass enclosure, so I am not going to get into that right now. I will just show how to set them up. They just build upon what you have already learned in the sealed, and two vented lessons.\nI want to stress that these are not super tweaked example. They are just good enough to get the idea across. \nHere is a 4th Order Single Reflex BP. It has one sealed chamber, and one vented chamber.\n\n\n\nHere is a 6th Order Dual Reflex BP. It has a vented chamber on each side of the driver.\n\n\n\nYou could also do the Dual Reflex BP as a Compound Horn.\nUsing the TH setting you can do a Quasi-6th Order Series-Tuned BP as well.\n\n or \n \n\n\n"},"Hornresp/Hornresp-Basic":{"title":"Hornresp Basic","links":[],"tags":[],"content":"by soho54\nThis is the main screen.\n\nI’m going to take some time, and go through all the functionality first, and then show a few examples of how to do sealed, vented, and some different types of horn subs. Feel free to jump ahead it you, “don’t need no stinking instructions.” It will be here to come back to if you get lost. \nFirst, I must point out that almost everything on this screen can be double clicked to alter it, or pull up another window to input options. Text, and input blocks alike. I won’t go into all the different ways to input things, but you will want to play with this some to see what is there.\nIn order to play with the settings you will need to click Add to start your first session, and then click Edit to alter anything.\nTop Half________________\n\n\nAng is the radiation angle. This is simply the amount of nearby boundaries. It is normally referenced to a “space” parameter. Free Space (Ang=4.00) is the speaker hoisted in the air, and as such has no boundaries nearby. Half Space (Ang=2.00) is the spacer placed on one boundary such as a speaker setting on the ground in the middle of a field. This is the default setting for most all other simulators (WinISD, Unibox…) Quarter Space (Ang=1.00) has two boundaries. Say a sub sitting on the floor pushed up against a wall as well. Eighth Space (Ang=0.50) this is a corner placement, with three boundaries. Hornresp also has one more setting this is Infinite Horn (Ang=0.00) which is only useful when working with horn theory, and ideal horns.\nThere is a tendency for people to say, “Well, I’m putting the enclosure in a corner, so I should use 8th Space.” This is not quite right though. Unless you are building a horn with a mouth so large that it takes up the whole corner from floor to ceiling. You will get an overly optimistic FR with anything else, so it is best not to use it. If you plan on comparing the Hornresp graph to sims from other programs you will want to use Half Space (Ang=2.0)\n\n\nEg is the Voltage you are testing at. Most people are use to inputting/thinking in Wattage, but Wattage changes with frequency in a speaker. Voltage is a more precise method of metering the power in. You can do a fast general conversion to Watts with (Voltage*Voltage)/Re. (HR has a calculator for this. Can you double click, and find it?)\n\n\nRg is the extra resistance from the amplifier and the wires you are using. You can leave this at 0 for the most part, unless you are going to be using a tube amp. 0.08 is a good start for most pro amps, and 6-12ft of wire.\n\n\nS1-S5 are possible cross sectional area inputs you may or may not use.\n\n\nThe four blocks under Rg are the length inputs for the S# sections to the left of each. They are L12, L23, L34, and L45 from top to bottom. Here the top two blocks are used. If you double click the “L12” you can activate the block. Multiple click changes the “L12” into Con, Exp, and then Par (I’ll get to these in a bit.) If you input a number into the block it will lock it in. If you click on something else without entering a distance the cell deactivates, and returns to L12. This also deactivates anything after it as well.\n\n\nThe Cir and F#s are the horn mouth area cut off frequency, and/or horn segment flare angles. They are there for your information, if you need to know such things.\n\n\nBottom Half_____________\n\n\nSd, Cms, Mmd, Re, Bl, Rms, and Le are the driver parameter inputs. You want to enter Sd, Re, and Le first. The other parameters Hornresp will calculate for you by double clicking the blocks, and entering the required info. I do them in order as well, so Cms, Mmd, Bl, and then Rms. You will need the common parameters Vas, Fs, Qes, and Qms to calculate them.\n\n\nThe Nd sets the programs simulation options. I’ll get to this a little later. The block next to it is the number of drivers in the system. If you double click it, a window will open up allowing you to set the number of parallel, and series drivers.\n\n\nOk, here are the last six blocks again.\n\nVrc is the volume of any rear chamber/space the driver is attached to.\nLrc is the length of the rear of the chamber from the driver, or the depth of the chamber.​\nNd is setup with a sealed rear chamber by default, as it is here. It allows you to line the rear walls, and that is what the next two blocks are for.\nFr is the airflow resistance measurement for the lining material. It is in rayls/cm, and can be found on material data sheets online, for a variety of materials.\nTal is simply the thickness of the lining you are adding.\nVtc and Atc define a throat chamber. You can also think of it as a front chamber area. It is not sealed, but you can do a lot of things with it, with more than just horns.​\nNow up top in the Tools tab you can change the sealed rear chamber to something else. Let’s create a vented rear chamber.\n\nNow we get this:\n\nFr &amp; Tal are now Ap &amp; Lpt\nAp is the cross-sectional area of the port, and Lpt is the length of the port.​\nLet’s try that third option out now.\n\nThroat Adapter? What has changed?\n\nNow we have Ap1 &amp; Lpt. This a chamber/section in front of the throat chamber. If you have seen horns where the opening between the driver and the horn is smaller than the cones diameter that is what this is. Ap1 is the area of the opening, and Lpt is the thickness of the wood most of the time.\n​\nIf you are using OD the Throat Adapter is called a Throat Port. It serves the same purpose.\nHere is a graphic illustration of the Vtc/Atc - Ap1/Lpt concepts, as they pertain to horns.\n\nHornresp has many graphing options available after you Calculate a design.\nYou can find them in the Window tab up top. If you go to the Tools&gt;Options tab will can select the first graph to pop up after you hit Calculate, if you don’t care to see the Schematic pop up every time. I use SPL Response myself. \nSchematic Diagram\nThis shows the basic layout of the enclosure you have designed. You can move your mouse over it to display information about each enclosure section.\nAcoustical Impedance\nThis is important for Horns, as it shows the Reactance/Resistance at the horns throat. This is another whole topic.\nSPL Response\nThis is the good’ole FR graph most are used to seeing.\nThere are also other options under this Window. If you check the Tools tab with the SPL Response up you will find an Impulse, Maximum SPL, and Multiple Speakers option. Max SPL is just what it sounds like. You enter a Wattage number, and an Xmax limit, and it shows which is hit first. The Multiple Speakers option, confuses some people. It is not a multiple drivers setting, it is a multiple enclosure setting. If you want to see the SPL of four of your simed speaker enclosures this is what you would use.\nThe Impulse option is broken down into two more options.\nResponse\nThis is the Impulse response of the enclosure. Note that it isn’t band limited in any way. This means if you are doing a sub, there is no way to limit it to the subs bandwidth. Artifacts above the subs bandwidth will alter the IR from what the true in use IR would be.\nSpectrogram\nThis is a different way to look at the IR. Frequency is listed from bottom to top, and time is from left to right. This view is more helpful to newbies as you can see the frequency spread, and can focus on the bandwidth area you need while ignoring the rest.​\nElectrical Impedance\nYou can alter the Ohm Range in the Tools tab if it is too large.\nDiaphragm Displacement\nThis is the excursion graph.\nPhase Response\nThis shows the system total phase, and the delay can be altered in the Tools tab, in time or distance.\nGroup Delay\nThis is another way to look at phase. With some enclosures you will get some large peaks here. These parallel FR peaks, and their Q. If you alter the FR peaks, the GD peaks will be changed as well. This is something to keep in mind before wigging out over it to bad. "},"Hornresp/Hornresp-IB-Setups":{"title":"Hornresp IB Setups","links":[],"tags":[],"content":"IB setups are pretty easy to do.\nIf it is to be flush mounted just sim a sealed enclosure at least 10x the combined drivers Vas. This time we will use two drivers.\n\nTo do a manifold build, use an OD setting. Create a sealed rear chamber that is at least 10x the combined drivers Vas. The manifold opening needs to be at least as much as the combined Sd of the drivers. The driver is ~32cm wide, so will will make the manifold this deep, and split the depth between L12 &amp; L23.\n"},"Hornresp/Hornresp-Normal-Horn":{"title":"Hornresp Normal Horn","links":[],"tags":[],"content":"Single\nThis is Hornresp’s main function, simulating horns. It has a wide assortment of different horn types to chose from, as seen here:\n\nYou can get to this window by selecting the Nd setting, blacking out all data in S1-S5 &amp; L12-L45, and double clicking the L12 input block.\nAll of these horn types are a little different, and will alter the Cir &amp; F# cells to allow you to work with the different profiles. All but Conical, Exponential, and Parabolic can only be used as a single segment horn.\nThey all follow the same basic profile as shown in the picture below. Ap1/Lpt and Atc/Vtc can be left out if they are not needed, but the rest will be needed for every Nd front loaded horn.\n\nI will go over the Hyperbolic flare horn design work flow here as an example. Start off with a blank slate, and select the HYP flare parameter by either double clicking the L12 block, and choosing form the list, or clicking the L12 block and pressing the “H” key.\n\nNow just enter a number into the L12 block, say 500 to lock the HYP profile in.\n\nYou must now input a preliminary horn. Take the Sd/2 and enter it as S1. Then take the Sdx10 as the S2.\n\nIf you look at the Cir parameter it now says “.24” This is the distance of the parameter circumference of the S2 mouth when compared to the horns cutoff frequencies wavelength. I this case the mouth circumference is only .24 or 24% of the cutoffs WL.\nThe frequency cutoff in Hz is given by F12. This is the frequency at which your horn stops loading the driver.\nNotice the red “Caution” that popped up. It is telling you that your driver will not mate up the the horn as it is. This means you need to add a Throat Adapter, which also means a Throat Chamber is created.\nGo to Tools&gt;Chamber and select the Throat Adapter. Ap1 will be the same as S1, and Lpt will the the thickness of the wood. Let’s use 1.8cm here.\nThe Throat Chamber is a little more tricky, but we can guesstimate. Use the drivers Sd as the Atc, and then try to figure out the distance between the drivers cone base, and the top of it’s flange/gasket, then divide it by 3. Using the PDF for this driver I get ~2.72. Remember this is only a fast guess, it would be better to measure the actual dish cc. Take the guessed 2.71 x Atc, and that is Vtc. Vtc=1330.61 This is just a starting point, as the size of the Throat Chamber affects the high frequency loading of the horn.​\nNow a red “Note” has popped up. This is the type of hyperbolic horn you are using right now, and a reminder to input a “T”. The T(it is referred to as “m” as well) is the slope profile of the horn, and is input where F23 use to be. Let’s use .6 for now.\nThe single segment Nd horn will not allow the use of the Loudspeaker Wizard, so lets hit Calculate and check out the SPL Response. (Note: with Con, Exp, and Par you can cheat here by entering a second segment that is a sq cm more than S3, and ~1cm in length. This will allow you to enter the Wizard with no trouble.) Normally you would go ahead, and add the Rear Chamber before siming, but I want to show it’s effect there.\n\n\nIt is a bit bumpy. Let’s go back and enter a rear chamber. We will randomly use Vrc=30, Lrc=30 for now.\n\nThen re-Calculate.\n\nNow it is just a mater of playing with the parameters until you get the response you are after. This applies to all horn types. Each one will require different parameters to reach their potential, but that is beyond the scope of this thread. This will get you running though. \nMulti-Segmented\nYou can also do Multi-Segmented horns with the Con, Exp, and Par flare parameters.\nIt works exactly the same as the Single Segment Nd horns, only it does allow the Loudspeaker Wizard, so you can see the effects of your changes as you make them.\nThere is not a lot to add over the single section horn build. The main difference is that a “T” is not input as you are defining that yourself with the section Sd’s, so I will just give you a diagram and a sample segmented horn demo here.\n\n\n"},"Hornresp/Hornresp-Other-Horn":{"title":"Hornresp Other Horn","links":[],"tags":[],"content":"Offset Driver Horns\nOffset Driver horns are exactly like normal horns, only the driver is not placed at the true throat of the horn. It taps into the horn at a position further down stream from the throat.\nYou input and work with them in exactly the same way as a normal horn with one extra thing to check on. As the driver is not at the throat soundwaves are sent up and down the horn at the same time. This leads to cancellation issues above a frequency set by the round trip distance from the driver to the throat, and back to the driver. The longer the distance the lower the cancellation occurs.\nI am supplying a general parameter placement diagram, and the input screen of the same horn from the Normal Horns(Multi-Segmented) post, converted to an OD horn. This way it can be seen how they are similar, and how the cancellation effects the higher frequencies.\n\n\n\nTapped Horns\nTapped Horns are best though of as an extension of the OD Horn.\nThe key differences are that there is no Rear Chamber, and the second side of the driver taps into the horn as well. If you have made it this far reading straight through, there is nothing really more to add, as you should have no problems with the inputs. The Loudspeaker Wizard can be used with a TH setting.\nDesign parameters are out of the scope of this thread, but simply remember the length of the horn determines how low it will go, and the distance from the Rear Tap to the Throat is what fills in the dips, not the Rear Tap to Mouth distance. \nIf you are flush mounting the driver you do not need the Vtc/Atc &amp; Ap1/Lpt parameters.\nIf you are mounting the driver to the rear of the baffle/horn wall you will need at least the Vtc/Atc added.\n\n\n\nRear Loaded Horns\nA Rear Loaded Horn is simply a Normal horn with no Rear Chamber. Really that is all it is. Instead of a Rear Chamber the driver is mounted externally, and you get the sum of the horn and drivers response.\nTo build one you do the exact same things as the Normal Horn builds (Simple or Advanced,) and just leave the Rear Chamber off. You must then use the Combined Response Graph to get the true FR.\n\nNote: Here I am using the cheat to allow the use of a single segment horn in the Loudspeaker Wizard.\n\nCompound Horns\nA Compound Horn is an enclosure with horn loading on each side of a driver. It is selected by changing the Default Nd to CH.\nWhen you select this option there are several changes to the program. First S1-S4 the first three segments are set aside for the main horn, but you may us as little as one segment. You are also allowed a Throat Chamber for it Vtc &amp; Atc, and a Throat Adapter for it Ap1 &amp; Lpt.\nThe second horn is given the last segment S4-S5, and the Rear Chamber (Vrc &amp; Lrc) becomes it’s Throat Chamber.\nThe loudspeaker Wizard is not allowed with this alignment. You must also use the Combined Response graph with this setup, and the default graph only shows the main horn output.\nThis is a pic that will allow you to get the feel for it, and identify the component locations with the schematic. The demo horn is not a good design by any means. It’s only purpose is to make the areas standout.\n\n"},"Hornresp/Hornresp-Sealed-Enclosures":{"title":"Hornresp Sealed Enclosures","links":[],"tags":[],"content":"Sealed Enclosures\nOK, let’s play with a sealed sub here.\nWill will use one driver in Half Space (Ang=2.00), and 2V as the Re is 4ohm. This gives us 1W. Since we are after a sealed sub we want the Nd option. Zero everything else out.\nInput the parameters as I outlined up top, and you should get this.\n\nNow we need to enter the enclosure. If you know the enclosure size you want already just enter the volume into Vrc, and depth into Lrc. That’s it, hit Calculate, and you are done. If you aren’t sure exactly what you want go into the Tools tab, and start the Loudspeaker Wizard.\n\nIt will open up a new window.​\nJust use the Vrc and Lrc sliders to quickly get a rear chamber, and the switch over to the Response view with the drop down box at the bottom left. As you can see there are several other helpful graphs there as well.\n\nNow you can tweak the enclosure with the sliders some more while observing the FR. \n\nIf you change the drop down to the right to Other, you can change the input voltage. Switch the graph to Displacement to check over excursion.\n\nDon’t let the Series Parallel sliders throw you. It says that there is one driver in series with itself, and one driver paralleled to itself. Two driver in series would be 2S-1P, Four driver in Series/Parallel would be 2S-2P."},"Hornresp/Hornresp-Vented-Enclosures":{"title":"Hornresp Vented Enclosures","links":[],"tags":[],"content":"Simple\nA vented sub is done just like a sealed sub, only you switch on the Rear Vented option in the Tools&gt; Chamber tab. The only limitation is that it only allows for a single port at this time.\nWill will use a Vrc of 50, and Lrc of 30.1 from the sealed example above. You should start from here:\n\nOK, if you know your desired port dimensions enter them into the Ap and Lpt blocks, and Calculate. If you are unsure of that now start the Loudspeaker Wizard up, and play with the Ap and Lpt sliders while looking at the Response graph, until you like what you see. You will need to change the third dropdown bow from default to Combined here. Default with give you the Driver output only, Output 2 is the port only, and Combined is both. \n\nI want you to really look at the pic above. Hornresp shows large peaks, and dips that you may not be use to seeing. These are the resonances caused by the main enclosure area, and the port. The peaks are exaggerated here as the program assumes totally solid materials. In real life the peaks and dips will not be as extreme, but they will be there in some fashion.\nWhen you like what you see save it, and the Calculate. When you open the SPL Response up it will default to the Default graph of the driver only.\nTo change it go to Tools&gt;Combined Response\n\nA new window will pop up.\n\nThis is to set the amount of difference from your ears to the port mouth from the driver. The window does a good job of telling you how to do it, so follow the directions, or just leave it as 0.\n\nAlternate Method\nHere is an alternate way to sim a vented enclosure. The goal here is to get you thinking out of the box.\nIn the last example we ended up with a rear enclosure of 50l 30.1cm deep, with a 200cm2 port 165cm long.\nAll we have to do is move everything around to the other side of the driver. The port can be entered as S1 &amp; S2 as 200, with L12 input as 165. The flare type doesn’t matter here as there is no flare, so just leave it as Con.\nNow the main enclosure is input as the Throat Chamber. Enter the Vtc as 50000 (as it ic cc here, and not liters,) and the Atc requires a little math. All chambers are cylinders here, so you have the height and volume, but need the area of the top or bottom. Math skip… enter 1661.129 for Atc. \n\nNotice the Schematic is flipped around here.\n\n"},"Hornresp/Index":{"title":"Index","links":["Hornresp/Hornresp-Basic","Hornresp/Hornresp-Sealed-Enclosures","Hornresp/Hornresp-Vented-Enclosures","Hornresp/Hornresp-Normal-Horn","Hornresp/Hornresp-Other-Horn","Hornresp/Hornresp-Bandpass-Enclosures","Hornresp/Hornresp-IB-Setups"],"tags":[],"content":"Hornresp Basic\nSealed Enclosures\nVented Enclosures\nNormal Horn\nOther Horn\nBandpass Enclosures\nIB Setups"},"How-loud-you-listen":{"title":"How loud you listen","links":[],"tags":[],"content":"www.youtube.com/watch\nMixing closer to 81 dB may be 82..83\nmixing 90 dB is hurt\nmonitoring 50 - 70 db\n\nmake lower and higher frequencies quieter\n\nwhen mixing use two level\n\nquiet (50-70) → long period mixing\nloud (80-90) → for checking\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSourceSound Pressure Level (dBA)Threshold of Hearing0Rustling leaves20Quiet whisper (1 m)30Quiet office40Normal conversation at 1 m60Inside a car65-80Loud singing70Vacuum cleaner (3 m)75Buses, diesel trucks, motorcycles (15 m)80Jackhammer (15 m)90Concert100Deafening, human pain limit120Jet plane (30 m)130Threshold of pain140Military Jet Take-off (30 m)150Large military weapons180\nMusic: how loud is loud? (youtube.com)\ndBA → dB A-weighted\n\n\nTHX Reference\nSPL need to be more than 85 dB (+20 dB head room)\nSpeaker need to be able to produce 105 dB\nSubwoofer need to be able to play 115 dB"},"Making-Speakers/Horn-Design":{"title":"Horn Design","links":[],"tags":[],"content":"วันนี้ผมเอาผลทดลองที่ได้จาก\nการใส่ horn ให้ tweeter มาฝาก\nวิธีออกแบบ horn ผมเอามาจากช่องนี้\nถึงเสียงจะเป็นเสียง AI แต่เนื้อหาใช้ได้เลย\nwww.youtube.com/watch\nส่วน paper ที่อ้างอิงมาจาก\nAn Introduction to horn theory\nwww.grc.com/acoustics/an-introduction-to-horn-theory.pdf\n\nดอก tweeter\nAIYIMA 1.5 นิ้ว 4 โอม 80W\n\nshopee.co.th/Aiyima-ลําโพงเสียง-1.5-นิ้ว-4-โอห์ม-80W-25-แกน-ไฟเบอร์เมมเบรน-2-ชิ้น-i.266262896.22965632574\n\n\nFrequency response\n\nกราฟเรียบดี แต่ เสียงความถี่สูงมันดังกว่าความถี่ต่ำ\nดูค่าอื่น ๆ ที่ผลที่เคยวัดไว้ก่อนหน้านี้\nwww.facebook.com/groups/791461357947350/permalink/1910838636009611/\n\n\nออกแบบ horn\n\nปากรัศมี 15 มม. จูน cut-off frequency ที่ 1800 Hz\n\n\n\nหน้าตา\n\n\n\nทดสอบ\nใช้ baffle หน้าตาแบบเดิม\n\n\n\n\nผล\nความถี่ต่ำดังขึ้น การกระจายของเสียงดูสม่ำเสมอขึ้น\nเสียงสูงตกลง แต่ก็แก้ด้วย crossover ได้ง่ายกว่า\n\n\n\nเปรียบเทียบก่อนหลัง FR\n\nเสียงความถี่ต่ำดังขึ้น 7-8 dB\n\n\nเปรียบเทียบก่อนหลัง Distortion\n\nDistortion เพื่มขึ้นเล็กน้อย ไม่มีนัยสำคัญ\n"},"Making-Speakers/Improvement":{"title":"Improvement","links":["meterials/Plaster-of-Paris"],"tags":[],"content":"Problem\n\nPlaster of Paris is setting too fast for big speaker\n\nsearch for new POP type which have slower settings time.\nChange to other type of cement\n\n\nBack cover is hard to assemble and has many more problem\n\nMay be I can build a speaker without a back cover\n\n\nUse some kind of plastic report cover to cover the cement surface make the surface vary smooth\nFrom Loudness, the frequency below 100Hz is quite steep, may be it’s better to invest in frequency around 50-60 Hz more than frequency below 50 Hz\n\nalready tried tuning frequency flat down to 40Hz, the frequency below 50 Hz is hard to hear.\n\n\n\nRealization\n\nMy effective hearing range is around 60 - 15000 Hz\n\nwith the same volume of 60 Hz, at 40 - 50 Hz I can hear very low.\n\n\n"},"Making-Speakers/Port-Damping":{"title":"Port Damping","links":[],"tags":[],"content":"When the port is rigid (like cemented), the port resonance will be very loud, louder than Actual port frequency it self!\n\nLook at the peak at 500Hz that 5dB higher than port frequency!\nPort frequency can be confirmed by 1st port resonance in WinISD\n"},"Making-Speakers/Portable-Power-Supply":{"title":"Portable Power Supply","links":[],"tags":[],"content":"Draft\n\n\nอุปกรณ์\n\nBatteries Microvast 3.7v 21Ah​ x 4\nBMS 4S 40A Balanced\nWondom Step-Up 500W spec\nDual USB output DC-DC Step Down Power Module 9-36v to 5V USB 3A  OR\nUSB QC 3.0 dual usb car charger\nBattery status indicator\nGX16 2-pin x 2\nDC 5.5x2.1 Female\nLi-ion Charger 16.8V\nSwitch 6 PIN 360 VA or Switch 9 PIN 360 VA\nLED\nLED holder\n\nสเป็ค\n\nถ่าน Li-ion Microvast ความจุ 21Ah จำนวน 4S\nBMS 4S 40A บาลานซ์\nวงจรแปลงไฟ Wondom Step-Up 500W\nไฟออก 36V และ 24V โดยทั้งสองช่องจะต้องไม่ทำงานพร้อมกัน ความคุมโดยสวิตช์\nพอร์ตไฟออก 36V และ 24V เป็น GX16 และมีการต่อชิลด์กับกราวด์\nวงจรแปลงไฟไปพอร์ตไฟออก USB 5V 2 ช่อง\nมีบอกสถานะแบตเตอรี่\nพอร์ต DC099 5.5x2.1mm เพื่อชาร์จไฟแบตเตอรี หรือ พอร์ตชนิดอื่นที่สามารถใช้กับหม้อแปลงสำหรับชาร์จไฟ Li-ion 16.8V ได้\nมีสวิตช์หลักเปิดปิดการทำงานทั้งหมดโดยไฟจะต้องไม่เข้าวงจรแปลงไฟ\nขนาดกล่อง\n\nกว้าง 12 - 18 ซม.\nยาว 15 - 25 ซม.\nสูงไม่เกิน 15 ซม.\n\n\nวัสดุกล่องทำจากไม้ 5 ด้าน ด้านบนเป็นอะคริลิคใส่ สามารถดูอุปกรณ์ภายในได้\nกล่องทุกขอบต้องทำฟิลเล็ต 5 - 20 มม. (ลบคมของขอบ)\nพัดลมระบายอากาศดูดเข้า สามารถใส่ฟิวเตอร์กันฝุ่นทีหลังได้\n\n"},"Making-Speakers/Power-line-filter":{"title":"Power line filter","links":[],"tags":[],"content":""},"Making-Speakers/WinISD-Tutorial-1":{"title":"WinISD Tutorial 1","links":["tags/WinISD","tags/ts-parameters"],"tags":["WinISD","ts-parameters"],"content":"WinISDts-parameters\nตอนที่ 1 T/S-parameters\n\nแนะนำการใช้โปรแกรมออกแบบตู้ลำโพง WinISD\nWinISD เป็นโปรแกรมออกแบบลำโพงยอดนิยมตัวหนึ่ง ถึงแม้ช่วงนี้จะแผ่วๆ ไปบ้าง\nเนื่องจากโปรแกรมมีบัคและไม่ได้อัพเดทมานาน แล้วเหมือนโปรแกรมเมอร์เอาจะอยู่ใน\nยูเครน (หรือแถวๆ นั้น หรือแค่อินกับสงครามเฉยๆ ?) อย่างไรก็ตามก็ติดตามเขาได้ที่เพจ WinISD\nWinISD เป็นโปรแกรมที่ดีสำหรับมือใหม่ เวลาใช้จะทำให้เข้าใจวิธีการออกแบบมากขึ้น\nและที่สำคัญคือใช้ฟรี\nใครยังไม่มีสามารถ download ได้ที่ www.linearteam.org\nผมคงไม่บอกวิธีติดตั้งนะ แต่ถ้าใครติดปัญหาก็ถามได้ใน comment\nอีกอย่างนึงที่ต้องบอกไว้ก่อนคือไม่ว่าจะเป็นโปรแกรมไหนก็ตาม\nมันก็เป็นแค่โปรแกรมจำลองโมเดลเท่านั้น เมื่อทำกล่องออกมาแล้ว\nก็ไม่ได้หมายความว่าจะได้ผลลัพท์ออกมาตามที่คำนวณไว้ 100%\nเพราะของจริงมีตัวแปรอื่น ๆ อีกเต็มไปหมดทั้งที่วัดได้ วัดไม่ได้\nตัวอย่างเช่น box loss หรือการสูญเสียพลังงานของกล่องซึ่งอาจ\nเกิดจากลมรั่ว หรือซึมผ่านผนัง ซึ่งตอนนี้ยังไม่มีวิธีที่จะวัดได้\n\nตอนแรกว่าจะทำแค่โพสต์เดียวแต่ทำไปทำมา ปรากฎว่ามันยาวเหลือเกิน\nผมจึงขออนุญาตแยกเป็นตอน ๆ  หลายตอนหน่อยแล้วเพิ่มเนื้อหาอีกหน่อย\n\nในตอนแรกนี้ผมจะมาแนะนำวิธีดู spec ลำโพง หรือค่า T/S-parameter\nเราจะได้เอามาใช้ใส่โปรแกรมในตอนต่อๆ ไป\n\n\nT/S-parameters\n\nT/S-Parameters หรือชื่อเต็มๆ คือ Thiele/Small Parameters\nมาจากชื่อของ Neville Thiele และ Richard H. Small\nเล่าอย่างย่อ ๆ คือนักวิจัยทั้งสองท่านนี้พยายามหาวิธีจำลอง\nลำโพงเป็นโมเดลทางไฟฟ้า เป็นการวิจัยที่ต่อเนื่องและยาวนานกว่า 30 ปี\nและทำให้สุดท้ายเราสามารถจำลองการตอบสนองความถี่เบสของ\nตู้ลำโพงออกมาได้\nรูปจาก audioxpress.com/article/voice-coil-interviews-dr-richard-h-small\n\n\nT/S-parameters ที่ (ผมเห็นว่า) สำคัญ\n\nอ่านอย่างละเอียดที่ en.wikipedia.org/wiki/Thiele/Small_parameters\nส่วนนี้เป็นคำอธิบายคร่าว ๆ ของผม (คร่าวแล้วจริงๆ นะ)\n(หน่วยจะอยู่ในวงเล็บ สามารถใส่ prefix พวก m, c, etc ตามหน่วย metric ปกติ)\nFs (Hz) คือความถี่สั่นพ้องของดอกลำโพง\nRe (Ohm) คือความต้านทานไฟ DC\nQ factor - Quality factor\nคือ Q เป็นค่าที่บอกสัดส่วนระหว่างพลังงานที่สามารถเก็บในระบบนั้น กับ พลังงานที่สูญเสียไปในหนึ่งวงรอบการทำงาน (จากชมรมวิทยุสมัครเล่น e20ae.blogspot.com/2018/04/q-factor.html\nQes   Q ทางไฟฟ้า e - Electronic\nQms  Q ทางกล m - Mechanic\nQts    Q รวม t - Total\nทั้งนี้โปรแกรมมักจะคำนวณค่า Q จากกราฟ impedance\nDd (m) เส้นผ่านศูนย์กลางของ Diaphragm วัดจากกรึ่งกลาง surround ด้านหนึ่งไปอีกด้านหนึ่ง\nSd (m^2) พื้นที่ของ Diaphragm คำนวณจาก Dd กรณี phase plug อาจจะต้องลดลงนิดนึง\nCms (mm/N) ระยะที่ลำโพงเคลื่อนที่ไปเมื่อออกแรง 1 N\nVas (l)  ปริมาตรของอากาศที่เทียบเท่า Cms\nMms (g) น้ำหนักของส่วนเคลื่อนไหวของลำโพง\nRms (N.m/s) ความต้านทานทางกล (ความตึง?)\nBl (T.m หรือ N/A) ความแรงของแม่เหล็ก\nLe (H) สภาพตัวนำของลำโพง มักวัดที่ 1kHz\nXmax (mm) คือระยะเคลื่อนที่มากที่สุดของลำโพงก่อนที่เสียงจะเพี้ยน\nXlim (mm) หรือ Xmech คือระยะเคลื่อนที่มากที่สุดของลำโพงที่จะทำให้เสียหายอย่างถาวร\nปกติแล้วจะออกแบบไม่ให้เกิน Xmax\nVd (l) คือปริมาตรอากาศที่ถูกดันเมื่อลำโพงขยับไป Xmax\nSPL sound pressure level (dB) คือความดัง ณ ตำแหน่งวัด 1 m จากลำโพงมักจะวัดกับกำลังไฟ 1W โหลด 8 ohm หรือ ความดัน 2.83V\nn0 (%) คือประสิทธิภาพของลำโพง 1W ไฟฟ้า กลายเป็นเสียงกี่ % (100% = 112dB SPL)\nPe (W) คือ Power Handling RMS\nในรูปเป็นขั้นตอนวิธีการคำนวณค่า parameter แต่ละตัวของโปรแกรม\nซึ่งโปรแกรมที่ดีก็จะคำนวณย้อนกลับได้ด้วย\n\n\nตัวอย่างไม่ดี\nต่อไปจะเป็นตัวอย่างที่จะเห็นได้ในเว็ปต่าง ๆ\nตัวอย่างแรกเป็นตัวอย่างที่ไม่ดี (หมายถึงวิธีวัดไม่ดีนะ ไม่ใช่ลำโพงไม่ดี)\n\nจะเห็นว่าถึงเขาจะให้ค่า parameter มา แต่ก็ไม่ได้ตรงกับที่เราต้องการเลย\nเช่น\nRate Imp วัดได้ 3 ohm ที่ 1kHz? ถ้าดู parameter ที่เราต้องการจริงๆ คือ Re ที่วัดจากไฟ DC\nResonance Freq เชื่อว่าคือ Fs แต่ไม่มีกราฟ impedance มาให้ ก็ไม่รู้ว่าถูกต้องจริงหรือไม่\nต่อมา SPL เขาบอกวัดที่ 1000mV = 1V ที่ตำแหน่ง 0.1 m = 10 cm อันนี้ก็น่าจะพอคำนวณได้ว่า SPL จริงๆ ที่ 2.83V ตำแหน่ง 1 m เป็นเท่าไหร่\nส่วน parameter อื่นไม่มีเลย\nดังนั้นถ้าเราอยากจะรู้ว่าลำโพงนี้เป็นอย่างไรก็ต้องหวังพึ่งสมาชิกในกลุ่มที่เคยใช้มาก่อน อาจจะขอให้เขาวัดค่า parameter มาให้ : D ไม่แน่เราอาจจะเจอของถูกและดีจากลำโพงพวกนี้ก็ได้\n\n\nตัวอย่างที่พอจะดูได้\n\nwww.aliexpress.com/item/1005005820259984.html\nคำอธิบายบนเว็ปประมาณนี้\nSpeaker type: subwoofer\nRated power: 35W\nMaximum power: 60W\nRated impedance: 4 Ω / 8 Ω\nFrequency response range: 85HZ-5KHZ\nResonance frequency: 85HZ\nSensitivity: 87db±3db\nBasin material: Polymer pp\nMaximum outer diameter: 89.5 mm\nSpeaker height: 51 mm\nScrew diagonal distance: 83 mm\nVoice coil diameter: 25 mm\nQts: 0.43\n\n\nตัวอย่างที่พอจะดูได้ (ต่อ)\nถ้าสังเกตในช่อง Notes จะมีเขียนค่า T/S parameters ตัวเท่ามดไว้\nซึ่งก็ต้องเอามาซูมแตกแล้วแตกอีก\nหน่วยของค่าบางตัวก็แปลกๆ เช่น Sd ซึ่งผมยังไงก็ดูไม่ออกว่ามันคือหน่วยอะไร\nค่า SPL ซึ่งเหมือนจะเอามาจากค่าความดังสูงสุด ไม่ได้เอามาจากค่าเฉลี่ย\n\nและเมื่อวัดค่า parameter ออกมาจริงๆ แล้ว ค่าที่ได้ก็ไม่ตรงเท่าไหร่ (ที่รู้เพราะซื้อมาวัดเองแล้ว)\nและลำโพงนี้เป็นลำโพงที่เสียงดีใช้ได้เลยแหละ\nส่วนนี่เป็นค่าที่ผมวัดได้หลังเบิร์นไป 12 ชม. โดยใช้โปรแกรม REW\nTS Parameters file\nRoom EQ V5.20.13\nDated: Sep 2, 2023 1:00:04 PM\nFrom measurement RF-317L-8\nZmin 7.86 ohm\nfmin 250 Hz\nf3 750 Hz\nLe(f3) 1.230 mH\nMotional impedance parameters\nR0 40.12 ohm\nCMES 193.1 uF\nL0 16.034 mH\nbeta 0.0000\nomega0 895.9\nBlocked impedance parameters\nRDC 7.20 ohm\ndR -0.12 ohm\nRe 7.08 ohm\nLeb 55.2 uH\nLe 2.175 mH\nRss 100000.0 ohm\nKe 0.2621 S-H\nThiele-Small parameters\nfs 90.5 Hz\nQms 4.403\nQes 0.777\nQts 0.661\nFts 136.9\nMms 6.11 g\nCms 0.506 mm/N\nRms 0.789 kg/s\nVas 0.57 litres\nBl 5.627 Tm\nEta 0.05 %\nLp (1W/1m) 79.20 dB\nDd 6.00 cm\nSd 28.3 cm^2\nAdded mass 1 measurement:\nAdded mass 1 3.000 g\nAdded mass 2 measurement:\nAdded mass 2 6.000 g\nAir temperature 28.0 C\nAir pressure 1013.25 mB\nAir density 1.1721 kg/m^3\nSpeed of sound 347.9 m/s\n\n\nตัวอย่างสุดท้ายเป็นตัวอย่างมาตรฐาน\n\nอันนี้ไม่ต้องอธิบายมาก เมื่อดูสเป็คก็จะเห็นค่า parameter ครบท้วนเลย\nซึ่งดอกลำโพงพวกนี้ก็มักจะมีราคาแพง (หรือไม่แพงด้วยตัวมันก็แพงด้วยภาษีนำเข้า)\nแต่ก็ตามมาด้วยมาตรฐานที่ทุกๆ ดอกที่สั่งจะใกล้เคียงกันหมด ทำให้คนทำลำโพงสามารถรักษาคุณภาพได้\nในตอนแรกนี้ผมขอจบลงเท่านี้ก่อน ไว้ครั้งหน้าผมจะมาสอยวิธีใส่ค่าลำโพงลงโปรแกรมและวิธีสร้างโปรเจคใหม่ ส่วนใครอยากทำตามก็ลงโปรแกรมเตรียมไว้ได้เลย\nดาวโหลดโปรแกรมที่ www.linearteam.org\n"},"Making-Speakers/WinISD-Tutorial-2":{"title":"WinISD Tutorial 2","links":["tags/WinISD"],"tags":["WinISD"],"content":"WinISD\nตอนที่ 2 วิธีใส่ค่าลำโพงและสร้างโปรเจค\nวันนี้เราจะเริ่มใช้โปรแกรมจริงๆ ละ ใครยังไม่มีแล้วอยากลองทำตาม\nสามารถดาวโหลดโปรแกรมที่ www.linearteam.org\nสำหรับคนที่พลาดตอนที่แล้ว\nตอนที่ 1 T/S-parameters\nwww.facebook.com/groups/791461357947350/permalink/1892504631176345/\n\nเริ่มเปิดโปรแกรมกันเลย\n\nในการแนะนำวิธีใช้นี้ผมจะรันไปตามวิธีออกแบบของผมเอง\nและจะข้ามบางส่วนที่ลึกเกินสำหรับผู้เริ่มต้นไปบ้าง\nหลังจากลงโปรแกรมแล้วก็จะมี Icon ดังรูปอยู่ใน Start menu\nเรากดไปที่ Icon WinISD เพิ่อเปิดโปรแกรมเลย\n\n\nเพิ่มลำโพงในฐานข้อมูล\n\nอันดับแรก ผมจะแนะนำวิธีเพิ่มลำโพงเข้าไปในฐานข้อมูลของโปรแกรมก่อน\nเมื่อเปิดโปรแกรมแล้ว กดไปที่รูปลำโพงที่แถบเมนูได้เลยครับ\n\n\nSundown Audio U-6.5SW 2 ohm 400W\n\nลำโพงไนวันนี้ทั้งกราฟ impedance และ ts-parameter ผมเจอในโพสของสมาชิคท่านหนึ่ง\n\n\nตรวจสอบค่า T/S-parameters\nบอกตามตรงว่าเวลาผมเห็นค่าที่วัดมาจากโรงงานนี้ ผมจะไม่ค่อยเชื่อเท่าไหร่\nอย่างแรกที่ผมทำคือเอารุ่นไปเช็คก่อนว่ามี ข้อมูล T/S-parameter ที่อื่นอีกไหมอีกไหม\n\nซึ่งดอกลำโพงนี้ก็มีเว็ปของโรงงานเองเลย ซึ่งก็มีค่าพารามิเตอร์เกือบครบ\nsundownaudio.com/products/u-series-v2-6-5-u-65sw-1750w-subwoofer\nขาดแค่ Xmax ซึ่งผมไปเจอใน ebay อีกที\nด้านขวาเป็นค่าที่ผมหามา ลองเทียบกับด้านซ้ายที่ขยายขึ้นมาดูก็จะเห็นว่าไม่ตรงกันหลายตัว\n\n5. ตั้งชื่อและคำอธิบาย\nต่อจากรูปที่ 2 เมื่อกดปุ่มรูปลำโพง (Driver Database) แล้ว ก็จะมีป๊อบอัพขึ้นมาให้ใส่ข้อมูลลำโพง\nผลิตที่ไหน ยี่ห้ออะไร รุ่นอะไร เราก็ใส่เข้าไปตามที่เรามี\nส่วนผมมักจะใส่ link ใน comment ด้วยว่าซื้อมาจากไหน\nใส่เสร็จแล้วกดที่แท็ป Parameters ด้านบนเลยครับ\n\n\nใส่ T/S parameters\n\nเราอาจจะใส่ค่าสำคัญ ๆ แค่บางค่าก็ได้\nค่าที่ใส่ลงไปเองจะเป็น สีเขียว\nส่วนค่าที่เป็น สีน้ำเงิน คือค่าที่คำนวณออกมาโดยอัตโนมัติ\nส่วนใหญ่ผมก็จะใส่ค่า\nQes\nQms\nQts (เช็คดูว่าตรงไหม)\nFs\nVas\nRe\nMms หรือ Sd ตัวใดตัวหนึ่ง\nLe\nXmax\nPe = 400W\nและเนื่องจากลำโพงตัวนี้มี 2 voice coin\nซึ่งเพื่อความแรงเราก็จะต่อแบบ parallel\nก็ใส่ไปด้วยที่ 2 บรรทัดสุดท้าย\nเมื่อใส่เสร็จแล้วกด save ได้เลย\n\n\nตั้งชื่อไฟล์แล้วกด Save\n\nตรงนี้โปรแกรมก็จะให้เราบันทึกค่าลำโพงไว้ที่ Documents\\WinISD\\drivers ซึ่งอาจจะต่างกันไปตามเครื่องของแต่ละคน ซึ่งผมแนะนำว่าให้จดโฟรเดอร์นี้ไว้ด้วย ซึ่งเดี๋ยวจะมาบอกว่าทำไม\n\n\nสร้างโปรเจคใหม่\nเมื่อบันทึกเสร็จแล้วป็อบอัพจะถูกปิดไป และกลับมาหน้าเดิม\n\nให้เรากดไปที่ปุ่ม create new project\n\n\nเลือกดอกลำโพงและจำนวนดอก\nเมื่อกดแล้วจะมีป๊อบอัพรายการขึ้นมาให้เลือก รายชื่อนี้จะเป็นชื่อของแบรนลำโพง เราก็หาแบรน Sundown Audio ที่เราสร้างไว้ เมื่อเลือกแล้วก็จะมีรายการรุ่นมาให้เลือกอีก ซึ่งเรามีอยู่ตัวเดียว U-6.5SW-D2\nจากนั้นกด Next\n\n(หรือถ้าหาไม่เจอลองกดปุ่ม Load แล้วหาไฟล์จากโฟรเดอร์ที่ผมให้จดไว้เอาก็ได้)\nหน้าต่อมาจะให้เลือกจำนวนดอกที่ใช้ เราใช้ 1 ดอก แบบธรรมดา\nส่วน Iso-barik เป็นการเอาลำโพง 2 ดอกมาซ้อนกัน ซึ่งถ้ามีโอกาสผมจะมาเล่าให้ฟังทีหลัง\nจากนั้นกด Next\n\n\nเลือกขนิดตู้ลำโพง\nก่อนจะดูหน้าต่อไป เราจะมาดูก่อนว่าดอกลำโพงหนึ่งๆ เหมาะสมกับตู้ประเภทไหน\nซึ่งโปรแกรมนี้จะมีชนิดตู้ลำโพงให้เลือกดังนี้\n\n\nClosed ตู้ปิด\nVented ตู้แบบมีพอร์ต (หรือมีท่อนั่นแหละ) หรือเรียกว่า bass reflex\n4th order bandpass คือแบนพาสแบบที่เรามักเห็นกันในตู้ DIY ด้านนึงเป็นตู้ปิด อีกด้านเป็นพอร์ต\n6th order bandpass เป็นแบนพาสอีกชนิดหนึ่งที่มีพอร์ตทั้งสองด้าน\nPassive Radiator ตู้ลำโพงดอกพาสซีฟ ตรงตัว แต่ไม่ค่อยมีประโยชน์ซักเท่าไหร่เพราะเราไม่ค่อยจะมี parameter ของดอกพาสซีฟ (และผมก็หาวิธีวัดอยู่เหมือนกัน ถ้าใครทราบรบกวนบอกผมหน่อย)\nABC อันนี้ผมยังไม่เข้าใจเหมือนกัน น่าจะคลายๆ 6th order แต่มีท่อเชื่อมระหว่างห้อง? เอาเป็นว่าตัวนี้ผมไม่รู้จริง ๆ ไม่พูดถึงดีกว่า\n\nวิธีเลือกคร่าวๆ ตามรูป ข้อมูลนี้ผมรวม ๆ มาจากหลายที่ แต่น่าจะหาที่มาได้ไม่ยาก\n\n\nเลือก Alignment\nสำหรับลำโพงตัวนี้ผมเลือก 4th order ตามที่นิยมกัน จากนั้นกด Next\nหน้าต่อมาจะมีให้เลือก Alignment หรือค่าที่เขาแนะนำมา\nสำหรับ 4th order โปรแกรมนี้จะมีตัวแปรอยู่ 2 ส่วน\n\nคือ ripple หรือความเรียบของสัญญาณ ถ้าเลือก 0db สัญญาณจะเรียบสนิด ส่วนถ้าเลือก 1.25db ขอบของสัญญาณจะสูงกว่าตรงกลาง 1.25db เป็นต้น\nและ gain คือความดังของสัญญาณที่เปลี่ยนไป ถ้าความดังของสัญญาณมาก ความกว้างของช่วงสัญญาณก็จะน้อย ถ้าความดังน้อยความกว้างก็จะมากขึ้น ถ้าต้องการเบสลึกๆ ก็ต้องเอา gain น้อยๆ\nส่วนตัวผมชอบช่วงสัญญาณเรียบๆ กว้างๆ เบสลึก ๆ ดังนั้นโปรเจคนี้ผมขอเลือกเป็น 0.35db ripple และ -3db gain จากนั้นกด Next\nหน้าต่อมาตั้งชื่อโปรเจคตามที่เราต้องการแล้วกด Create\n\n\nกราฟความถี่จาก Alignment\nเมื่อกดปุ่ม Create แล้ว โปรแกรมก็จะคำนวณขนาดของตู้และการตอบสนองความถี่ออกมา\nซึ่งก็จะได้ f3 (ความถี่ที่ความดังลดลง 3db) ที่ประมาณ 33 Hz\nลำโพงจะสูญเสียความดังโดยรวมไป 4db\nช่วงความถี่กว้างไปถึงความถี่สูงสุดประมาณ 100 Hz นิดๆ ซึ่งถ้าดอก mid สามารถลงได้ต่ำกว่า 100Hz ก็จะไม่มีปัญหาอะไร\n\nวันนี้ผมจะขอหยุดส่วนของการจำลองตู้ลำโพงไว้เท่านี้ก่อน เพราะเราจะไปดูวิธีนำข้อมูลเข้าแบบไม่ต้องพิมพ์ข้อมูลเองกันบ้าง\n\n\nการนำเข้าข้อมูลดอกลำโพงจาก Internet\nยังจำโฟรเดอร์ในรูปที่ 6 ได้ไหมครับ เดี๋ยวเราจะเอามาใช้กัน\n\nเนื่องจากโปรแกรม WinISD เก็บไฟล์ .wrd ดังนั้นเราก็สามารถหาไฟล์นี้จาก internet มาใส่เพิ่มก็ได้\nหรือจะเอาไฟล์ .wrd เอาแจกให้คนอื่นก็ได้เช่นกัน\n\n\nการนำเข้าข้อมูลดอกลำโพงจาก Internet (ต่อ)\nเว็ปที่ผมมักจะชอบเอามาใช้หาข้อมูลลำโพงคือ\n\nloudspeakerdatabase.com/\nซึ่งเว็ปนี้ก็จะมี filter ให้เราหาลำโพงตามสเป็คที่ต้องการได้\n\n\nการนำเข้าข้อมูลดอกลำโพงจาก Internet (ต่อ)\n\nสมมติว่าผมเจอลำโพงที่ถูกใจแล้ว เป็น TCP115-4\nloudspeakerdatabase.com/Dayton/TCP115-4\nเมื่อเลื่อนหน้าจอมาเรื่อยๆ เราจะเห็นปุ่มเขียนว่า WinISD\nซึ่งเมื่อกดแล้วมันก็จะให้เรา download ไฟล์ .wrd\nจากนั้น เราก็เอาไฟล์นี้ไปใส่ในโฟรเดอร์รวมกับไฟล์อื่น ๆ\nจากนั้นครั้งต่อไปที่เราเปิดโปรแกรมขึ้นมาก็จะมีข้อมูลดอกลำโพงนี้ให้ใช้ได้เลย\n(ใครไม่ขึ้นให้ปิดโปรแกรมเปิดใหม่ก่อน หรือถ้าไม่ขึ้นจริงๆ ลองกดปุ่ม Load ดู)\nเอาหละตอนนี้ผมก็ขอฝากไว้เพียงเท่านี้ก่อน\nตอนต่อไปผมจะมาบอกวิธีปรับค่าตู้ลำโพงอย่างไรไม่ให้ลำโพงเสียหายเวลาเปิดดัง ๆ\nและปรับอย่างไรให้เสียงเป็นแบบที่เราต้องการมากขึ้น\n"},"Making-Speakers/WinISD-Tutorial-3":{"title":"WinISD Tutorial 3","links":["tags/WinISD"],"tags":["WinISD"],"content":"WinISD\nตอนที่ 3 ปรับแต่งค่าตู้ลำโพง\nตอนที่ 1 www.facebook.com/groups/791461357947350/permalink/1892504631176345/\nตอนที่ 2 www.facebook.com/groups/791461357947350/permalink/1892952047798270/\nตอนนี้เราจะปรับค่าของตู้ลำโพง ให้สามารถสร้างได้จริงๆ เสียงดีและไม่ทำให้ลำโพงพัง!!\n\nเมนูหลักของโปรแกรม\n\nตู้บางขนิดสามารถทำให้ลำโพงของคุณพังได้จริง ๆ ถ้าคุณจ่ายไฟให้กับลำโพงเยอะ ๆ\nและตู้ของคุณก็พยายามขับลำโพงให้เล่นในความถี่ที่คนออกแบบลำโพงไม่ได้ออกแบบมาอีก\nซึ่งส่วนนี้จะแก้อย่างไร ผมก็จะพูดถึงต่อไป\nแต่ก่อนอื่นผมขอแนะนำโปรแกรมและชื่อที่ผมจะใช้เรียกเมนูสำคัญนี้ก่อน\n\nSelect plot type ซึ่งเพื่อความสั้นอละเขียนง่ายผมจะขอเรียกว่า “เมนูมุมมอง” ซึ่งในภาพคุณจะเห็นปุ่มด้านบน ที่เขียนว่า Transfer function magnitude ซึ่งเมื่อกดแล้วก็จะมี เมนู ย่อยให้ดูดังภาพ\nProject parameter หรือผมขอเรียกว่า “เมนูปรับแต่ง” แยู่ด้านซ้ายล่างของหน้าจอ มีเมนูให้เลือกเช่น Driver Box Vents\n\n\n\nเมนูมุมมอง\n\nผมจะขอแนะนำเมนูทมุมมองอย่างคร่าว ๆ ก่อน และมุมมองบางมุมมองจะไม่มีข้อมูลถ้าใส่ค่าลำโพงไม่ครบ\nTransfer function magnitude - ใช้ดูว่าตู้จะส่งผลอย่างไรกับเสียงที่ความถี่ต่าง ๆ โดยไม่คำนึงถึงความดังที่เปิด ซึ่งจะแสดงส่วนต่าง ไปจาก SPL หลัก\nTransfer function phase - เฟสของเสียง (ผมไม่แน่ใจนะคิดว่าน่าจะเป็นต่ำแหน่งห่างจากลำโพง 1 เมตร)\nGroup Delay - ดูว่าตู้ลำโพงจะทำให้เสียงกระชับ เสียงนุ่ม หรือเสียงเบรอ\nMaximum Power - Maximum SPL เมนูผมไม่ได้ใช้ ค่า parameter มีไม่พอ\nAmplifier apparent load power (VA) - ดูว่าแอมแ์จะมี load ขนาดไหน\nSPL - ความดัง\n\nCone excursion - การเคลื่อนของดอกลำโพง\nImpedance - ค่า impedance ของดอกลำโพง\nImpedance phase - ค่าเฟส impedance ของดอกลำโพง\n\nTransfer function magnitude (PR)\nTransfer function phase (PR)\nCone excursion (PR)\nเหมือนตัวด้านบน แต่จะเป็นค่าของ PR Passive radiator หรือดอกพาสซีพ นั่นเอง\n\nAir Velocity - คือความเร็วลมในท่อลม\nGain - คือเสียงที่เสริมจากท่อลม\nRear port คือท่อลมด้านหลังลำโพง\nFront port คือท่อลมด้านหน้าลำโพง\nInterchamber Port คือ ท่อลมระหว่างห้องหน้าลำโพงและหลังลำโพง\n\nTransfer function magnitude (EQ/Filter)\nTransfer function phase (EQ/Filter)\nGroup Delay (EQ/Filter)\nเป็นอีกชุดหนึ่ง แต่สำหรับ EQ และ Filter ตรงตัวเลย\n\n\nเมนูปรับแต่ง\n\nDriver - ปรับจำนวนดอกลำโพง (driver) และวิธีติดตั้ง ปุ่ม edit ด้านขวาน่าจะไว้เปลี่ยนลำโพงแต่เวอร์ชันนี้บัค\nBox - ปรับขนาดตู้และจูนปรับความถี่ตู้ เมนู Advance ด้านล่างใช้ปรับค่าการสูญเสียพลังงานของตู้\nVent - ไว้ปรับขนาดของท่อลม และคำนวณความยาว\nSignal - ไว้ปรับความแรงของสัญญาณจากแอมป์\nFilters - ไว้ใส่ Filter และ EQ\nAdvance - ไว้ปรับแต่ค่าอื่นๆ เช่น สภาพอากาศ วิธีจำลองแบบอื่นเช่น transmission line\nProject - เป็นที่จดบันทึกช่วยจำ\n\n\nอันดับแรกให้เลือกที่ เมนูมุมมอง Cone excursion ก่อน\n\n\n\nจากนั้นเลือกเมนูปรับแต่ง Signal ใส่ค่า System input power ด้วยกำลังที่เราจะขับลงไป\nอาจจะใช้ค่ากำลังขับของแอมป์ หรือ ค่า Power Handling (RMS) ของลำโพงก็ได้\n\nโปรแกรมจะคำนวณค่า Cone excursion หรือการเคลื่อนที่ของกรวยลำโพง ออกมา\nดูที่กราฟคุณจะเห็นเส้นแนวนอนสีแดงบางๆ ที่ 19 mm ซึ่งก็คือค่า Xmax ที่ใส่ไว้ตั้งแต่ใส่ค่าลำโพง\nและเส้นแดงหนาๆ หน่อยคือค่า Cone excursion\nการดูหน้านี้คือเราจะต้องทำอย่างไรก็ได้ค่า Cone excursion ไม่เกิน Xmax เพราะถ้าเกิดเกินขึ้นมามันจะทำให้ลำโพงคุณมีเสียงแปลกๆ เวลาเล่นความถี่ในย้านที่เกิน หรือถ้าเกินมากๆ มันอาจจะทำให้ลำโพงของคุณพังไปเลยก็ได้\n\n\nตัวอย่าง Cone excursion ที่เป็นปัญหา\nตัวอย่างนี้ผมใช้ลำโพง Dayton TCP115-4 40W Xmax 4 mm เอามาใส่ตู้ 6 order band pass\nคุณจะเห็นว่าค่า Cone excursion นั้นเกิน Xmax ไปเยอะมาก รูปแบบนี้ถ้าเอาไปทำตู้และใช้แบบนี้เลยมันจะทำให้ลำโพงพังแน่ ๆ\n\n\n\nวิธีแก้ 1 ใส่ Filter\nเราสามารถใส่ filter เพื่อลดความถี่ต่ำๆ ได้ นึกภาพใส่ C ที่ดอกแหลม แต่ woofer ต้องใช้ตัวใหญ่ ๆ หน่อย ในตัวอย่างผมจะใส่ high pass filter Linkwitz-Riley ที่ 26Hz (วิธีใส่ผมให้ไปลองเองไม่ยาก เลือกเมนูปรับแต่ง Filter แล้วกด add)\n\nก็จะได้ผลลัพท์ออกมาตามนี้ ซึ่งก็ยังเกินอยู่ดี ดังนั้นต้องแก้ต่อด้วย…\n\n\nวิธีแก้ 2 ลดกำลังไฟ\n\nกลับไปที่เมนูปรับแต่ง Signal ลองลด input power ลงจนกว่าจะต่ำกว่า Xmax\nนั่นคือกำลังสูงสุดที่คุณจะใช้แอมป์ขับได้ ซึ่งเมื่อกำลังน้อยลงเสียงก็จะเบาลงไปด้วย\n\n\nลองมาดูมุมมอง SPL\nจะเห็นว่าความดังสูงสุดมันจะอยู่ที่ 90dB ที่ตำแหน่งฟัง 1m เท่านั้นเอง\nคุณจะจำลองความดังที่ระยะต่างๆ ดูด้วยก็ได้ โดยการแก้ Distance เป็นค่าต่างๆ เช่น 2m 4m\n\nลองดูว่าความดังเท่านี้เพียงพอต่อการใช้งานหรือไม่ ถ้าไม่ก็คงจะสรุปได้ว่าลำโพงนี้ไม่เหมาะกับการใช้งาน ไม่คุ้มค่ามี่จะสร้างมันขึ้นมา\n\n\nเอาหละกลับมาที่ Sundown U-6.5 กันดีกว่า\nต่อไปเราอยากจะไปดูขนาดของท่อลมกัน\nเลือกเมนูมุมมอง Front port - Air Velocity หรือความเร็วลม\n\nการจะเลือก Front หรือ Rear ให้ดูที่ชนิดของตู้หรือดูที่รูปก็ได้ ถ้าท่อลมอยู่ด้านหน้าดอกห็เลือก Front ถ้าอยู่หลังเช่น ตู้แบบ Vented ก็จะอยู่ที่ Rear หรือถ้าเป็น 6 order ก็จะมีทั้ง 2 ข้างเลย\n(ส่วน seal กับ passive ไม่ต้องเลือกนะ มันไม่มี)\n\n\nปรับแต่งท่อลม\nเมื่อเข้ามาก็จะเห็นว่ากราฟทะลุล้นขอบจอเลย ให้เลือกเมนูปรับแต่ Vents จะเห็นสาเหตุนั่นคือท่อลมของเราเส้นผ่านศูนย์กลางใหญ่แค่ 4.7 cm\n\nหน้านี้เราจะต้องพยายามตั้งค่าให้ความเร็วลมไม่ควรเกิน 17 m/s ซึ่งก็คือ 5% ของความเร็วเสียงในอากาศ และห้ามเกิน 34 m/s หรือ 10% ความเร็วเสียง ไม่อย่างนั้นคุณจะได้ยินเสียงลมกระพือเวลาเปิดลำโพงดังๆ ในกรณีที่เกิน 17m/s ไปเล็กน้อย คุณสามารถใช้ท่อลมปากโค้งๆ (Flare) ช่วยได้\n\n\nวิธีลดแรงลม\nมี 2 วิธีคือ 1. เพิ่มขนาดท่อลม ที่ช่อง Vent diameter หรือ 2. ลดกำลังขับที่เมนูปรับแต่ง Signal\n\nคุณสามารถกดที่รูปวงกลมด้านล่างคำว่า Shape เพื่อเปลี่ยนเป็นสี่เหลี่ยมได้ซึ่งก็จะให้ใส่เป็นความกว่้างและสูงแทน\nเมื่อปรับเสร็จในตัวอย่างคุณจะเห็นว่าท่อลมจะต้องมีความยาวถึง 300cm หรือ 3 เมตร ซึ่งเป็นไปไม่ได้\nทำให้ถึงจุดที่ยากของการออกแบบแล้ว คือจะทำอย่างไรให้ได้ค่าที่พอดี\nอีกช่องหนึ่งเผื่อมีคนสงใส\nEnd Correction คือค่าชดเชยความยาวของท่อลม แต่โปรแกรมเวอร์ชันนี้มันบัคแก้ไม่ได้ ซึ่งก็ปล่อยไว้อย่างนั้นแหละไม่ต้องไปแก้อะไร บอกคร่าวๆ ว่าตำแหน่งของท่อลมนั้นสามารถมีผลต่อความยาวของท่อได้ด้วย ซึ่งอันนี้มันก็มีอะไรแปลก ๆ อยู่ เอาว่าเดี๋ยวมาเล่าให้ฟังทีหลังดีกว่า\n\n\nปรับค่าสุดท้าย\nวิธีการก็ตรงไปตรงมา กระโดดไปกระโดดมาตามเมนูมุมมอง และปรับค่าไปเรื่อยๆ จนพอใจ\nมีทริกนิดนึงสำหรับ 4 order band pass\nจูนความถี่ตู้ด้านท่อลม ให้เท่ากับ ด้านปิด จะได้เสียงที่ดีที่สุด\nตู้ด้านท่อลมยิ่งใหญ่ ยิ่งดัง แต่ก็ต้องแลกด้วยช่วงความถี่ที่แคบลง\n\nสมมติว่าผมพอใจค่าตามนี้ ต่อไปก็คำนวนขนาดสุดท้ายของตู้ลำโพง\n\n\nปริมาตรสุดท้ายของตู้\nเนื่องจากปริมาตรที่โปรแกรมคำนวณออกมาเป็น ปริมาตรของอากาศ เท่านั้น คุณจะต้องบวกปริมาตรที่ลำโพงจะกินพื้นที่อากาศในตู้เข้าไปด้วย เช่น คุณจะหันด้านหลังลำโพงไปทางห้องปิดซึ่งมีขนาด 1.52 ลิตร สมมติว่าลำโพงกินที่ 1.8 ลิตร คุณก็รวมขนาดเข้าไป เป็นตู้ปิดต้องมีขนาด 3.32 ลิตร และกลับกัน ถ้ากรวยลำโพงมีช่องจุอากาศได้มากคุณก็ต้องไปลบออกจากปริมาตรตู้ฝั่งท่อลมด้วย\nและก็อย่าลืมรวมปริมาตรท่อลมเข้าไปด้วย โดยให้คิดว่าท่อลมนั้นเป็นวัตถุตัน ๆ (ดูเส้นประสีเทา) ไม่เอาอากาศในท่อไปรวมเป็นอากาศในตู้\n\nV ฝั่งตู้ปิด = Vอาการตู้ปิด + V ดอกลำโพง\nV ฝั่งท่อ = Vอาการตู้ฝั่งท่อ + V ท่อ - V กรวยลำโพง\n\n\nแถม 1 Group Delay (GD)\nอันนี้ผมแถมเรื่อง Group delay (ใช้คำว่าแถมเพราะยังไม่มั่นใจ)\nGD สามารถบอกถึงความ punchy ของเบสได้ และถ้ามีเยอะมันอาจจะทำให้รู้สึกว่าเบสเบลอได้เหมือนกัน\n\nตอนนี้ผมพยายามหาความเกี่ยวข้องระหว่าง group delay กับ transient response อยู่ (ซึ่งมันก็อาจจะไม่เกี่ยวกันก็ได้นะ) แต่ที่แน่ๆ คือยิ่งมี GD ยิ่งน้อยยิ่งดี\nอ่านเพิ่มเติมที่\naudiojudgement.com/group-delay-explanation-measurement-audio/\nen.wikipedia.org/wiki/Group_delay_and_phase_delay#Group_delay_in_audio\nในตัวอย่างกราฟเขียวเป็น vented ดอก Aiyima RF-317L-8 จูนความถี่ที่ 54Hz จากที่ฟังเบสตัวนี้จะเบลอนิดๆ (หรือใครจะเรียกว่านุ่มลึกก็แล้วแต่) และจริงๆ คือต้องมองด้วยว่าท่อลมนั้นยาวเกือบ 50cm ซึ่งก็เป็นสาเหตุหนึ่งที่ทำให้เบสเบลอเช่นกัน\nส่วน TCP115 นี่ GD เยอะมาก ไม่เหมาะกับ 6 order band pass จริงๆ แหละ\nมี Sundown ที่ดูดีหน่อย\n\n\nแถม 2 เมนูปรับแต่ Box Advance\n(เรียกแถมเพราะข้อมูลคลุมเครือ)\n\nถ้ากดไปที่ Advance ที่หน้าเมนูปรับแต่ Box จะมี Q มาให้เราตั้งค่า\nQl คือ การสูญเสียพลังงานจากกล่องรั่ว\nไม่รั่วเลย = 30\nรั่วน้อย = 15\nรั่วมาก = 10\nQa คือ การสูญเสียพลังงานจากวัสดุ damping\nไม่มีวัสดุบุเลย = 120\nบุแค่บางส่วน = 80\nบุผนังทุกด้าน = 20\nQp คือ การสูญเสียพลังงานจากท่อลม\nท่อลมที่ยื่นไปในอากาศทั้งสองข้าง = 70\nท่อลมที่ยื่นไปในอากาศหนึ่งข้าง = 80\nท่อลมที่ทั้งสองด้านติดผนัง = 90\nท่อลมที่ด้านหนึ่งโค้ง (flared) = 120\nท่อลมที่โค้งสองด้าน = 140\nส่วน Qicl นี่ผมไม่มีข้อมูล\nค่าต่างๆ นี้ผมเอาข้อมูลจากโปรแกรม VituixCAD\nค่าพวกนี้สุดท้ายจะเอาไปคำนวน การสูญเสียพลังงานรวมของกล่อง หรือ Qt\nวิธีคำนวณจะเหมือนกับเอา R มาขนานกัน (กลับส่วนแล้วมาบวกกัน)\nโดยปกติแล้วเขาจะใช้ Qt ประมาณ 7\nถ้าตู้เป็นไม้ มีรูเล็กๆ เยอะ อากาศรั่ว ก็ปรับลดลง\nถ้าเอาตู้ไปทาสีเคลือบอีกชั้นอากาศรั่วยากก็ปรับขึ้น\nปกติแล้ว Qt จะไม่น้อยกว่า 3 และไม่มากกว่า 20\n"},"Measurement/EP1-อุปกรณ์อะไรสำคัญที่สุดสำหรับนักออกแบบลำโพง":{"title":"EP1 อุปกรณ์อะไรสำคัญที่สุดสำหรับนักออกแบบลำโพง","links":[],"tags":[],"content":"EP1 อุปกรณ์อะไรสำคัญที่สุดสำหรับนักออกแบบลำโพง\nจากที่ผมถามไปว่า “อุปกรณ์อะไรที่คุณคิดว่าคนออกแบบลำโพงต้องมี”\nคำตอบนั้นก็มีหลากหลาย\nส่วนมากจะเป็นอุปกรณ์ สำหรับงานไม้เช่น เครื่อง CNC เลื่อย สว่าน ไม้บรรทัด\nหรือบางคนจะพูดถึงซอฟแวร์คอมพิวเตอร์บ้าง\nและที่พูดถึงน้อยที่สุดเลยคืออุปกรณ์ในการวัดลำโพงและวัดเสียง\n(ใบเทาๆ และจิตรนาการนี้ผมขอไม่นับละกันนะ)\nในความคิดเห็นของผม อุปกรณ์ที่สำคัญที่สุดสำหรับนักออกแบบลำโพง จะต้องดูจากเป้าหมายสูงสุดของนักออกแบบลำโพงคืออะไร ข้อให้ต้นทุนถูกที่สุดแค่ข้อให้มีเสียงก็พอ? หรือ ต้องการให้ผลงานสุดท้ายมีเสียงที่ดีที่สุดเท่าที่เป็นไปได้? แน่นอนสำหรับนัก DIY ทุกคนก็คงจะเลือกอย่างหลัง\nแล้วคราวนี้จะรู้ได้อย่างไรว่าเสียงลำโพงของคุณนั้นดีจริง จะใช้วิธีฟังเอาอย่างเดียว? รู้ได้อย่างไรว่าหูของคุณดีพอ? และมันใจแค่ไหนว่าเสียงที่คุณได้ยินจะเหมือนกับเสียงที่คนอื่นได้ยินด้วย?\n1 อย่าเชื่อหูตัวเอง\nผมขอยกตัวอย่างบทสัมภาษณ์ของ Martin Schneider ผู้พัฒนาไมโครโฟน Neumann ได้ความว่า\n“คนมักจะแย้งว่าถ้าอยากจะรู้ว่าเสียงดีหรือปล่าว ทำไมถึงไม่พูดใส่ไมโครโฟนหรือเอามันไปอันเสียงเพลงหละ”\n“ผมอาจจะทำอย่างนั้น แต่บางทีในวันจันทร์เช้า หูของผมอาจจะทำงานไม่เหมือนเดิมเพราะว่าในวันอาทิตย์ผมเพิ่งจะไปงานคอนเสิร์ตมา หรือนอนผิดเวลามา หูของผมไม้ได้ถูกแคลิเบรท”\n“ถึงผมจะเก่งในการฟังทดสอบ AB หรือ ABX แต่ผมไม่ได้เป็นจุดอ้างอิงที่แน่นอน และไม่มีใครในโลกนี้เป็นได้”\nจาก The Man Behind The Last 30 Years Of Neumann Innovation\nwww.youtube.com/watch\n\n\nใช้อุปกรณ์วัด\n\nดังนั้นอุปกรณ์ที่สำคัญที่สุดสำหรับนักออกแบบลำโพง (หรืออย่างน้อยก็ต้องหายืมคนอื่นมาใช้ให้ได้) ก็คือชุดอุปกรณ์ที่ใช้อัดเสียงนั่นเอง\nวันนี้ผมจะขอมาขายของหน่อย เดี๋ยวจะพาไปดูว่าเจ้าอุปกรณ์พวกนี้มันวัดอะไรได้บ้าง และจะต้องดูอะไรจากสิ่งที่วัดมา\nโปรแกรมที่ผมใช้ชื่อว่า Room EQ Wizard เรียกสั้นๆ ว่า REW เป็นโปรแกรมใช้ฟรี ถ้าคุณใช้ input แค่เส้นเดียวเช่นต่อไมค์วัดลำโพง ถ้าจะใช้ input หลายตัวเช่นจูนอะคูสติกห้องอันนี้ต้องเสียงตัง\nอีกโปรแกรมหนึ่งที่เห็นนิยมใช้กันคือโปรแกรมชื่อ Smaart Suite ซึ่งตัวนี้มีค่า license พอสมควรวิธีใช้น่าจะไม่ต่างกันมาก\nแล้วก็อีกจนได้เขียนไปเขียนมาทำไมมันยาวเหลือเกิน คงจะต้องตัดออกมาเป็น 3 ตอน บทความตอนนี้จะมาดูฟังก์ชันหลักๆ ที่ผมใช้วัดลำโพงก่อน\n\n\nFrequency Response\n\nรูปแรกเป็นกราฟที่เรียกว่า การตอบสนองความถี่ (Frequency Response) เรียกย่อๆ ว่า FR\nกราฟนี้จะบอกว่าความดังของลำโพงในแต่ละความถี่นั้นดังขนาดไหน เมื่อจ่ายแรงดันไฟในอัตราเท่าๆ กัน\nกราฟนี้จะบอกได้เลยว่าเสียงลำโพงของคุณจะดีหรือไม่ดี โดยลำโพงที่ดีกราฟ FR ควรจะเรียบๆ ไม่จำเป็นต้องเรียบเป็นไม้บรรทัด ขอแค่อย่ามีหลุมหรือภูเขาชันขึ้นมา (หรือจะเรียบเป็นไม้บรรทัดเลยก็ดีนะ (ความชอบส่วนตัวล้วนๆ))\nถ้าจะมีหลุมหรือเนินเขาผมแนะนำว่าอย่าให้เกิน +-3 dB จากค่าเฉลี่ย สำหรับใครที่อาจได้เบสเพิ่มหรือเสียงแหลมเพิ่มผมแนะนำให้บิดปรับ โทน หรือ EQ เอา\nในรูปนี้เป็นการวัดลำโพง near field หรือเป็นการเอาไมค์ไปจ่อลำโพงให้ใกล้ที่สุดเพื่อจะเก็บเสียงย่านเบสออกมาโดยไม่ต้องกลัวเสียงสะท้อนจากห้อง วิธีการวัดอย่างละเอียดสามารถอ่านได้จากบทความ “มองให้เห็นเสียง”\ndocs.google.com/document/u/1/d/1K_Ayk_l8lwntYFocBcB9dnN_VmSE6B11esgMWWMnqXw ของคุณ Withaya Tangtanaporn\nหรือถ้าอยากให้ผมอธิบายเพิ่มก็ขอมาได้ครับ\n\n\nOff-axis Response\n\nรูปที่สองเป็นการแสดง FR หลายๆ กราฟพร้อมกัน โดยหมุนลำโพงทำมุมต่างๆ กับไมโครโฟน และรวมกราฟ near field รูปก่อนเข้ามาด้วยเพื่อดูการตอบสนองทั้งหมดของลำโพง\n(โปรแกรมมันวัด off-axis เองไม่ได้นะเราต้องวัด FR ที่มุมต่างๆ เองแล้วเดี๋ยวค่อยเอามารวมกัน)\nการตอบสนองความถี่บอกแกนหลัก หรือ Off-axis response คือการวัดการตอบสนองความถี่ในมุมต่างๆ โดยแกนหลัก 0 องศา ก็คือ วัดตั้งไมค์เข้าหาลำโพงตรงๆ หนะแหละ แล้ว 15 องศาก็คือหมุนลำโพงไป 15 องศา\n30 คือหมุนไป 30 องศาเป็นต้น ในตัวอย่างผมวัดมาแค่ 0, 15, 30, 45 องศา ซึ่งหลัง ๆ นี้ผมคิดว่าวัด 60 และ 90 องศาด้วยก็ดี\nรูปตัวอย่างเป็นลำโพง full range ตู้ปิด จากรูปคุณพอจะเห็นปัญหาของลำโพงนี้หรือไม่ ลองตอบในคอมเมนต์ดูก่อนดูรูปถัดไป\n\n\nเอาหละเฉลย (หรือจะบอกว่าเป็นแค่ความคิดเห็นของผมก็ได้ ไม่มีผิดไม่มีถูกหรอก)\n\nเมื่อคุณดูกราฟ อย่างแรกที่คุณเห็นอาจจะเป็นภูเขาอันสูงใหญ่ในย่านประมาณ 10k Hz (เบอร์ 1) และเหมือนจะมีปัญหาเรื่อง off-axis พอสมควรที่ 10k Hz เส้น 30 องศา (สีเขียว) มันดิ่งลงไป 20 กว่า dB เลยทีเดียว\nแต่เอาเข้าจริงส่วนที่มีปัญหากว่าคือ เนินในตำแหน่งที่ 2 ซึ่งเป็นเนินขึ้นไปสูงถึง 8 dB ซึ่งเนินนี้เองทำให้เกิดเสียงแหลมบาดหูระดับหนึ่งเลย และเป็นหนักกว่าตำแหน่งที่ 1 ด้วย เพราะว่าหูของคนจะสามารถได้ยินเสียงประมาณ 2k - 4k ได้ดีเป็นพิเศษ ทำให้พอเสียงส่วนนี้มันขึ้นไปสูงก็จะเกิดความรำคาญเป็นพิเศษ ใครสนใจลองหาอ่านเพิ่มในเอกสาร ISO 226:2003 หรือตัวอัพเดท ISO 226:2023\nแต่เนื้องจากลำโพงนี้เป็นลำโพงพาสซีฟ ซึ่งด้วยงบประมาณแล้วผมเลือกแก้ได้โดยใส่ฟิวเตอร์ได้ที่เดียวเท่านั้น ต้องเลือกว่าจะแก้หมายเลข 1 หรือ 2\nแน่นอนว่าผมเลือกทำ notch filter ที่ตำแหน่งที่สองเอาลงมาให้เรียบ ซึ่งก็ได้ผลออกมาดีเลยทีเดียว\nwww.facebook.com/photo/\nอีกทางเลือกหนึ่งในการแก้ปัญหา คือใส่ DSP ไปเลย คราวนี้จะจูนให้เรียบก็ได้ หรือจะทำให้เบสลึกขึ้นอีกหน่อยก็ได้ แต่อย่างไรก็ตาม ไม่มีอะไรที่สามารถแก้ off-axis response เส้นสีเขียวที่ตกลงมา 20 dB ได้\n\n\nกราฟความเพี้ยน Distortion\n\nปกติเวลาลำโพงเล่นความถี่ใดความถี่หนึ่ง มันจะมีคลื่อนความถี่ 2 เท่า 3 เท่า … ออกมาด้วยหรือที่เรียกว่า Harmonic Distortion (ความเพี้ยนแบบฮาร์โมนิค? ผมขอไม่บัญญัติศัพท์ใหม่ดีกว่า ใช้ภาษาอังกฤษไปเลยละกัน) ถ้าเอาค่าความเพี้ยนนี้มารวมกันทั้งหมดจะเรียกว่า Total Harmonic Distortion หรือย่อว่า THD (หลายคนน่าจะรู้จักตัวนี้)\nวิธีแปลผลกราฟนี้ ให้ยึดว่าต้องการมาตรฐานลำโพงระดับไหน แล้วแต่เป้าหมายแต่ละคน ลำโพงที่อยู่ระดับที่ดีหน่อยควรจะมี THD ไม่เกิน 3% (ตัวเลขนี้มาจากผมดูตามเว็ปต่างประเทศแล้ววัด ๆ กัน) และถ้าลำโพงที่จะบอกว่ามีความเที่ยงตรงสูงได้ จะต้องมี THD ต่ำกว่า 1%\nข้อควรระวังของการวัดกราฟชนิดนี้ คือเวลาอัดเสียงระดับเสียงรบกวนจะต้องน้อยมากๆ จะให้ดีต้องให้ได้น้อยกว่า 40dB ไม่อย่างนั้นค่า THD จะสูงผิดปกติ และถ้าวัดในห้องที่เก็บเสียงสะท้อนไม่ดี (หรือดีแล้วบ้างทีก็ยังเอาไม่อยู่) ช่วงเบสลงไปจะมี THD เพิ่มขึ้นเสมอทำให้ดูผลไม่ค่อยได้\n\n\nกราฟอิมพัลส์ Impulse\n\nใช้ดูว่าห้องที่อัดมีเสียงสะท้อนขนาดไหน คลื่นสูงๆ คือเสียงจากต้นกำเนิดเสียง และจากนั้นประมาณ 4 ms ก็จะมีคลื่นเล็ก ๆ อีกคลื่นหนึ่ง เรียกว่าเสียงจากการสะท้อนครั้งแรก หรือ first reflection ซึ่งส่วนใหญ่ก็จะมาจากการสะท้อนพื้นหรือเพดาน กราฟ impulse นี้ไว้สำหรับให้เราปรับช่วงที่สนใจที่เรียกว่า IR Windows ในรูปจะเป็นสี่เหลี่ยมคางหมูสีน้ำเงิน ซึ่งวิธีปรับ ให้ปรับขอบด้านซ้ายของสี่เหลี่ยมอยู่ก่อนถึงจุด impulse สูงสุดเล็กน้อย และด้านขวาหยุดก่อนจุดสะท้อนครั้งแรก\nวิธีใช้อย่างละเอียดผมแนะนำให้อ่านบทความของคุณ Withaya Tangtanaporn เช่นกัน\ndocs.google.com/document/u/1/d/1K_Ayk_l8lwntYFocBcB9dnN_VmSE6B11esgMWWMnqXw\n\n\nตัวอย่างกราฟ FR ก่อนและหลังปรับ IR Window\n\nคุณจะเห็นว่าก่อนปรับ IR กราฟจะเป็นคลื่น ๆ เต็มไปหมด แต่หลังจากปรับแล้วกราฟจะดูง่ายขึ้นแต่แลกด้วยคลื่นความถี่ต่ำที่หายไป หลักการคือเมื่อปรับช่วง IR Window น้อยลง เวลามันจะไม่มากพอที่จะจับความถี่ต่ำๆ เช่น 20 Hz ต้องใช้เวลาถึง 50 ms เพื่อจะได้คลื่นครบ 1 คาบ\nมีข้อเข้าใจผิดว่าการปรับ IR Window เป็นการทำให้เสียงที่แท้จริงหายไป แต่จริงๆ แล้วสิ่งที่หายไปคือเสียงสะท้อนจากห้องที่วัดต่างหาก ส่วนตัวที่ทำให้เสียงที่แท้จริงหายไปนั้นจะเรียกว่าการ smoothing ซึ่งเป็นการเฉลี่ยกราฟเดิม (ใครเล่นหุ้นคงรู้จักพวก MA EMA)\n\n\nWaterfall\n\nกราฟต่อมากราฟน้ำตก หรือ Waterfall หรือบ้างก็เรียก Spectral Decays กราฟนี้จริง ๆ แล้วมันก็คือ FR นี่แหละแต่พลอตตามแกนเวลาด้วยว่าเสียงมันหายไปเร็วขนาดไหน ในทางอุดมคติแล้วกราฟมันควรจะเริ่มแล้วตกลงให้เร็วที่สุด นั่นคือหน้าตามันควรจะมีด้านบน (FR) เรียบๆ แล้วก็น้ำตกแบน ๆ ไม่มีอะไรยื่นออกมา ส่วนในความเป็นจริง ขอให้สิ้นสุดก่อน 2 ms ก็เป็นอันใช้ได้\nอยากในตัวอย่างคุณจะเห็นว่ามีส่วนที่ยื่นออกมาช่วง 4 kHz และแถวๆ 11 kHz หรือจะเรียกว่ามีการสะสมพลังงานที่ 4 และ 11kHz ก็ได้  ซึ่งจริงๆ ก็ให้ความหมายที่ต่างกัน\nช่วง 4 kHz สังเกตว่า FR ช่วงนี้ก็อยู่ในค่าเฉลี่ย แต่มีสะสมพลังงานในช่วงนี้ จากที่ผมหามาเขาบอกว่าสิ่งนี้เกิดจาก cone breakup หรือการสั่นพ้องในกรวยหรือไดอะแฟรมลำโพงเอง ซึ่งจะพบในดอก woofer ทุกตัว เพี่ยงแค่ย่านที่เกิด cone breakup นั้นโดน crossover ออกไปแล้ว ก็จะไม่ส่งผลเสียอะไร (ยกเว้นว่า crossover ด้วย C ตัวเดียว อันนี้ไม่นับนะ cone breakup ยังอยู่ครบๆ เลย) ส่วนดอก full range อันนี้ต้องทำใจยังไงก็มี\n11kHz คุณจะเห็นว่า FR ช่วงนี้มันสูงมาก ดังนั้นส่วนที่ยื่นออกมานี้ไม่เป็นปัญหา\nซึ่งจริงๆ แล้วถ้าผมยกกราฟทั้งหมดนี้ขึ้นมาอีกซัก 20dB คุณก็จะเห็นว่ามีส่วนที่ยื่นออกมาเต็มไปหมดเลยซึ่งนั่นเป็นเรื่องปกติของกราฟนี้\nคราวนี้กราฟนี้จะดูอย่างไรว่าน่าเชื่อถือหรือไม่ เพราะจากกราฟตัวอย่างนี้ ถ้าผมยกลงไปสัก 5 dฺB ส่วนที่สะสมพลังงานก็จะจมหายไปหมด หลักการของผมที่ใช้อยู่ตอนนี้คือ กราฟจะต้องมีความสูงอย่างน้อย 25dB เช่นค่าเฉลี่ยของกราฟอยู่ที่ 85dB จุดต่ำที่สุดของกราฟควรจะแสดงถึง 60 dB เป็นต้น และแกน Z (แกนที่พุ่งหาตัวเรา) ควรจะอยู่ที่ประมาณ 4ms rise time อยู่ที่ประมาณ 0.6 ms และต้องเปิด CSD ด้วย ซึ่งค่าพวกนี้คุณจะเช็คได้จากมุมบนขวาของกราฟ\nสรุปการตั้งค่าโปรแกรม\nกราฟสูง 25 dB\nmode = Fourier\nTotal slices = 100\nWindow ~ 4ms (บางครั้งเมื่อปรับเป็น 4 ms มันจะมี first reflection เข้ามาด้วย อันนี้ก็ต้องปรับลงหน่อย)\nTime Range ~ 4ms (เท่า Window)\nRise time = 0.6ms\nUse CSD Mode\nวันนี้ก็ขอจบเพียงเท่านี้ก่อนโปรดติดตามตอนต่อไป\n"},"Measurement/EP2-อุปกรณ์อะไรสำคัญที่สุดสำหรับนักออกแบบลำโพง":{"title":"EP2 อุปกรณ์อะไรสำคัญที่สุดสำหรับนักออกแบบลำโพง","links":[],"tags":[],"content":"ลิงค์ EP 1\nwww.facebook.com/groups/791461357947350/permalink/1902348570191951/\nต่อจาก EP1 เดี๋ยววันนี้จะมาดูกันต่อว่านอกจากอัดเสียงมาดูแล้ว เรายังเอาโปรแกรมนี้ไปใช้ดูอะไรได้อีก\n\nImpedance\n\nคุณสามารถวัดค่า ความต้านทาน หรือ Impedance ของดอกลำโพงได้ ซึ่งอาจจะต้อง “ทำสาย” นิดหน่อยซึ่งเรื่องสายเดี๋ยวผมจะมาบอกวิธีทำใน EP3\n\n\nT-S parameters\n\nเมื่อได้ค่า impedance แล้ว สิ่งต่อมาที่ REW สามารถทำได้คือกาคำนวณ T/S parameters\nสำหรับคนยังไม่รู้จัก T/S parameter ให้อ่านเพิ่มเติมที่นี้\nwww.facebook.com/groups/791461357947350/permalink/1892504631176345/\nวิธีการคำนวณ T/S parameters โปรแกรมมีให้ใช้ 3 วิธีคือ\n1 Dual added mass - การถ่วงน้ำหนัก 2 รอบ\n2 Added mass - การถ่วงน้ำหนักปกติ (ถ่วงน้ำหนัก 1 รอบ)\n3 Sealed Box - วัดโดยใช้กล่องปิด (ต้องทำกล่องขึ้นมาเพื่อวัดลำโพงโดยเฉพาะ)\nวิธีที่ผมแนะนำคือวิธี ถ่วงน้ำหนัก 2 รอบ (Dual added mass) ซึ่งมีความแม่นยำสูงกว่าแบบถ่วงน้ำหนักปกติ\nอุปกรณ์ที่ต้องใช้\n\nสายวัด impedance\nกาวดินน้ำมัน (ไม่แนะนำดินน้ำมันปกติเพราะมันเลอะเทอะ)\nตาชั่งละเอียดๆ (ตาชั่งสำหรับทำขนมหรือตาชั่งกาแฟ)\nยางลบสี่เหลี่ยมใหม่ ๆ 3-4 ก้อน\n\nขั้นตอนการทำโดยสังเขปคือ\n\nวัด impedance ปกติก่อน หงายลำโพงตั้งไว้บนยางลบแล้ววัด\nปั้นกาวดินน้ำมันเป็นก้อน 4 ก้อนเท่าๆ กัน น้ำหนักจะต้องน้อนกว่า MMS เล็กน้อย (ซึ่งเดี๋ยวค่อยมาปรับทีหลังก็ได้ ครั้งแรกกะๆ ไปก่อน)\nเอากาวดินน้ำมัน ทั้ง 4 มาแปะที่หน้าลำโพง กระจายเท่าๆ กันเป็นสี่เหลี่ยม แล้ววัด impedance อีกรอบ\nเอากาวดินน้ำมันออก 2 ก้อน (ต้องอยู่ด้านตรงข้ามกันด้วยนะเพื่อความสมดุล) แล้ววัด impedance อีกรอบ\nเมื่อได้ค่า impedance ทั้ง 3 มาแล้วเราก็เปิด tools &gt; Thiele-Small Parameters ขึ้นมา\nใส่ข้อมูลด้านซ้ายให้ครบแล้วกด calculate\nโปรแกรมจะบอกว่าเราใช้น้ำหนักมากไปน้อยไปไหม ถ้าน้ำหนักยังไม่ได้ก็ให้ทำข้อที่ 2 ใหม่ แต่รอบนี้โปรแกรมจะบอกค่า MMS มาแล้ว เราก็กะขนาดกาวดินน้ำมันให้เล็กลงนิดนึง\nถ้ากดคำนวณแล้วได้ค่าที่ใช้ได้ สามารถกด Write Parameters to File เพื่อเก็บค่าไว้ได้\n\n(มีต่อรูปถัดไป)\n\n\nดูความแม่นยำของการคำนวณ\n\nหลังจากปิดหน้าต่างลงแล้ว กราฟ impedance เดิมของเราจะมีเส้นเพิ่มขึ้น วิธีดูว่าการวัดของเราแม่นยำไหม ให้ดูที่ เส้น Bl ว่าเรียบเป็นแนวนอนไหม ถ้าคงที่เป็นแนวนอนนับว่าใช้ได้ (จริงๆ ตอนกดคำนวณโปรแกรมมันก็มีเตือนเหมือนกันเวลาค่านี้แปลกๆ)\nนี้เป็นวิธีแบบคร่าวๆ ถ้าใครอยากได้วิธีละเอียด ๆ พร้อมภาพประกอบก็บอกผม หรือจริงๆ ดูผ่าน Youtube ก็น่าจะมีหลายๆ คนทำไว้เหมือนกัน\n\n\nInductor\n\nอีกฟังก์ชันหนึ่งที่โปรแกรมสามารถทำได้โดยคนอาจจะไม่ค่อยรู้กัน คือโปรแกรมนี้สามารถใช้เป็น LCR Meter ได้ด้วย ตัวอย่างในรูปคือการวัดลวดตัวนำ โดย Lsum คือค่าตัวนำรวม ในรูปตัวที่ผมเอามาวัดคือลวดตัวนำแกนอากาศ 700 uH ซึ่งค่าออกมาคิดว่าน่าจะตรง\n\n\nCapacitor\n\nอันนี้เป็นการวัดตัวเก็บประจุ Zennic 2.2uF ซึ่งโปรแกรมมีบอกค่า ESR มาด้วย (ตัวนี้ผมชอบมาก) ซึ่งปกติ LCR Meter ตัวถูกๆ มันจะวัดออกมาไม่ได้ เพราะค่ามันน้อยมาก\nวันหลังผมว่าจะเอา C หลายๆ ตัวมาวัดให้ดูกัน ใครอยากจะส่ง C ยี่ห้อแปลกๆ มาให้ผมวัดด้วยก็ได้นะ : D\n\n\nGenerator และ RTA\nต่อไปเป็นส่วนที่ผมใช้วัดแอมป์ ซึ่งก็จะใช้ความสามารถของโปรแกรมสองส่วนคือ 1 ฟังก์ชันเจนเนอร์เรเตอร์ (Function Generator) และ RTA\nFunction generator เป็นการเปิดคลื่นเสียงตามที่กำหนดขึ้นมาซึ่งก็มีให้เลือกหลากหลายมาก มีทั้งตั้งค่าเองและใช้ค่าตามมาตราฐาน เช่น SMPTE DIN CCIF AES หรือจำลองเสียงดนตรีด้วย 16 tones (ยิงเสียง 16 ความถี่)\n\n\n\nตัวอย่าง 1\nตัวอย่างนี้เป็นการวัด Topping L70 ซึ่งถ้าใครเล่นหูฟังก็คงจะพอได้ยินชื่ออยู่บ้าง เจ้า Topping ตัวนี้มีชื่อเรื่อง THD ที่ต่ำมากๆ ในกราฟเป็นค่าที่วัดได้จาก จาก CCIF ซึ่งเป็นการยิงคลื่นที่ความถี่ 19k และ 20k Hz ซึ่งย้านความถี่สูงนี้ปกติจะเป็นจุดอ่อนของแอมป์ Class D\n\nซึ่งกราฟของ Topping L70 เรียบใช้ได้เลยนับว่าใช้ได้\n\n\nตัวอย่าง 2\nอีกตัวที่เอามาเทียบคือ Fosi V3 ซึ่งจัดเป็นแอมป์ class D ที่ถูกและดีที่สุดตัวหนึ่งในหมู่แอมป์ราคาถูก ถ้าสังเกตุที่ 1k Hz คุณจะเห็นว่ามีแท่งขึ้นมา ซึ่งแสดงว่ามีหลุดมานิดหน่อย\n\nแต่อย่างไรก็ตามจะเทียบ Fosi V3 กับ Topping L70 ก็อาจจะไม่ถูกนัก เพราะ Fosi เป็นเพาเวอร์แอมป์ และ Topping L70 เป็นแอมป์หูฟัง\nวิธีวัดและมาตราฐานการวัด ถ้ามีคนสนใจก็ขอให้คอมเมนต์ ผมอาจจะขอให้น้องผมเขียนบทความไว้ให้\n\n\nแนะนำ\nสำหรับคนสันทัดภาษาอังกฤษผมแนะนำช่องของ Audio Science Review เอาเป็นคนที่ น่าจะบอกได้ว่าเป็นผู้นำในการวัดคุณภาพของ DAC/AMP คลิปนี้เพิ่งจะออกสดๆ ร้อนๆ เลย\nAudio Science Review AES Paper Presentation on Audio DACs\nwww.youtube.com/watch\n\nAmirm เขาเคยเป็นรองประธานสาขาสื่อดิจิตอลของไมโครซอฟ นับว่ามีดีกรีใช้ได้เลยทีเดียว\nwww.audiosciencereview.com/forum/index.php\nเดี๋ยว EP ถัดไป ผมจะมาแจงรายการดูว่าจะต้องใช้อุปกรณ์อะไร ราคาเท่าไหร่บ้าง\n"},"Measurement/EP3-อุปกรณ์อะไรสำคัญที่สุดสำหรับนักออกแบบลำโพง":{"title":"EP3 อุปกรณ์อะไรสำคัญที่สุดสำหรับนักออกแบบลำโพง","links":[],"tags":[],"content":"EP1 - แนะนำกราฟ REW ที่ได้จากการอัดเสียง\nwww.facebook.com/groups/791461357947350/permalink/1902348570191951/\nEP2 - แนะนำกราฟอื่นที่ REW สามารถเก็บได้\nwww.facebook.com/groups/791461357947350/permalink/1902718620154946/\nEP3 นี้ผมจะมาแนะนำอุปกรณ์ ต้องใช้อะไรบ้าง\nคิดว่าเดี๋ยวผมคงจะลิสต์รายการออกมาก่อนว่าต้องมีอะไรบ้าง แล้วเดี๋ยวค่อยลองจับชุดรวมราคาดูว่าเท่าไหร่ ในแต่ละหัวข้อผมจะบอกก่อนว่าอุปกรณ์นั้นๆ ใช้ทำอะไร จากนั้นก็สเป็คที่ผมแนะนำ อุปกรณ์ที่ผมแนะนำ ราคา และที่ซื้อ (แต่ไม่จำเป็นต้องซื้อตามผมนะ และผมไม่ได้ประโยชน์ได้ ๆ จากการแนะนำสินค้า) ของที่ผมแนะนำจะพยายามเน้นของถูกและดีพอ จากนั้นถ้ามีอะไรเพิ่มเติมผมก็จะเขียนต่อท้าย\n\nวิธีประหยัดงบที่สุด - ไม่ซื้ออุปกรณ์เพิ่ม\n\nใช้สำหรับ\n\nวัด FR\n\nคือใช้แค่มือถือ แล้วลงโปรแกรม RTA เช่น\nสำหรับหุ่นเขียว play.google.com/store/apps/details\nสำหรับแอปเปิ้ล apps.apple.com/th/app/mobile-tools-by-audiocontrol/id1321129383\nแล้วอัดเสียง White Noise\nwww.youtube.com/watch\nหรือถ้าคุณมีไมค์โครโฟนอยู่แล้วคุณจะลองเอามาวัดโดยใช้ฟังก์ชัน RTA ของ REW ก็ได้\n\n\nวิธีแบบประหยัด (ต่อ)\n\nข้อเสียก็คือวิธีการนี้คือมันมักจะมีความคลาดเคลื่อนที่สูงมาก จากรูปผมใช้มือถือและไมค์ของผมวัด white noise จากลำโพงตัวเดียวกัน จะเห็นว่าผลลัพธ์มันไปกันคนละทางเลย สำหรับคนใช้แอปเปิ้ลอาจจะได้ผลที่ดีหน่อยเพราะฮาร์ดแวร์ของแอปเปิ้ลค่อนข้างเป็นมาตรฐาน โปรแกรมอาจจะมี calibrate ไว้ก่อนทำให้วัดได้ตรง ส่วนใครใช้แอนดรอยด์นี่จะยากหน่อยไมค์แล้วแต่ผู้ผลิตเลย ยากที่โปรแกรมจะมี calibrate มาก่อน\nส่วนไมค์ที่ใช้ประชุมออนไลน์ทั่วไปก็เช่นกัน ปกติมันจะไม่ได้จูนมาให้ตรงอยู่แล้ว\nและอีกอย่างหนึ่งคือถึงอุปกรณ์ของคุณจะสามารถวัด FR ได้ตรง แต่ข้อมูลมันยังไม่แม่นยำพอสำหรับการทำเน็ตเวิร์ค ดังนั้นวิธีนี้อาจจะใช้ได้กับ DSP เท่านั้น\n\n\nAudio Interface\n\nใช้สำหรับ\n\nวัด FR\nวัด Impedance\n\nAudio Interface เป็นอุปกรณ์ที่ใช้สำหรับเชื่อมต่อไมค์หรือเครื่องดนตรีเข้ากับคอมพิวเตอร์\nสเปค์ที่ผมแนะนำคือ\n\nจะต้องมี input อย่างน้อย 2 channel และ output อย่างน้อย 2 channel\nSNR ยิ่งสูงยิ่งดี (หรือ THD ยิ่งต่ำยิ่งดี)\nเรื่อง Gain ไม่จำเป้นต้องมากเพราะเราใช้วัดลำโพงหางอย่างมาก 1 เมตร ซึ่งเสียงดังพออยู่แล้ว\nใช้ ASIO ได้\nSample rate สูง\n\nAudio interface ตัวที่ผมแนะนำตอนนี้คือ Topping E2x2 ราคาประมาณ 5,650 บาท\nซึ่งราคาถูกมากๆ สำหรับ input 2 channel และ THD ที่ต่ำถึง 0.0003% ขอเสียงของตัวนี้อาจจะเป็นที่ไมค์ Gain ไม่มาก แต่ก็ไม่จำเป็นสำหรับงานเราอยู่แล้ว\nth.aliexpress.com/item/1005005900994376.html\nแต่เสียดายของหมด! ตอนนี้เห็นแต่พี่ใหญ่ Topping E4x4 ราคา 9 พันกว่าบาท มี 4 in 4 out ซึ่งอาจจะเยอะเกินไปถ้าเราไม่ได้เอาไปใช้งานอื่นเช่นวัดอะคูสติกห้อง\n\n\nไมค์ RTA\nใช้สำหรับ\n\n\nวัด FR\n\nไมค์ชนิด RTA หน้าตาของไมค์ชนิดนี้จะเป็นกระบอกยาวๆ ดังภาพ\nสเปค์ที่ผมแนะนำคือ\n\nมีไฟล์ calibrate มาให้ (อาจจะดาวน์โหลดจากเว็ปผู้ผลิต) หัวข้อนี้สำคัญมาก จำเป็นต้องมี ถ้าไม่มีมาให้ข้ามสถานเดียว\nเป็น polar pattern แบบ omnidirectional ซึ่ง RTA ควรเป็นชนิดนี้อยู่แล้ว แต่ก็ระวังไว้เผื่อเจอของประหลาด\n(ไม่จำเป็น แต่ถ้าได้ก็จะแม่นกว่า) เป็นไมค์สำหรับวัด free field\n\nไมค์ที่ถูกที่สุดที่ผมแนะนำคือ Dayton Audio EMM6 ราคา 5,050\nshopee.co.th/Dayton-Audio-EMM-6-Electret-Measurement-Microphone-i.13051438.23282862515\nเป็นตัวที่พแใช้งานได้ สามารถดาวน์โหลดไฟล์ calibrate ได้จากเว็ป โดยไมค์ทุกตัวจะมีรหัสอยู่แต่ละตัวก็จะไช้ไฟล์ calibrate ไม่เหมือนกัน (ซึ่งมันต้องเป็นแบบนี้นะ ถ้าเกิดมีเจ้าไหนให้ใช้ไฟล์เดียวกันหมดให้ระวังไว้)\nบางทีคุณอาจจะเจอไมต์ RTA ราคาไม่เกิน 2 พันบนเว็ปส้ม แต่ผมก็ไม่แนะนำเพราะมันไม่มีไฟล์มาให้นี่แหละ\n\n\npolar pattern ของไมค์\n\nขอแตะเรื่องนี้ซักเล็กน้อยว่าทำไมต้องเป็น Omnidirectional ทั้งที่วัดลำโพงที่อยู่ข้างหน้า เป็น directional ไม่ดีกว่าเหรอ?\nที่ใช้ไมค์ที่มี polar pattern แบบอื่นไม่ได้นั้นเพราะว่ามันมี proximity effect ซึ่งเป็นปรากฏการที่พอเลื่อนไมค์เข้าไปใกล้ๆ จุดกำเนิดเสียงแล้วเสียงย่านเบสจะดังขึ้น เหมือนเวลาคุณเอาไมค์จอใกล้ ๆ ปากแล้วเสียงจะหล่อขึ้นนั่นแหละ\nในการวัดลำโพงเองจะมีขึ้นตอนการวัด Near field ที่จะต้องเอาไมค์ไปจ่อลำโพงให้ใกล้ที่สุด ทำให้ไมค์ที่เลือกใช้จะต้องไม่มี proximity effect นั่นคือเหตุผลว่าทำไมไมค์ถึงต้องเป็น Omnidirectional\n\n\nสาย XLR\nใช้สำหรับ\n\n\nวัด FR\n\nถ้าคุณใช้ไมค์แล้ว ก็ต้องไม่ลืมว่าจะต้องมีสายไมค์ด้วย\nสาย XLR 5 เมตร ตกประมาณ 250 บาท หรือจะทำเอง ใช้ของดี ๆ ไปเลยก็ได้เหมือนกัน\n\n7. ไมค์ RTA แบบ USB\nใช้สำหรับ\n\nวัด FR\n\nข้อดีคือถ้าเป็น USB ก็ไม่ต้องมี audio interface ก็ได้\nข้อเสียคือมันจะทำให้คุณต้องซื้ออย่างอื่นมาเพื่อใช้วัดค่า impedance แทน\nสเปค์ที่แนะนำไม่ต่างจากไมค์ RTA ปกติ\n\nต้องมีไฟล์ calibrate\nเป็น polar pattern แบบ omnidirectional\n\nไมค์ตัวที่แนะนำก็ยังคงเป็นของ Dayton คือ Dayton Audio UMM6 ราคาประมาณ 7000 บาท\n\n\nDATS V3\nใช้สำหรับ\n\n\nวัด Impedance\n\nเป็นอุปกรณ์ที่ใช้วัด impedance และหาค่า T/S parameters จาก Dayton\n(Dayton อีกแล้ว เจ้าของร้านนี่รักผมตายเลย)\nDATS V3 ซึ่งก็จะมาพร้อมกับโปรแกรมของมันเอง แต่มันก็สามารถใช้กับ REW ได้เหมือนกัน (และใช้ได้ดีด้วย)\nDATS V3 ราคา 9,190 บาท\nwww.samdee-audio.com/product/1305/dayton-audio-dats-v3-computer-based-speaker-audio-component-test-system\nข้อดีของตัวนี้คือมันไม่ยุ่งยากในการใช้งาน (เดี๋ยวดูรูปต่อไปจะเห็น) แต่ปัญหาก็คือราคาแพง และเหมือนจะยังไม่มีของ แต่ก็ไม่แน่อาจจะเข้ามากลางเดือนนี้ก็ได้\n\n\nสายสำหรับวัด Impedance\n\nใช้สำหรับ\n\nวัด Impedance\n\nตัวนี้เป็นสายที่ต้องทำเอง หรือใครจะเอาไปทำขายก็ไม่ว่ากันนะ\nวิธีทำสายดู เต็ม ๆ ได้จากลิงค์นี้ หรือ Youtube ก็น่าจะมีคนสอน (ไม่ก็ดูจากรูปต่อไป)\nwww.roomeqwizard.com/help/help_en-GB/html/impedancemeasurement.html\nส่วนประกอบก็จะมี\n\nหัว TS ขนาด 6.5 3 หัว ใครจะใช้หัว Neutrik ก็ได้ แต่ของผมใช้ LIDGE หัวละประมาณ 40 บาท\nสาย 2 คอร์ 1 เมตร (หรือใครจะเผื่อยาวหน่อยก็แล้วแต่) ตัดเป็น 2 เส้น ผมใช้ของดีหน่อยราคา 110 บาท\nคลิปปากจระเข้ ตีซะอันละ 5 บาท\nตัวต้านทาน R (sense) 100 ohm 1/2 W 1 ตัว คิดราคา 5 บาท\nตัวต้านทาน R (calibrate) 1k ohm 1/2W 1 ตัว คิดราคา 5 บาท\n\nตกราคารวมประมาณ 250 บาท ไม่รวมค่าแรง\n\n\nวิธีต่อสาย\n\nตามภาพด้านซ้ายจะเป็นวิธีต่อจากเว็ป REW ซึงผมว่าดูยาก ผมเลยวาดใหม่เป็นรูปด้านขวา ซึ่งน่าจะดูง่ายขึ้น (มั้ง)\nสุดท้ายจะเหลือ R (calibrate) 1k ohm อีกตัวนึง ซึ่งตัวนี้จะใช้ตอน calibrate ในโปรแกรม\n\n\nสรุปราคา\n\nชุดที่ 1 - สาย DIY\nAudio interface + ไมค์ RTA + สาย XLR + สายทำเอง\n5650 + 5050 + 250 + 250 = 11,200 บาท\nชุดที่ 2 - ไม่เอา AI (audio interface)\nไมค์ RTA + DATS V3\n7000 + 9190 = 16,190 บาท\nชุดที่ 3 - ไม่เอาสาย DIY\nAudio interface + ไมค์ RTA + สาย XLR + DATS V3\n5650 + 5050 + 250 + 9190 = 20,140 บาท\n"},"Measurement/Free-Field-Measurement":{"title":"Free Field Measurement","links":[],"tags":[],"content":"youtu.be/rEEe0we1Mrs\nAnechoic chamber\n\nOutdoor\n\nGround plane method\n\nNear Field + Far Field /w IR Windows"},"Measurement/tweeter/Baffle":{"title":"Baffle","links":[],"tags":[],"content":"วันนี้ผมเอาผลการทดลองจากหน้ากากแบบต่างๆ ที่ทำไว้ในตอนที่แล้วมาแชร์\nเผื่อเป็นประโยชน์กับนักออกแบบลำโพง\nwww.facebook.com/groups/791461357947350/permalink/1882010858892389/\n\nรวม link บทความเก่า\nมือใหม่หัดซื้อแอมป์\nEP1 ของแท้ ไม่แท้\nwww.facebook.com/groups/791461357947350/permalink/1872169166543225/\nEP2 filter ไม่ filter\nwww.facebook.com/groups/791461357947350/permalink/1873899479703527/\nEP3 สะอาด ไม่สะอาด\nwww.facebook.com/groups/791461357947350/permalink/1878204179273057/\nอยากแรกต้องขอกล่าวถึงทฤษฎี baffle diffraction ที่จะเป็นส่วนสำคัญในการทดลองวันนี้ก่อน\nbaffle diffraction ในภาษาไทยผมยังหาบัญญัติศัพย์นี้ไม่ได้ ถ้าจะแปรตรงตัวก็คงเป็น\nการเลี้ยวเบนหรือการกระจายของเสียงที่ขอบหน้าลำโพง\nซึ่งปรากฎการนี้จะเกิดขึ้นจากคลื่นเสียงเดินทางไปเจอขอบแหลมๆ ของหน้าลำโพง\nแล้วเสียงเกิดการกระจายตัวออกมาเสมือนมีจุดกำเนิดเสียงอีกจุดหนึ่งที่ขอบ\nเสียงที่กระจากออกมาจากขอบนี้เองสามารถไปเสริมหรือหักล้างกับเสียง\nจากดอกลำโพงได้ ขึ้นอยู่กับ phase ของคลื่นทั้งสอง\nหรือจะบอกว่าขึ้นกับระยะห่างจากดอกถึงขอบและความถี่ของเสียงก็ได้\nซึ่งวิธีแก่ก็มีหลายวิธีเช่น ออกแบบขอบตู้ให้ชิดลำโพงมากที่สุด\nหรือออกแบบตู้ให้โค้งมนหรือเฉียงลงไป\nหรือเว้นระยะดอกลำโพงกับด้านแต่ละด้านให้ไม่เท่ากัน\nหรือใส่ wave guide ขอบมนๆ ลงไป (อันนี้ไม่มั่นใจแต่เคยได้ยินว่าช่วยได้)\nอ่านเพิ่มเติมได้ที่ audiojudgement.com/speaker-baffle-design-and-diffraction/\n\nอุปกรณ์ที่ใช้ทดสอบ\nTweeter JBL\nรูปนี้ใช้หน่วยวัดเป็น มม.\nเผื่อเอาไปใช้คำนวณความยาวคลื่นภายหลัง\n\nชุด baffle สี่เหลี่ยม\nเลือกใช้สี่เหลี่ยมผืนผ้าแล้วตำแน่งลำโพงอยู่ตรงกลาง เพื่อจะใด้เห็น diffraction มาขึ้น\nและไม่อยากใช้สี่เลี่ยมจตุรัสเพราะเดียวจะมีผลมากเกินไป\n(มีเตรียมรูปทรงที่น่าจะโดน diffraction มากที่สุดไว้ต่างหากแล้ว)\nส่วนประกอบจะมี 3 ส่วน\nจากซ้ายไปขวา\n\nแผ่นปิดหน้าลำโพงเพื่อใช้บังน็อต\nแผ่นติดตั้งลำโพง\nขอบมน สำหรับใช้ลด diffraction ตามทฤษฎี\n\nหมายเหตุไว้ก่อนว่าแผ่นแรกและแผ่นที่สองจะปิดกัยไม่สนิดเมื่อติดตั้งลำโพงลงไป\nเพราะจะมีหัวน็อตขึ้นมาประมาณ 2-3 มม.\n\nชุด baffle กลม\n\nขอบคม ตามทฤษฎีแล้วแบบนี้น่าจะแย่ที่สุด\nขอบมน และโค้งมนไปถึงด้านหลังเลย ตามทฤษฎีแล้วแบบนี้อาจจะดีที่สุด\n\n\nref ไม่ใส่หน้ากากใด ๆ\nวันนี้แก้ไข noise floor จากคราวที่แล้วน่าจะมีเยอะไปหน่อย\nก็จะเห็น noise (ซ้ายล่าง) ต่ำลงเป็นปกติละ\nซึ่งถ้าดูจากกราฟปกติก็จะ crossover ที่ประมาณ 2k ขึ้นไปได้ไม่มีปัญหา\nส่วน SPL (ขวาบน)\nมีโหนกอยู่ที่ 2.4, 3.3, 4.1, 5.1 kHz\nมีหลุมอยู่มี่ประมาณ 13-14.5 kHz\nซึ่งขอบ tweeter ตัวนี้มันหนาประมาณ 2-3 ซม.\nเพื่อท่านใดอยากลองคำนวณดู ระยะวัดอยู่ที่ 1 ม.\nส่วนผมยังพันธงไม่ได้ว่าเป็น baffle diffraction หรือปล่าว\n\nสี่เหลี่ยมขอบคม\nโหนกใหญ่ที่ 2-6 kHz ย้ายมาความถี่ต่ำลงที่ 1.5-5.5 kHz แทน\nโหนกสุงประมาณ 7-8 dB\n\nใส่แผ่นบังน็อตลงไป ติดกันด้วยกาวดินน้ำมัน\n(ตัวอย่าง shopee.co.th/product/88404911/2953067119 อันนี้ผมแนะนำ\nใช้ติดลำโพงกันลมรั่วได้ดีมากๆ ถอดง่ายด้วย)\nแล้วก็อย่างที่กล่าวไว้เบื้องต้น แผ่นทั้งสองจะติดกันไม่สนิดเหลือช่องประมาณ 2-3 มม.\nผลวัดออกมาค่อนข้างตกใจอยู่ เข้าใจว่าที่มันเป็นหลุมลงไปขนาดนั้นเพราะว่าช่อง 2-3 มม.นี้แหละ\nถ้าสามารถทำให้ทั้งสองแผ่นแนบกันได้สนิด ผลวัดน่าจะออกมาดีกว่านี้\n\nใส่ขอบมนลงไป โดยขอบเสมอกันพอดี\nโหนกที่เกิดขึ้นย่อลงมาเหลือ 6 dB และกราฟเรียบขึ้นอย่างเห็นได้ชัด\n\nใส่แผ่นปิดหน้าลงไป\n(รูปนี้ลืมถ่ายมาเลยขอตัดต่อเอา)\nจะเห็นหลุมที่ 4.5kHz แต่ก็ดูดีกว่าตอนไม่มีขอบ\n\nอันนี้ผมลองเว้นระยะเข้าไปจากขอบ 1 ซม.\nเกิดหลุมที่ 4.5 - 5kHz\n\nใส่แผ่นปิดหน้าและเว้นระยะเข้าไปจากขอบ 1 ซม.\nหลุมที่เดิมและเยอะขึ้นไปอีก\n\nเว้นระยะเข้าไปจากขอบ 2 ซม.\nรูปขอให้ทุกท่านจินตนาการ อันนี้ผมไม่มีความสามารถพอจะตัดต่อต้องขออภัย\n\nตัวนี้คือเว้นระยะเข้าไปจากขอบ 2 ซม. แล้วเอาแผ่นปิดหน้าเว้นเข้าไปจากขอบ 1 ซม.\nส่วนเสียงนั้นผมไม่พูดถึงละกัน\n\nตัวนี้คือเว้นระยะเข้าไปจากขอบ 2 ซม. แล้วเอาแผ่นปิดหน้ามาปิดให้เสมอขอบ\n…\n\nมาลองแบบกลมกันบ้าง\nSPL ออกมาดูกีว่าที่ผมคิดไว้มาก\n\nกรอบกลมและมน\nความชันของเนินดูไม่ต่างกันมาก\nถ้าเทียบกับแบบขอบคม ส่วนเนินต่ำลงประมาณ 1 dB และ\nส่วนชันที่ 7.7 kHz ไม่ปักลงมามาก\n\nอันนี้ออกแบบเล่นๆ ให้เป็นทรงจรวด คล้ายของ B&amp;W\nผิดหวังเล็กน้อย SPL หน้าตาแทบไม่ต่างจากไม่ใส่เท่าไหร่\nน่าจะไม่เหมาะกับ tweeter ที่มีขอบมาให้\n\nสรุป\nหน้าลำโพงทั้งสี่แบบนี้เป็นตัวที่ดีที่สุดในการทดลองครั้งนี้\nซ้ายบนน่าจะเป็นแบบที่ดีที่สุดยิ่งโค้งมากยิ่งดี แต่ก็ไม่ควรใหญ่มากเกินไปจนทำให้มีระยะห่างจากดอก mid หรือ woofer มากเกินไม่อย่างนั้นจะมีปัญหาเรื่อง phase ตามมาอีก\nแบบขวาบนสามารถออกแบบให้ดีขึ้นได้อีกถ้าเว้นระยะขอบแต่ละด้านไม่เท่ากัน ส่วนถ้าจะมีแผ่นมาปิดหน้าอีกที ต้องให้มั่นใจว่าแผ่นปิดหน้านั้นติดได้สนิด มีช่อง 1-2 มม. ก็ไม่ได้\nแบบซ้ายล่างไม่เหมาะกับ tweeter ที่มีขอบเลย เอาไปติดกล่องยังดีซะกว่า\nแต่ถ้า tweeter ไม่มีขอบ และออกแบบ wave guide ดีๆ น่าจะเป็นรูปแบบที่ดีที่สุด\nขวาล่างวัดออกมาดีกว่าที่คิดมาก แต่ตามทฤษฎีเขาว่าไม่ดีนะ ส่วนผมว่าไม่น่าเสี่ยงเท่าไหร่\n\nมาดูยี่ห้อดังๆ ออกแบบหน้าลำโพงกันดีกว่า\nB&amp;W A7\nตูนี้เขาออกแบบดอกลำโพงได้ชิดกับขอบมาก ๆ\nและยังมี wave guide มนๆ อีก\n\nB&amp;W Zeppelin\nตัวนี้น่าสนใจ\n\ntweeter อยู่สุดขอบ\nระยะ wave guide กับลำโพงไม่สมำเสมอกัน\ntweeter กับ mid อยู่ใกล้กันมาก\n\n"},"Measurement/tweeter/Measurement":{"title":"Measurement","links":[],"tags":[],"content":"วันนี้มาลองวัด tweeter หลาย ๆ ตัวที่มีอยู่ดู\nรวม link บทความเก่า\nมือใหม่หัดซื้อแอมป์\nEP1 ของแท้ ไม่แท้\nwww.facebook.com/groups/791461357947350/permalink/1872169166543225/\nEP2 filter ไม่ filter\nwww.facebook.com/groups/791461357947350/permalink/1873899479703527/\nEP3 สะอาด ไม่สะอาด\nwww.facebook.com/groups/791461357947350/permalink/1878204179273057/\nAIYIMA\nจาก th.aliexpress.com/item/1005005676416113.html\nใช้ในงานที่แล้ว\nwww.facebook.com/groups/791461357947350/permalink/1870300223396786/\nค่าที่วัดของลำโพงนี้ได้จากการวัดหลังใส่กล่องแล้ว\nและ noise floor ไม่เท่าตัวอื่น เลยอาจะโกงตัวอื่นไปนิดนึง\n\nเสียง distortion เยอะช่วง ต่ำกว่า 2k\nซึ่งก็เป็นเรื่องปกติ ก็ crossover ซัก 2k นิดๆ\nก็จะได้ distortion ประมาณ 35 dB\n\nวิธีการการวัดลำโพงตั้งแต่ตัวถัดไป ผมจะใช้วิธีการหนีบลำโพงให้ตั้งฉากกับพื้น\nเพราะไม่ได้ทำตู้หรือ baffle ไว้ ซึ่งก็จะเกิด baffle diffraction เยอะพอสมควร\nอีกอย่างคือการวัดรอบนี้อาจจะมี noise floor เยอะไปหน่อย ~42db\nซึ่งอาจจะทำให้เห็น distortion มากขึ้น\n\ntweeter 10 ohm ตัวละ 50 กว่าบาท\n\nเสียง distortion เยอะมาก\nแต่ SPL เรียบ\n\ntweeter 20 ohm ตัวละ 50 กว่าบาทเหมือนกัน\nมีบุบมาด้วยตัวนึง\n\nตัวนี้ถึง SPL จะเรียบ แต่ distortion เยอะมากจนได้ยินเสียงเลย\nเสียงตัวนี้เหมือนของเล่นเด็กสมัยก่อนเลย\n\nอันนี้เป็นตัวที่บุบ เหมือนเสียงจะดีขึ้น?!\nแต่ก็ใช้จริงไม่ได้อยู่ดี\n\nตัวนี้ผมได้มากจากบ้านหมอ แต่ก็น่าจะหาซื้อได้ทั่วไป\nเห็นหลายๆ คนใช้อยู่\n\nSPL +- 4db ก็นับว่าโอเคอยู่\ndistortion น้อยกว่าตัวถูกตัวอื่นเล็กน้อย\n\nตัวนี้ร้านบอกยี่ห้อ JBL\n\nSPL เรียบจนถึง 8k แล้วก็เริ่ม drop ลงไป -8db\nแล้วกดตกลงไปอีก -4db ช่วง 19-20k\n\nครั้งหน้าเดี๋ยวจะลองเอา JBL มากับหน้ากากหลาย ๆ แบบดู\n"},"Measurement/tweeter/Tweeter-Measurements-2":{"title":"Tweeter Measurements 2","links":[],"tags":[],"content":"มีผลการวัด tweeters มาฝาก\n\n\nวันนี้มีดอก tweeter อยู่ 4 ตัว\n\n\nAIYIMA 2 นิ้ว 6 โอม 30W\n\n\nAIYIMA 3 นิ้ว 6 โอม 15W\n\n\nAIYIMA 1.5 นิ้ว 4 โอม 80W\n\n\nDayton ND25FN-4\n\n\n\n\nสภาพห้องอัดวันนี้\n\nเนื่องจาก วันนี้ไม่ได้จัดห้อง จะเห็นว่า impulse response ไม่ค่อยนิ่งเท่าไหร่ first reflection เข้ามาประมาณ 3 ms แต่เนื่องจากวันนี้วัด tweeter เลยขอปรับ IR windows ไว้ที่ -1ms ถึง 2 ms\nสัญญาณที่ใช้วัด 1 V rms\nnoise floor ~30 db\n\n\nAIYIMA 2 นิ้ว 6 โอม 30W\nหน้าร้าน shopee.co.th/AIYIMA-2Pcs-2-Inch-6-Ohm-30W-Audio-Portable-Speakers-ABS-Altavoz-Portatil-Aluminum-Radiator-Hifi-Home-Theater-Tweeter-Speaker-i.266262896.4246453616\n\nหน้ากากผมใช้ ขนาดเท่าเดิม จาก\nwww.facebook.com/groups/791461357947350/permalink/1886245418468933/\nแต่รอบนี้ไม่ได้เอาดอกไว้ตรงกลางแล้ว เว้นระยะแต่ละด้านมีระยะห่างจากดอกถึงขอบไม่เท่ากันเพื่อลด diffraction\n\n\nแบบยังไม่ใส่ขอบโค้ง\n\nFs ประมาณ 1.75k Hz\nแนะนำ crossover สูงกว่า 2k Hz\n\n\n\nใส่ขอบโค้ง\n\n\n\nใส่ขอบโค้ง แล้วเว้นให้หน้าลึกลงไป 15 มม.\n\n\n(หลุม -7 db ที่ความถี่ 4k นิดๆ นี่โหดร้ายมาก)\n\n\nAIYIMA 3 นิ้ว 6 โอม 15W\nหน้าร้าน shopee.co.th/Aiyima-ลําโพงทวีตเตอร์-ผ้าไหม-4-6-8-โอห์ม-15W-3-นิ้ว-พร้อมแผง-2-ชิ้น-i.266262896.19979116094\n\n\n\nไม่ใส่ขอบโค้ง\n\nFs ประมาณ 2.3k Hz\nแนะนำ crossover สูงกว่า 2.5k Hz\n\n\n\nใส่ขอบโค้ง\n\n\n\nAIYIMA 1.5 นิ้ว 4 โอม 80W\n\n\nหน้าร้าน shopee.co.th/Aiyima-ลําโพงเสียง-1.5-นิ้ว-4-โอห์ม-80W-25-แกน-ไฟเบอร์เมมเบรน-2-ชิ้น-i.266262896.22965632574\nตัวกล่อง? กระบอก? จรวด? เสื้อ? (หรือจะเรียกว่าอะไรดี แนะนำผมหน่อย) ผมออกแบบเอง จะนำไปใช้กับลำโพงตัวต่อไป\n\n\nกล่องสำเร็จรูป\n\nth.aliexpress.com/item/32840880810.html\nหรือลองขอที่ร้านใน shopee shopee.co.th/aiyima.my.th\nให้เขาเพิ่มในร้านให้หน่อยก็คงได้เหมือนกัน\n\n\nผลวัด\n\nFR ชันขึ้นสม่ำเสมอ Off-Axis น่าจะดี\nFs ประมาณ 1.35k Hz\nแนะนำ crossover สูงกว่า 1.8k Hz\n\n\nDayton ND25FN-4\nหน้าร้าน\nwww.samdee-audio.com/product/544/dayton-audio-nd25fn-4-1-silk-dome-neodymium-tweeter-element-4-ohm\nDatasheet\ndaytonaudio.com/images/resources/275-053—dayton-audio-ND25FN-4-specifications.pdf\n\nหมายเหตุ ไม่น่าใช้กับเสื้อในรูป 11 ได้\n\n\nผลการวัด\n\nFR เรียบดีมาก +-2 db จากค่าเฉลี่ยเท่านั้น\nFs ประมาณ 1.3k Hz\nแนะนำ crossover สูงกว่า 1.7k Hz\n"},"Noise--and--THD":{"title":"Noise & THD","links":[],"tags":[],"content":"Total Harmonic Distortion THD\nIf everything works well, then your speaker THD curve will show nothing too abnormal and be at a low level. A good THD level to aim for as a speaker engineer is a distortion level of at least -40dB from your fundamental frequency, which equates to a distortion level of 1%.\nAs an audiophile, if you are concerned about THD and comparing speakers, then the lower the THD value the better.\nSecond-order or ‘even’ harmonics are even-numbered multiples of the fundamental frequencies and create a rich, pleasing sound. \nThird-order or ‘odd’ harmonics are odd-numbered multiples of the fundamental frequencies, which give the signal an edgier, more aggressive sound.\nTHD+N = Total Harmonic Distortion + Noise\nSINAD\nSINAD=20∗logTHD+N1​\n\n\n\n120dB (&gt;20 bits): Provably inaudible noise and distortion.\n\n\n109dB—119dB (18 bits—20 bits): Well beyond 16-bit (CD) resolution.\n96dB—108dB (16 bits—18 bits): Meets and exceeds 16-bit (CD) resolution.\n85dB—95dB (14.3 bits—16 bits): Does not meet 16-bit (CD) resolution.\n&lt;85dB (&lt;14.3 bits): Performance is below the minimum lenient threshold defined in this thread.\n\nTHD+N\n&lt;0.0001% Great\n0.0001% - 0.0004%  Well beyond 16-bit (CD) resolution\n0.0004% - 0.0015%  Meets and exceeds 16-bit (CD) resolution\n0.0015% - 0.0056%  Does not meet 16-bit (CD) resolution\n&gt; 0.0056% Bad\nThresholds\nLenient\nDynamic range, linearity: 96 dB\nTHD, IMD (intermodulation distortion): -66 dBFS / 0.05%\nNoise: -85 dBFS / 0.005%\nSINAD: 85 dB\nCrosstalk: -60 dBFS\nJitter: -110 dBFS, -100 dBFS around the main tone\nFrequency response: ±0.5 dB\nChannel balance: 1 dB\nOutput impedance: 2 ohms\nStrict\nDynamic range, linearity, SINAD: 120 dB\nTHD, IMD, noise, crosstalk, jitter: -120 dBFS / 0.0001%\nFrequency response, channel balance: ±0.1 dB\nOutput impedance: 0.16 ohms"},"Objective-Evaluation-of-Speaker":{"title":"Objective Evaluation of Speaker","links":["tags/frequencyrange"],"tags":["frequencyrange"],"content":"\nFrequency Response\n\n\n\nfrequencyrange\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRangeFrequency (Hz)Words (too high)(too low)Sub bass20 - 60rumblysloppy/loose baseLow60 - 200boomy tubby punchyLow-Mid200 - 700muddy boomy boxyMid700 - 3knasally honky hollowHigh-Mid3k - 7ktinny bitey airymuddyHigh7k - 20karticulate airy shimmery\n\nTransient Response\n\n\n\nDistortion\n\n\n\nOff-Axis Response\n\n\n\nMaximum SPL without distortion\n"},"Off-axis-Frequency-Response":{"title":"Off-axis Frequency Response","links":[],"tags":[],"content":"พอดีไปเจอ streamlit ซึ่งเป็น lib python น่าสนใจตัวนึง\nเลยลองเอาเขียนโปรแกรม Simulate การแทรกสอดของคลื่นเล่น ๆ ดู\nwave-interference.streamlit.app/\nดังนั้นไหน ๆ ก็ไหน ๆ ผมก็แยากมาชวนคุยเรื่อง\nการตอบสนองความถี่ในแนวนอกแกน\nหรือ off-axis frequency response\nปัจจัยที่มีผลต่อการตอบสนองความถี่นอกแกนที่ผมจะยกมาในวันนี้จะได้แก่\n\nความถี่เสียง กับ ขนาดของลำโพง\nจำนวนลำโพงและการแทรกสอดของเสียง\n\nความถี่เสียง กับ ขนาดของลำโพง\nทิศทางของเสียงกับจุดกำเนิด จะเป็นไปตามกฏข้อหนึ่งคือ\n\nถ้าเสียงมีความยาวคลื่นมากกว่าขนาดของจุดกำเนิดเสียงมาก ๆ เสียงจะกระจายไปรอบๆ ทุกทิศทุกทาง\nถ้าเสียงมีความยาวคลื่นน้อยกว่าความกว้างของหน้าลำโพง เสียงก็จะกระจายอยู่ด้านหน้าลำโพง หรือก็คือเรื่อง Baffle Step Compensation ซึ่งไม่ขอพูดถึงในวันนี้\nถ้าเสียงมีความยาวคลื่นน้อยกว่าจุดกำเนิดเสียง เสียงก็จะพุ่งไปข้างหน้า\n\nจากรูปกราฟรูปวงรี คุณจะเห็นความถี่ต่ำกระจายไปรอบๆ พอๆ กัน\nแต่เมือความถี่สูงขึ้น เสียงก็จะออกไปด้านข้างน้อยลงและพุ่งไปข้างหน้ามากขึ้น\nหรือถ้าดูจากกราฟการตอบสนองความถี่ ซึ่งจะมีการวัดที่ มุมหลัก มุม 10° 30° 60° 90°\nก็จะเห็นว่าลำโพงนี้ค่าตอบสนองความถี่ที่มุมหลัก มุม 10° 30° ที่ดี\nส่วนมุม 60° และ 90° คุณก็จะเห็นว่ายิ่งความถี่สูง เสียงก็จะยิ่งเบา นั่นคือเสียงความถี่สูง\nไม่ค่อยจะปลายมาที่มุมนี้ซักเท่าไหร่\nรูปจาก www.mcaraudio.com/blog/speaker-s-beaming-off-axis-response\n\nอีกตัวอย่างที่อยากจะยกมาจะเป็น spec ของดอก tweeter 2 ตัว\nดอกซ้ายมีขนาดของ dome อยู่ที่ 9/8 นิ้ว ดอกขวา มีขนาด dome ที่ 3/4 นิ้ว\nจากกราฟการตอบสนองความถี่จะเห็นว่าดอกซ้ายเสียงนอกมุมหลักจะตกลงเร็วกว่า\n\nเรื่องต่อมาที่มีผลต่อ off-axis frequency response ก็คือจำนวนลำโพง\nลำโพงนี้จะต้องมี phase เดียวกันด้วยนะ ก็คืออยู่ใน channel เดียวกัน\nถ้าอยู่ L ดอกนึง R ดอกนึงอันนี้ไม่เกี่ยว\nแต่ถ้าพูดถึงดอก mid กับ tweeter อันนี้ก็นับด้วย แต่ว่าจะเกิดในช่วงสั้น\nตอนตัด crossover เท่านั้น\nในภาพ Polk และ ELAC เป็น center channel วางดอก mid ไว้ทั้งซ้ายและขวา\nเพื่อต้องการให้เสียงทั้งสองฝั่งสมดุลกัน\nด้านขวา HK soundstick วาง full range เป็น array แนวตั้ง\n\nคำถามแรกทำไมถึงต้องใช้ลำโพงหลายดอก?\nในกรณีลำโพง center ก็เข้าใจได้ว่าอยากให้เสียงกระจายไปด้านซ้ายและด้านขวาพอๆ กัน\nแต่อยากกรณี Polk ทำไมต้องใช้ 6 ตัว\nผมจะยกตัวอย่างตัวหนึ่ง\nสมมติว่าผมต้องการทำลำโพงโดยใช้ดอกสองตัวในภาพนี้\nจะเห็นว่าดอก woofer ผมจะมี SPL อยู่ที่ 86.1dB\nและ tweeter ribbon มี SPL ที่ 92.5 dB ซึ่งต่างกันอยู่ถึง 6 dB เลย\nถ้าผมไม่อยากอนุกรม R หรือ L-pad ที่วงจร crossover ฝั่ง tweeter\nผมสามารถต่อขนาน woofer ขึ้นมาอีกดอกนึงเพื่อ boost เสียงขึ้นมาอีก 6 dB\nทำให้ SPL ของ woofer และ tweeter พอ ๆ กันนั่นเอง\n\nต่อมามาดู simulation ของ Polk ES35 กันดีกว่า\n(อีกที simulator สามารถไปกดเล่น ๆ ได้ที่ wave-interference.streamlit.app/)\nผมสมมติว่าลำโพงแต่ละดอกมีจุดศูนย์กลางอยู่ห่างกัน 10 ซม.\nและ crossover ประมาณ 2000 Hz\nในกราฟที่ simulator ออกมา ส่วนที่สีเหลืองกับน้ำเงินเข้มๆ คือส่วนที่ ได้ยินเสียงชัดเจน\nส่วนที่สีมัวๆ จางๆ คือส่วนที่ได้ยินเสียงไม่ค่อยดีเท่าไหร่\nและ หน่วยตัวเลขในกราฟเป็นหน่วย ซม. ตำแหน่ง 100 ในแกน y คือกึ่งกลางลำโพง\nคุณจะเห็นว่าเสียงของลำโพงนี้จะพุ่งไปข้างหน้าแคบๆ\nก็จะทพให้พอเดาได้ว่าเขาคงออกแบบลำโพงเพื่อใช้กับระบบ home theater\nจอใหญ่ ๆ มากกว่า 100 นิ้ว ที่ผู้ชมต้องนั่งห่างๆ\nจำนวนดอกต้องเยอะเพราะว่าต้องเร่งเสียงสู้กับลำโพง L R ซึ่งขนาดใหญ่กว่า\nลำโพง center ที่อยู่ใต้จอไม่ค่อยมีที่จะวาง\n\nส่วน HK จะไม่เจอปัญหาเรื่องนี้เท่าไหร่เพราะลำโพงวางตัวตามแนวตั้ง\nซึ่งก็จะไม่ค่อยมีการแทรกสอดแนวนอนเท่าไหร่ แต่จะมีตามแนวตั้งแทน\nกล่าวคือ ถ้าคุณตั้งลำโพงนี้ไว้บนโต๊ะ แล้วเดินไปเดินมา เสียงของลำโพงจะไม่เปลี่ยนมาก\nแต่ถ้าคุณนอนฟังกับพื้น อันนี้คุณจะเริ่มได้ยินเสียงที่เป็นปัญหาแล้ว\n\nนอกจากนี้คุณยังสามารถเห็นการแทรกสอดแนวนี้ได้ในลำโพงเวที ไม่ว่าจะเป็น Array Speaker หรือ Subwoofer Array แลกมุมการกระจายของลำโพงกับ พลังเสียงที่จะไปได้ไกลขึ้น\nซึ่งตัวนี้ก็จะมี software มืออาชีพที่ใช้เฉพาะ เช่น SUBMAP www.gaudiosolutions.com/en/producto/submap/ (ผมยังไม่เคยลองเล่น)\n\nสุดท้ายนี้ผมคงอยากลองชวนคุย และถามทุกท่านว่าชอบลำโพงแบบไหนกันครับ\nตู้ลำโพง 3 ways ที่มีลำโพงชนิดละดอกเท่านั้นเพื่อให้ได้ยินเสียงเท่ากันไม่ว่าจะยืนอยู่ในตำแหน่งไหนของห้องก็ตาม\nหรือจะทำ MTM เพื่อจะใช้ดอกลำโพงที่ชอบ และไม่ต้องอนุกรม R ใน network ให้เสียงเสียคุณภาพ\nหรือจะใส่ดอกไปเลยให้เต็มที่ เพื่อจะได้ยินเสียงลำโพงที่อยู่ในศาลากลางทุ่งห่างไป 100 เมตร : D\n"},"People":{"title":"People","links":[],"tags":[],"content":"\nAnthony Grimani\nGR - Research\n\n"},"README":{"title":"README","links":[],"tags":[],"content":"Loudspeaker Design Note\nKnowledge of loudspeaker design I’ve collected."},"Research":{"title":"Research","links":[],"tags":[],"content":"www.genelec.com/en/publications"},"Results/2.0-MK-2":{"title":"2.0-MK-2","links":[],"tags":[],"content":"\nFinal Result\nBefore applied filter \nAfter applied filter \nBefore filter \nAfter filter \nNote\n\nBass can be boosted by DSP in lower speaker volume.\nThere is no fix for 3k-4k and 9k harmonic which is characteristic of the paper cone speaker.\n\nNext improvement\n\nmake 2 ways speaker may be ribbon tweaker.\n\n"},"Results/2.0-MK-3-2-Ways-2L":{"title":"2.0-MK-3-2 Ways 2L","links":[],"tags":[],"content":"\n\n\n\n\n\nFinal Result\n\n\n\n\nNotes\n\nThe cement formula that used in these speaker had mixed a lot off water, but still rigid enough for application. This is interesting result, more work-ability low strange but enough for the speakers.\n\nImprovements\n\nForget to measure both speaker again after add more offset to the woofer. So, the phase of final model is a little difference from the prototype, causing phase at the crossover point is a bit off.\nToo much impedance on the high end, L-Pad will be required next time.\nNext time try to calibrate Voltage and fix measurement position and make graphs more standard.\n"},"Results/2.0-MK-4":{"title":"2.0-MK-4","links":[],"tags":[],"content":"\nลำโพง\nFrequency: 60 - 20000 Hz\nImpedance: 8 ohm\nSPL: ~74 dB 1W 1m\nPower rating: 70W rms\n\nDrivers\n\nDayton DSA115-8\nDayton ND25FN-4\n\nEnclosure\n\nVolume: 4 L\nPort frequency: 65 Hz\n3D printing + cement\n\n\n\nCrossover\n\n\n3rd order high pass filter + L-pad\n3rd order low pass filter + Zobel\n\n\n\nMeasurement\n\n\n\nปัญหาที่เจอ 1\n\nถ้าใครจำกันได้ ผมเคยแชร์เรื่อง port noise กับ standing wave ไป\nสุดท้ายผมแก้ด้วยการใส่ rock wool ลงไป จะเห็นว่าเสียงพอร์ตในช่วงสีเหลืองหายไปมาก ๆ\nแต่อย่างไรยอดที่ 500 Hz ก็ยังอยู่ เท่าที่ผมเช็คดูอีกทีเจ้า 500 Hz นี้มันไปตรงกับ first resonance ของความยาวพอร์ต 31 ซม. พอดีซึ่งก็คิดว่าน่าจะเกิดจากส่วนนี้นี่แหละ และเนื่องจากพอร์ตนี้ถูกเสริมความแข็งด้วยปูน ทำให้พลังงานนั้นไม่ค่อยจะสูญเสียภายในพอร์ต ยอด 500 จึงออกมาแบบเต็ม ๆ\n\n5. ปัญหาที่เจอ 2\nยอด distortion ที่ 320 Hz 2% เป็นเสียงสั่น ๆ ที่ถ้าตั้งใจฟังก็จะได้ยินออกมาเลย\nหาอยู่ซักพัก ถึงจะเจอว่าเกิดจากเจ้าจรวดบนหัวนี้เอง! ไม่น่าหละถึงไม่ค่อยมีใครทำหน้าตาแบบนี้กัน\nถ้าเอามือจับจะรู้สึดสั่น ๆ เลย\n\n\nแก้ปัญหาที่ 2\n\nวิธีแก้ ผมใช้เทปสองตัวในการแก้\nด้านซ้ายเป็นเทป 2 หน้า 3M สำหรับติดภายในรถยนต์ออกแบบมาสำหรับลดเสียงรบกวน ผทเอามาแปะระหว่างตู้กับตัวจรวด\nด้านขวาเป็นเทปแปะท่อหรือถังสำหรับกันน้ำรั่ว โดยส่วนประกอบของมันด้านหนึ่งจะเป็นฟรอยมีเนียม อีกด้านนึงจะเป็นกาวนิ่ม ๆ สามารถใช้ลดการสันสะเทือนได้\nจริง ๆ ตัวนี้ถ้าใช้เป็น Noise-Cancelling Tape ของ 3M เลยน่าจะดีกว่า แต่หาไม่ได้\nแต่ยังไงผลลัพธ์ออกมาก็นับว่าน่าพอใจเลยทีเดียว\n\n\noff-axis response\n\nอันนี้ผมลองวัด off-axis response ดูได้ผลออกมาน่าสนใจเหมือนกัน\nข้อแรก ที่ 500 Hz ตั้งแต่มุม 70 องศาเป็นต้นมาจะเห็นหลุมลึกขึ้นเรื่อย ๆ ซึ่งก็รู้ได้ทันทีว่ามาจาก port noise นั่นแหละ\nข้อสอง ไม่มีเส้นไหนตัดกันที่จุด crossover เลย แสดงว่า phase ของ crossover ดีมาก\nข้อสาม ดอกเสียงสูงตกลงมาเร็วมาก ซึ่งอาจจะเป็นเพราะดอกแหลมมีขนาดค่อนข้างใหญ่ แต่ก็ตรงกับ datasheet ของ ND25FN-4 แหละ\n\n\noff-axis response ต่อ\n\nลองเอาผลวัดมาเปรียบเทียบกับยี่ห้ออื่น\nด้านล่างเป็นผลการวัดด้วย Klippel ซึ่งแน่นอนว่าจะได้รายละเอียดสูงมาก ๆ\nตัวด้านบนที่วัดเองก็จะเห็นเสียงฟุ้ง ๆ มาด้านหลังด้วย สีเขียว ๆ เหลือง ๆ นั่นแหละ ซึ่งไม่รู้ว่าเป็นแบบนี้เพราะอะไร (แต่ไม่ใช่เสียงสะท้อนจากกำแพงห้องเพราะปรับ IR window ไปแล้ว)\nส่วนสีส้ม ๆ ที่ 500Hz ด้านหลังตู้นี่ก็ port noise เจ้าเดิม\n\n\nฟังเสียงกันดีกว่า\n\nทอสอบฟังเสียง\nJoe Hisaishi - The Legend of Ashitaka from Princess Mononoke youtu.be/LiLhq3iDWhI\nAoi Teshima - Wine To Antipasto youtu.be/G9vczmZzg7M\nPolyphia - ABC - youtu.be/sSe0YrdwFnE\nGood kid - Mimi’s Delivery service - youtu.be/BLCuJR2rn_c\nLe Sserafim - Perfect night  youtu.be/7i0rENM-1t4\nข้อมูลลำโพง\nwww.facebook.com/groups/791461357947350/permalink/1928739717552836/\nวิธีการอัดเสียง\n\nmix เสียงแบบ stereo คือ เปิดเสียงจากลำโพงที่ละข้างแล้วรวมกันทีหลัง\nอัดด้วยไมค์ RTA\nวางลำโพงและไมค์ที่พื้น\n\nอันนี้มีขี้โกงนิดหน่อย อัดเสียงลำโพงซ้ายขวาแยกกัน แล้วเอามารวมกันทีหลัง ซึ่งก็จะได้เสียง stereo\nถ้าใครอยากฟังลำโพงข้างเดียวก็ใช้วิธีปิดลำโพงไปข้างนึงได้เลย 555\nแล้วก็มารู้ที่หลังว่าลืม fix bitrate ทำให้ phase บางช่วงอาจจะตี ๆ กันบ้าง\nถ้ามีเวลาอาจจะทำให้ใหม่ทีหลัง\n"},"Results/2.1-MK-1":{"title":"2.1-MK-1","links":["Thiele-Small-Parameters"],"tags":[],"content":"\nSourcing\n\nFull-range  speaker AIYIMA 3 Inches Full Range Speaker - Aliexpress\n\n\n\nSub-woofer speaker AIYIMA 4 Inches Subwoofer\n\n\n\n2.1 Amp board HIFIDIY LIVE speakers 2.1 Subwoofer Speaker Amplifier Board TPA3118 Audio 30W*2 +60W Sub AMP With Independent 2.0 Output - AliExpress\n\n\nS Parameters\nFull-range\nRevc = 7.2 Ohm\nFs = 132.505 Hz\nSd = 3.215 mM?\nMd = 10.000g\nBL = 2.712\nQms = 4.810\nQes = 1.659\nQts = 1.233\nNo = 0.141%\nSPLo = 83.5 dB\nVas = 1.040 l\nCms = .708814 mm/N\nKrm = 17.136 mOhm\nErm  =  0.494\nMms = 2.035 g\nMmd = 1.031 mKg\nKxm = 186.520 mH\nExm = 0.212\nSub-woofer\n\nTS Parameters file\nRoom EQ V5.20.13\nDated: Jul 23, 2023 11:23:25 PM\nFrom measurement sub Jul 23\nZmin 3.58 ohm\nfmin 249 Hz\nf3 633 Hz\nLe(f3) 0.717 mH\nMotional impedance parameters\nR0 18.47 ohm\nCMES 457.3 uF\nL0 9.663 mH\nbeta 0.0002\nomega0 705.6\nBlocked impedance parameters\nRDC 3.50 ohm\ndR -0.39 ohm\nRe 3.11 ohm\nLeb 0.0 uH\nLe 1.319 mH\nRss 627.9 ohm\nKe 0.1450 S-H\nThiele-Small parameters\nfs 75.7 Hz\nQms 4.014\nQes 0.676\nQts 0.578\nFts 130.9\nMms 11.48 g\nCms 0.385 mm/N\nRms 1.360 kg/s\nVas 1.52 litres\nBl 5.010 Tm\nEta 0.09 %\nLp (1W/1m) 81.78 dB\nDd 8.20 cm\nSd 52.8 cm^2\nAdded mass 1 measurement:\nAdded mass 1 10.000 g\nAdded mass 2 measurement:\nAdded mass 2 5.000 g\nAir temperature 26.0 C\nAir pressure 1013.25 mB\nAir density 1.1799 kg/m^3\nSpeed of sound 346.7 m/s"},"Results/2.1-MK-5":{"title":"2.1-MK-5","links":[],"tags":[],"content":"Making MK-5 log EP 1\nโปรเจคลำโพงใหม่เสร็จเสียที\nจุดมุ่งหมายคือทำลำโพง hi-end ให้เล็กที่สุดเท่าที่ทำได้เพื่อมาวางไว้บนโต๊ะคอมพิวเตอร์ ดังนั้น\n\nความดังไม่ใช่ปัญหา ไม่ต้องดังมาก\nเนื่องจากตัวเล็ก ต้องแยกซัพเพื่อจะเล่นความถี่ต่ำ\nซัพที่ใช้จะเป็น sealed box หรือตู้ปิด เพื่อให้ได้ transient ที่ดีที่สุด\nใช้ DSP ช่วยบูสย่านต่ำ\n\nตอนนี้จะเป็นอุปกรณ์ที่เลือก และค่าดิบ ๆ ที่วัดได้ก่อนทำคอสโอเวอร์\nถ้าใครสนใจอยากได้ไฟล์ดิบไปลองออกแบบเล่น ๆ ก็คอมเมนต์บอกผมได้นะ\nตอนต่อไปเดี๋ยวผมจะแปะลิงค์ให้\n\nลำโพงซ้าย ขวา\nเป็นลำโพงเล็ก ๆ ขนาดประมาณ 14 x 8 x 13 ซม. ออกแบบความถี่พอร์ตไว้ที่ประมาณ 95Hz\nสุดท้ายทำออกมาใส่ damping เยอะไปหน่อยลงไปลึกถึง 85Hz เลย\n\n\n\nดอกลำโพงวูฟเฟอร์\nดอกวูฟเฟอร์ที่ใช้ในงานนี้คือ SEAS OR004-04 FL6RBND/S เป็นลำโพง 2 นิ้ว เล่นความถี่ได้ดีตั้งแต่ประมาณ 150 - 5000 Hz แต่ก็มีข้อเสียงอย่างนึง\n\n\n\nข้อเสีย\nข้อเสียของดอกนี้เป็นข้อเสียเดียวกับดอกกรวยอลูมีเนียม คือ มันสั่น\nถ้าสังเกตจากกราฟ SPL จะเห็นยอดที่ผมวงกลมไว้ที่ประมาณ 1600Hz หรือถ้าดูจากกราฟจากผู้ผลิตก็จะเห็นยอกนี้เช่นกัน\n\nยอกนี้มีผลอย่างไร? ถ้ามาดูที่กราฟน้ำตก หรือ spectral decay ด้านล่าง จะเห็นคลื่นออกมาตรงช่วงแถว ๆ 1600Hz พอดี การที่มีคลื่นออกมาแบบนี้จะทำให้ผู้ฟัง ฟังไปนาน ๆ แล้วหูล้า และยิ่งอยู่ในช่วง 1k - 4k Hz ที่เป็นช่วงที่หูคนจะดีที่สุดด้วยแล้ว จะทำให้เกิดหูล้าเร็วยิ่งขึ้น หรือบางคนถ้าฟังเสียงไปนาน ๆ อาจจะเกิดอาการปวดหูได้เลย\nทางแก้ที่ดีที่สุดคือใช้คอสโอเวอร์ตัดมันออกไปเลย แต่ผมทำไม่ได้เพราะว่า …\n\n\nลำโพงทวิสเตอร์\n\nทวิสเตอร์ AIYIMA ตัวนี้เล่นความถี่ได้ดีตั้งแต่ 2k ขึ้นไป ทำให้การตัดคอสโอเวอร์นั้นจะต้องทำที่ 2k Hz ขึ้นไปด้วย\n\n\nข้อดีของทวิสเตอร์ตัวนี้ดีอย่างนึงคือความเพี้ยนนั้นน้อยมาก (แต่ทวิสเตอร์ที่เพี้ยนน้อยระดับนี้ก็หาได้ไม่ยากเท่าไหร่แหละ)\n\n\n\nต่อมาจะเป็นซัฟวูฟเฟอร์\nขนาดประมาณ 20 x 20 x 25 ซม. โบกด้วยปูนตามสไตล์ของผมทำให้สุดท้ายหนักเกือบ 9 กก.\nซัฟวูฟเฟอร์นี้จะเป็นแบบ Active ขับซัฟและลำโพงซ้าย-ขวา และเป็น DAC ในตัว สามารถต่อกับคอมพิวเตอร์ได้เลย\n\n\n\nดอกซัฟวูฟเฟอร์\nดอกซัฟวูฟเฟอร์ที่ใช้เป็นของ Tang Band ที่ขึ้นชื่อว่าให้ Xmax มาเยอะมาก ทำให้ขับได้ลึก ถึงแม้จะมีขนาดแค่ 5 นิ้วครึ่งเท่านั้น\n\n\n\nDAC Amp\nเลือกใช้ Up2Stream Plate Amp 2.1 ของ Alylic เป็น DAC และ DSP ในตัวสามารถตั้ง EQ ได้เลย\nชิปของแอมป์คิดว่าน่าจะเป็น TPA3116D2 ส่วนชิป DAC นี่เขาปิดไว้ ถ้าอยากรู้ว่าเป็นตัวไหนน่าจะต้องขุดกันหน่อย\nคาแรคเตอร์ของ plate ตัวนี้คือเหมือนกับ TPA3116D2 ของ Alylic ตัวอื่น ๆ ค่าความเพี้ยนที่วัดได้ออกมาจากเสียงนี่เหมือนกับตัวที่ผมเคยวัดมาก่อนเลย\nwww.facebook.com/groups/791461357947350/permalink/1878204199273055/\n\n\n\nSubwoofer Frequency Response\nวัดด้วยวิธี near field measurement\nยังไม่ได้ปรับ DSP\nจุด crossover อยู่ที่ 110 Hz\nf3 อยู่ที่ ประมาณ 60 Hz\n\nจุดที่น่าสนใจ\nความดังที่ 60Hz อยู่ที่ 99dB (อย่าสนใจว่าดังเกิดไปเพราะได้จากการวัด near field)\nความดังที่ 30Hz อยู่ที่ 87dB\nจะเห็นว่าลดลงไป -12dB ต่อ octave ตามทฤษฎี\n\n\nMaking MK-5 log EP2\nEP1 www.facebook.com/groups/791461357947350/permalink/1984428265317314/\nตอนนี้จะเป็นการทำ crossover และปรับ Eq\n\nเริ่มจาก crossover ก่อนเลย\nตัวนี้ยอมรับว่าผมมีปัญหากับการจัดการเฟส ตอนแรกอยากให้ตัดตั้งแต่ 2k นิด ๆ แต่เฟสมันไม่ตรงกันซักที จะใช้ serial notch เข้าไปปรับเฟสก็จะแพงไปหน่อย เลยเลือกไป crossover ที่ 5k Hz แทน แต่เนื่องจากตัดที่ความถี่สูงมาก มันก็จะมีปัญหาตามมาเช่นกันซึ่งเดี๋ยวจะมาพูดถึงอีกที\n\n\n\nการวาง crossover\nเทคนิคการออกแบบ crossover ที่ผมชิบใช้ คือเอา component ต่าง ๆ ไปเรียงบนกระดาษแข็งก่อน แล้วค่อยนำไปออกแบบแผ่นจริง ซึ่งบางคนอาจจะสะดวกใช้ไม้ ส่วนผมเนื่องจากไม่มีทั้งไม้และอุปกรณ์เลยใช้ 3d printing แทน\nการวางขดลวดตัวนำใกล้ ๆ กันจะต้องระวังทิศทางการวางพอสมควร เพื่อไม่ให้สัญญาณมันไปรบกวนกัน\n\n\n\nวัดการตอบสนองความถี่ (Frequency Response, FR) หลังทำ crossover\nผลการวัดออกมาใกล้เคียงที่ออกแบบไว้นับว่าน่าพอใจ\n\n\n\nวัดการตอบสนองความถี่ (Frequency Response, FR) เมื่อใส่หน้ากาก\nผ้าปิดหน้าลำโพงที่ดีจะต้องไม่ทำให้ความถี่เปลี่ยนแปลงไปมาก อย่างของผมหน้ากากนี้จะลดความดังเสียงของความถี่ตั้งแต่ 10k Hz ขึ้นไปลงไประมาณ 1 dB\n\n\n\nคราวนี้มาถึงปัญหาที่เกิดขึ้นจากการตัด crossover สูง ๆ\nรูปนี้เป็นการวัด FR นอกแกนหลักตามแนวตั้ง (vertical off-axis frequency response)\n\nจะเห็นว่าความกว้างของความถี่ 5k Hz นั้นแคบมาก ประมาณแค่ 30 องศาเท่านั้นเอง ซึ่งก็เกิดจากการแทรกสอดของเสียงระหว่างดอกลำโพงทั้งสองดอกที่ความถี่ crossover\nความถี่ 5k นั้นจะมีความยาวคลื่นสั้นเพียง 6 ซม. เท่านั้น ซึ่งพอ ๆ กับระยะห่างของลำโพงทั้งสองดอก ซึ่งก็จะเห็นว่า FR ที่ 60 องศา นั้นหายไปอย่างชัดเจนเลยทีเดียว\nแต่เนื่องจากมันเป็นการตอบสนองความถี่ตามแนวตั้ง และผมก็ใช้ลำโพงนี้เป็นลำโพงตั้งโต๊ะเปิดเสียงดังไม่เกิน 75dB ปัญหานี้เลยไม่ต้องแก้ไขก็ได้ หรืออย่างมาก ก็แค่หาอะไรมาหนุนให้ลำโพงเชิดขึ้นหน่อย เล็งให้เสียง on-axis เข้าหูไปเลย\n\n\nมาดูอีกปัญหานึงที่เคยบอกไว้ใน Ep ที่แล้ว\nนั่นคือลำโพงที่สั่นตรงประมาณ 1.6k Hz ซึ่งผมจะลองแก้ด้วย Eq ดูก่อน ซึ่งถ้าเสียงมันออกมาดูดีขึ้นพอรับได้ก็โอเค แต่ถ้าไม่สำเร็จก็คงจะต้องยอมปรับ Eq ให้มีหลุมที่ 1.6k Hz เล็กน้อย\n\n\n\nการ Eq ผมจะใช้ auto Eq ของ REW (โปรแกรมที่ทั้งเทพ ทั้งฟรี และทำได้ทุกอย่าง)\nเบื่องต้นผมจะตัดเฉพาะ 1.6k Hz ออกไปก่อน\n\n\n\nผมจากการตัด 1.6k Hz ออกไปหน่อย จะเห็นว่าการสะสมพลังงานที่ 1.6k Hz หายไปเยอะมาก\n\n\n\nลองเปิด Eq ตำแหน่งอื่น ๆ ให้กราฟออกมาเรียบ\n\n\n\nกราฟ FR ออกมาเรียบสะใจมาก การสะสมพลังงานในกราฟ waterfall ก็น้อยลง นับว่าดีเลยทีเดียว\n\n\n\nกราฟความเพี้ยน\nส่วนใหญ่ต่ำกว่า 1% มีแท่ง 2% ขึ้นมาแท่งนึง\n\n\n\nGroup Delay\nตามนิยามหนึ่งของ group delay คือ ค่าเฟสของการตอบสนองความถี่ที่เปลี่ยนไป หรือ ความชันของกราฟเฟสนั่นแหละ (ซึ่งกราฟเฟสนี้จะต้องเป็น  minimum phase ด้วยนะ)\n\nดังนั้นสำหรับคนที่ชอบดูว่าเฟสของ FR เรียบไหม ถ้าโปรแกรมที่ใช้สามารถดูค่า GD ได้ ผมแนะนำให้ดูตัวนี้จะดีกว่า ซึ่งก็จะมีงานวิจัยหลาย ๆ ตัวเอาค่านี้มาว้เคราะห์ด้วย แต่สรุปง่าย ๆ คือตั้งแต่ความถี่ 100 Hz ขึ้นไปถ้าค่านี้ไม่เกิน 4ms นับว่าใช้ได้\n\n\nMaking MK-5 log EP 3\nและแล้วก็ถึงเวลาแห่งความจริง!!\nไม่ว่าจะออกแบบลำโพงมาดีขนาดไหนก็ตามเมื่อเอามาติดตั้งในห้องแล้ว ถ้าห้องนั้นไม่ได้ออกแบบอะคูสติกมาดีพอ ก็สามารถคาดเดาผลลัพท์สุดท้ายได้ในคำเดียวว่า\n\n”ยับ”\n\nดู EP1 - www.facebook.com/groups/791461357947350/permalink/1984428265317314/\nอ่าน EP2 - www.facebook.com/groups/791461357947350/permalink/1984991758594298/\nตอนนี้ผมจะมาแชร์การติดตั้งลำโพง MK5 ของผม บนโต๊ะคอมพิวเตอร์ที่ผมใช้ทำงานอยู่ทุกวัน\n\nอันดับแรกผมเอารูปห้องและโต๊ะทำงานให้ดูก่อน\nขนาดของห้องเนื่องจากเป็นห้องตึกแถวเต็มชั้น จึงมีความยาวเกือบ ๆ 1280 ซม.\nกว่างประมาณ 206 ซม. และสูง 261 ซม. มีกันห้องให้บันได ทำให้ห้องไม่ได้เป็นสี่เหลี่ยมผื่นผ้า 100%\n\n\n\nจุดวางลำโพงซ้าย-ขวา\nนี่เป็นความเลวร้ายที่ 1 ของโต๊ะทำงานของผม เนื่องจากเฟอร์นิเจอร์มันถูกออกแบบบิ้วอินมากว่า 20 ปีละที่วางจอคอมพิวเตอร์เลยเป็นช่องเล็ก ๆ แบบนี้ เสียงเข้าไปก้องดีเชียวเลยหละ\n\nเหตุหนึ่งที่ต้องการลำโพงเล็ก ๆ ก็เพราะอยากเปลี่ยนจอจาก 24 นิ้ว เป็น 27 นิ้วด้วยแหละ ขนาดคับตู้แน่นอน\n\n\nจุดวางซัฟวูฟเฟอร์\n\nแน่นนอนว่าต้องลงไปไว้ใต้เ๊ต๊ะคอม หันมุมที่สายจะเกะกะน้อยที่สุด และขาไม่ไปเตะดอกลำโพงด้วย\nทำ spacer เว้นระยะไม่ให้ดอกลำโพงชนผนังโต๊ะเป็นอันใช้ได้\n\n\nผลการวัดเสียงซ้าย-ขวา\n\nยับอย่างที่คาด และเป็นหลุมหนักมาก ๆ ที่ประมาณ 150-220 Hz ซึ่งมันคืออะไรเดี๋ยวว่ากันต่อ\n\n\nเช็คเฟสซัพนิดหน่อย\nก็จะเห็นว่าเฟสของซัพที่จุด crossover ที่ 110 Hz นั้นไม่มีปัญหา ช่วง 150-220 Hz ซัพก็ไม่ได้ทำงานแล้วด้วย\n\n\n\nRoom Mode\nRoom mode เป็นการสั่นพ้องที่เกิดจากขนาดของห้อง ทำให้บางตำแหน่งมีความถี่ หนึ่ง ๆ ที่ดังขึ้นหรือเบาลง ซึ่งเมื่อผมเอาขนาดห้องของผมไปใส่แล้วก็ได้ผลออกมาว่ามีความถี่สั่นพ้องในช่วงที่มีปัญหาถึง 60 ความถี่ ซึ่งก็พอจะเป็นต้นเหตุการหายไปของ 150-220 Hz ได้\n\nวิธีแก้ก็คือไปหาแผ่นอะคูสติกแบบหนา ๆ หน่อยมาติดซับเสียง ซึ่งไว้วันหลังผมอาจจะมีโปรเจคทำแผ่นอะคูสเองแล้วเอามาวิธีทำแชร์ครับ\nส่วนใครสนใจอย่าลองเล่นโปรแกรมนี้ดูสามารถใช้ได้ที่\namcoustics.com/tools/amroc%2018041%20-%20Music\n\n\nความถี่อื่น ๆ\nถ้าใครสังเกตคงจะเห็นว่ากราฟที่ผมใช้ในตอนนี้จะแตกต่างจากกราฟในตอนก่อน ๆ ที่ผมเคยทำมา\nในตอนเก่า ๆ ผมจะใช้เทคนิควัด near field + far field และกำหนด IR window เพื่อตัดเสียงส่วนที่สะท้อนจากห้องออกให้หมด ส่วนในตอนนี้ผมจะใช้ 1/6 smoothing เพื่อให้ได้มีบันทึกเสียงที่เกิดจากการ สั่น หรือ สะท้อน ภายในห้องมาด้วย\n\nกราฟนี้จะเห็นว่าจะมีความถี่สูงบ้างต่ำบ้างเป็นคลื่น ๆ สิ่งที่ผมจะทำต่อไป แน่นอนคือ EQ มัน\nแต่เวลา EQ คราวนี้จะไม่ทำให้มันเรียบ เพราะจะต้องมีการชดเชยเสียงที่เกิดจาก Early reflection เข้าไปด้วย ซึ่งวิธีชดเชยนั้นผมยังไม่แน่ใจ ยังเป็นเรื่องที่ผมต้องศึกษาเพื่มเติมต่อไป\n\n\nEQ ด้วย REW\nเซตค่า Early reflection ให้เรียบร้อยตั้ง target และก็กด match response to target โปรแกรมก็จะคำนวณค่าฟิวเตอร์ให้เรียบร้อย\n\nสังเกตโปรแกรมจะไม่ EQ ช่วงที่ GD ต่ำ ๆ ให้ เพราะว่ามันแก้ด้วย EQ ไม่ได้\n\n\nค่าฟิวเตอร์ที่ได้\n\n\n\nทดลองวัดโดยใช้ฟิวเตอร์\n\n\n\nทำซ้ำกับอีกข้าง\n\nเมื่อเสร็จแล้วก็ export filter settings as text ทั้งสองข้างออกมา\n\n\n\nหน้าตาของไฟล์ฟิวเตอร์\n\n\n\nใส่ฟิวเตอร์ลงในโปรแกรม Equalizer APO\n\n\nเป็นอันเสร็จสิ้น\n\n\nอีกส่วนหนึ่งที่น่าสนใจคือกราฟ waterfall\n\nwaterfall เดิมที่ผมใช้จะใช้ดูการสะสมพลังงานที่เกิดขึ้นจากลำโพง ซึ่งก็จะดูที่ระยะเวลาสั่น ๆ ไม่เกิน 4ms\nส่วนรูปนี้เป็นการสะสมพลังงานภายในห้องซึ่งจะมีหลักการประมาณว่า ห้องที่ดี (ระดับ home theater) ความดังจะต้องลดลง 60dB ภายใน 400ms\nซึ่งกราฟของผมเนื่องจากอัดที่ความดังมากกว่าที่ผมฟังปกติเล็กน้อย ซึ่งก็อยู่ประมาณ 70dB (ไม่ได้ calibrate SPL มาหนะขออภัย) ซึงจริง ๆ ต้องดูลงไปถึง 10 dB เลย แต่โต๊ะผมมันมี noise มาจากพัดลม PC ที่ตั้งอยู่ข้าง ๆ ซึ่งดังไปถึง ประมาณ 30dB ผมเลยเซตขอบล่างอยู่ที่ 30dB ซึ่งกราฟที่ออกมาก็ดูดีกว่าที่คิด\n\n\nลองฟังเสียง\n\nเหมือนเดิมถ้าผมโพสเพลงลงมาเลยผมโดนแบนแน่ ๆ\nดังนั้นผมขอโยนลงไปใน Google Drive ละกัน สามารถเปิดฟังได้เลย หรือใครจะสะดวกจะ download ลงมาก่อนก็แล้วแต่\nเพลงที่ใช้วันนี้เป็นเพลง No Promises to Keep ของ LOREN ALLRED\nต้นฉบับ www.youtube.com/watch\nไฟล์เสียง\ndrive.google.com/file/d/1ho7rKuvIVzr4SRGWK1_f3HDNCAt6h0E3/view\nถ้าใครได้ยินเสียง noise ดัง ๆ นั่นคือเสียงฟัดลม PC ผมเอง : P\n"},"Room-Mode":{"title":"Room Mode","links":[],"tags":[],"content":"Lower frequency below 200 Hz have very long length\nwind speed (vw​): 343m/s\nLength of 200 Hz\n200Hz=200343​=1.715m\n20Hz100Hz200Hz5000Hz20000Hz​→→→→→​17.15m3.43m1.715m6.86cm1.715cm​\nAnother thing about wavelength, a wave will pass through an object smaller than its length without losing power.\nFor example, a sound of 200 Hz can pass through a stone with diameter of 100 cm, or sound of bass can pass through wall.\nFundamental frequency\nevery dimension of the room will have it own fundamental frequency\nFr​=L343​\nmode 1 =Fr​×0.5\nmode 2 =Fr​×1\nmode 3 =Fr​×1.5\nmode 4 =Fr​×2\ndifference mode will occur in difference positions in along the length of the room\nmode 1 will occur in corners of the room.\nmode 2 will occur in the center\nSBIR - Sound Boundary Interference Response\nThis very close to room mode. The difference is when your room get SBIR and you moving around the room the SPL will stay the same while room mode SPL will change depended on when you are.\nSo SPL of SBIR will stay the same in every position in the room. It will only change when you move the source of the sound."},"Room-Treatment":{"title":"Room Treatment","links":[],"tags":[],"content":"First thing first, overly room treatment is bad.\nYour brain want to hear some reflection.\n(Think of first generation noise canceling headphone)\nYou don’t want to live in an anechoic chamber\n15 - 20% Absorption surface (absolute not more than 20%)\n\nDistributed evenly\nLower reflected energy\n\n15 - 20% Diffusion surface\n\nInterleaved with absorption\n2D in front of room, 3D in back → make room feel bigger\nImproves spaciousness\n\nInclude ceiling\n\nvertical reflection narrow the sound\n\nBase absorption\n\nBass reflection reduce dynamics\n\n5 ms delay law\nThe brain will treat the same sound delayed by 5ms as a reflection and cut it off from your perception.\nAbsorber\n\nNeed thickness, the thinker it is the lower frequency it can absorb\n\n1000Hz434m/s​=43.4cm ; 1000 Hz need 2.5 cm ← bad\n500Hz434m/s​=86.8cm ; 500 Hz need 5 cm ← best compromise\n250Hz434m/s​=173.6cm; 250 Hz need 10 cm ← best absorption\n\n\nFor thick absorber, make its surface curve it will look less ugly\nLift the absorber away from the wall will increase absorption, like 5 - 10 cm\n\nex. use 5 cm absorb and lift it 5 cm from the wall\n\n\nAsymmetrical layout is better\ndon’t “over absorb”\n\nTarget reflection decay time: less than -60 dB with in 0.3 sec (roughly 0.2 - 0.4 sec)\n\n\n\nPlacement\nTarget decay time of the room\nTm​=0.3×(100V​)31​±15%\nV = room volume in m3\nAt lower frequency, Upper bound\n63 Hz - Tm​ can be 100% longer, linearly scale to 15% at 200 Hz\nAt higher frequency, lower bound\n4 - 8 kHz - Tm​ can be 50% shorter\nThe Eyring equation\nRT60=−Sln(1−α)0.161V​\nRT60 is the decay time of 60 Hz\nV is volume (m3)\nS is total room surface area (m2)\nα is area-weighted averaged absorption coefficient\nCloth - Acoustic Transparent Fabric\n\nfabric that allow air to pass easily\nJUST BLOW IT!!\nMore accurate method → play pink noise the put fabric between you and speaker\ntransparent up to 6 kHz for treatment\ntransparent up to 16 kHz for speaker front\n\nDiffuser\n\n\ntarget frequency 500 - 3000 Hz\n\n\nwave length ≫ object width  → pierce through\n\n\nwave length ≈ object width → scatter\n\n\nwave length ≪ object width → reflect\n\n\nCalculator with given Column width &amp; max. Column length (mh-audio.nl)\n\n"},"Sound-Engineer/Bass-EQ-Ep-1":{"title":"Bass EQ Ep 1","links":[],"tags":[],"content":"จาก post ของคุณ Sammey’Black Hi End\nwww.facebook.com/groups/791461357947350/permalink/1993485041078303/\nก็ยังมีคำถามนึงที่คนน่าจะสงสัยกันนั่นคือ\nถ้าจะ boost bass เราควรจะ boost ที่ไหนดี กี่ Hz ถึงกี่ Hz\nแล้วควรจะบูสเท่าไหร่\nเอาหละวันนี้ฉลองวันแรงงาน ผมจะลองให้คุณลองหาคำตอบด้วยตัวคุณเองดู\n\nก่อนเริ่ม\n\nวันนี้เราจะมาทดลองฟังเสียงในความถี่ต่าง ๆ ดู\nแต่ก่อนอื่นเราจะต้องมีอุปกรณ์\nการทดลองวันนี้จะต้องใช้คอมพิวเตอร์ หรือ PC\nเป็น OS อะไรก็ได้\nไม่แน่ใจว่า tablet ที่เสียบ mouse ได้จะใช้ได้ไหม\nอุปกรณ์อีกอย่างที่ต้องเตรียมคือ ลำโพงที่สามารถเล่น deep bass ได้\nข้อให้ลงได้อย่างน้อย ๆ 40 Hz ไม่อย่างนั้นอาจจะไม่เห็นผลการทดลองซักเท่าไหร่\nไม่ก็อีกทางหนึ่งคือใช้หูฟังตระกูล IEM หรือ Over ear (ไม่แนะนำ earbud เพราะมันจะลงไม่ถึง)\nจากนั้นก็ต้องมีโปรแกรม Spectrum ที่ปรับ EQ ง่าย ๆ\nซึ่งอันนี้ผมเตรียมไว้ให้แล้ว เป็นเว็ปแอปที่ผมเขียนขึ้นมาเอง\n(ใครจะเอาไปเขียนต่อก็ได้นะโค้ดอยู่บน github แล้ว แค่ license เป็น AGPL)\nโปรแกรมตั้งใจให้ใช้บน PC เลยไม่ได้เขียนเผื่อใช้บนมือถือไว้\nและวันนี้เดี๋ยวผมจะมาสอนวิธีใช้งาน และอธิบายชนิดของ filter ด้วยเลย\nลิงค์ longman694.github.io/audio-spectrum-eq/\nโค้ด github.com/longman694/audio-spectrum-eq/\n\n\nเพลงสำหรับเปิดทดสอบวันนี้\n\nเพลงแรก (จริง ๆ เรียกไฟล์ดีกว่า) เป็น drum track\nExercise-1-Drums.mp3\ndrive.google.com/file/d/1GJN6FyjhrZYtdCY5n3OJNe_5NF5Be-h7/view\nเพลงที่สองจากเว็ปโหลดเพลงฟรี - ลิขสิทธิ์ Creative Commons ใช้ได้ถูกกฎหมาย\nBliss by Luke Bergs\nLuke-Bergs-Bliss(chosic.com).mp3\nwww.chosic.com/download-audio/27880/\n\n\nทดลองใช้โปรแกรม\n\nเอาหละใครยังไม่เปิดเข้าโปรแกรม เข้าผ่านลิงค์นี้ได้เลย\nlongman694.github.io/audio-spectrum-eq/\nเพราะเข้ามาก็จะมีปุ่ม Choose file ให้คุณกดเพื่อโหลดไฟล์เพลงขึ้นมา\nลองเปิดไฟล์ Luke-Bergs-Bliss(chosic.com).mp3 ที่ download ไว้ก่อนหน้านี้ได้เลย\n\n\nเพลงก็จะถูกเล่นขึ้นมา\n\nจากนี้ผมขออธิบายหน้าตาโปรแกรมเล็กน้อย\n\nปุ่ม play / pause\nแถบเลื่อนตำแหน่งเพลง\nปุ่มปรับเสียง\nปิดเพลง เพื่อเลือกเพลงอื่น\nตั้งค่า filter\nตั้งค่า filter แบบใช้ mouse ลาก\n\n\n\nชนิดของ filter\n\nเลข 12 กับ 24 จะเป็นตัวบอกความชันของ filter หรือเรียกว่า order ก็ได้\nโดน 12 คือ -12dB ต่อ octave หรือ 2nd order\n24 คือ -24dB ต่อ octave หรือ 4th order\nLP คือ Low Pass ปล่อยความถี่ต่ำผ่าน\nHP คือ High Pass ปล่อยความถี่สูงผ่าน\nLS คือ Low shelf เพิ่ม-ลดเสียงที่ต่ำกว่าความถี่ที่กำหนด\nHS คือ High shelf เพิ่ม-ลดเสียงที่สูงกว่าความถี่ที่กำหนด\nPK คือ Peak filter ลดหรือเพิ่มความดังของความถี่ที่กำหนด\nNT คือ notch filter คือเอาความถี่ที่กำหนดออก (ลดเสียงลงจนหายไปเลย)\n\n\nตัวแปรของ filter\n\nFilter คือชนิด filter\nFreq คือควาถี่ของ filter\nGain คือ เพิ่มลดเสียงกี่ dB\nQ คือความกว้างของ filter\nค่าทั้งสี่สามารถแก้ไขได้โดยกดไปที่ค่าที่ต้องการแก้ไข\nวงกลมสีเทาคือ filter ที่ปิดการใช้งานอยู่ กดไปที่วงกลมสีเทาหนึ่งครั้งก็จะกลายเป็นสีเหลืองซึ่งบอกว่ากำลังเลือก filter นั้นอยู่ และตัวอักษรของ filter นั้นก็จะสว่างขึ้นเพื่อบอกว่าเปิดใช้งานแล้ว\nวงกลมสีขาวคือ filter อื่นที่เปิดอยู่ แต่ไม่ได้เลือก\nส่วน filter ที่ยังไม่มีลงกลมคือ filter ที่ยังไม่เปิดใช้งาน สามารถเปิดใช้งานได้ด้วยการกดเลือกชนิด filter\nเลขวงกลมในกราฟจะบอกว่าตรงกับ filter ไหนบนตาราง เราสามารถคลิดค้างที่วงกลมนี้แล้วลากเพื่อปรับ filter ได้เลย\n\n\nก่อนเริ่ม สำคัญมาก\nผมขอให้ลดเสียงลงซักครึ่งหนึ่งก่อนครับเพื่อป้องกันการ clipping\nจากนั้นไปเพิ่มเสียงที่ภาคขยาย ให้อยู่ในระดับเสียงที่ฟังปกติ\n\n\n\nเริ่มทดลองกันเลย\nเอาหละลองเล่นกันเลยอันดับแรกผมอยากให้คุณลองตั้ง filter ดังนี้\n\nFilter PK12\nFreq ~400Hz\nGain ~12dB\nQ 1.0\nเอาหละคุณได้ยินเสียงอย่างไร ลองกดเปิดปิด filter เพิ่อเปรียบเทียบดู\nตอบในคอมเมนต์ของภาพได้เลย เฉยอยู่รูปถัดไป\n\n\nเฉลยข้อที่แล้ว\nมีใครได้ยินเสียงก้อง ๆ เหมือนมีกล่องมาครอบไหมครับ\n\nต่อมาลองเปลี่ยน Freq มาที่ 250 Hz กันครับ\nFilter PK12\nFreq ~250Hz\nGain ~12dB\nQ 1.0\nตอบในคอมเมนต์ไต้ภาพ หรือจะตอบในใจก็ได้ ก่อนดูเฉลย\n\n\nเฉลยข้อที่แล้ว\nรู้สึกเสียงบวม ๆ กันไหมครับ\n\nต่อมาลองเปลี่ยน Freq มาที่ 125 Hz กันครับ\nFilter PK12\nFreq ~125Hz\nGain ~12dB\nQ 1.0\nตอบก่อนดูเฉลย\n\n\nเฉลยข้อที่แล้ว\nในย่านนี้คุณต้องได้ยินเสียง impact ของกระเดื่อง เสียงแน่น ๆ\n\nต่อมาลองเปลี่ยน Freq มาที่ 63 Hz กันครับ\nFilter PK12\nFreq ~63Hz\nGain ~12dB\nQ 1.0\nตอบก่อนดูเฉลย\n\n\nเฉลยข้อที่แล้ว\nคุณรู้สึกไหมครับว่าเสียงเบสมันกระหึ่มขึ้น (ถึง impact จะไม่เท่ากับตอน 125 Hz)\n\nนั่นแหละครับ คิดว่าควรจะเริ่ม boost bass ที่ความถี่เท่าไหร่กันดีครับ\nอันนี้ผมต้องบอกว่าแล้วแต่ความชอบแต่ละคนหละครับ\nแค่ไม่สูงเกินไปจนทำให้เกิดเสียงบวม ๆ ออกมาก็พอ\nแต่ถ้าเป็นผม ผมจะ boost ด้วยเริ่มต้นแถว ๆ 125 Hz แหละครับ\nและใช้ Low shelf filter boost ย่านต่ำทุกย่านไปเลย\nเอาหละผมขอจบตอนนี้ไว้เท่านี้ก่อน\nไว้ตอนต่อไปเดี๋ยวจะมาดู ว่าจริง ๆ แล้วมีหลักการอะไรไหมว่าต้อง boost ความดังเท่าไหร่อย่างไร\nระหว่างนี้ก็ลองเล่นกับเพลงอื่นดูครับ เพลงเสียงร้องผู้ชายบ้าง ผู้หญิงบ้าง เพลงบรรเลงบ้าง\nลองปรับ EQ และแสดงความเห็นมาได้ครับว่าเท่าไหร่แล้วรู้สึกว่าบวม ปรับเท่าไหร่กำลังดี\nในตอนนนี้ผมขอลาไปเท่านี้ก่อนครับ\n"},"Sound-Engineer/Bass-EQ-Ep-2":{"title":"Bass EQ Ep 2","links":["tags/knowledge","tags/eq"],"tags":["knowledge","eq"],"content":"knowledgeeq\nอ่าน Bass EQ Ep1\nwww.facebook.com/groups/791461357947350/permalink/1993893547704119/\nตอนนี้จะมาดูด้านทฤษฎีดีกันบ้างว่าเวลาบูสเบสจริง ๆ ในมางทฤษฎีแล้วมีหลักการอะไรบ้าง\nในตอนนี้จะเป็นความรู้ที่ผมได้ยินมาจากหลาย ๆ ที่ จะเขียนแหล่งอ้างอิงทั้งหมดก็คงยาก เอาเป็นว่าให้ตอนนี้เป็นควาเห็นส่วนตัวของผมก็ได้ เพราะฉะนั้นถ้ามีข้อผิดพลาดประการใดก็ขออภัยในที่นี้ไว้ด้วย ส่วนท่านใดที่มีความเห็นหรือข้อเท็จจริงที่แตกต่างออกไปก็คอมเมนต์ได้เลยครับ เพื่อเป็นประโยชน์กับทุกคนในกลุ่ม\nอีกอย่างคือการปรับเสียงในตอนนี้ จะไม่เกี่ยวกับการปรับเสียงในดนตรีสด งานแสดงบนเวที หรือตวามชอบส่วนบุคคล แต่จะเป็นการปรับเสียงเพื่อใช้ในห้องปิดหรือเพลงคลอในห้องอาหารก็พอได้ (ก็คือเปิดเสียงค่อนข้างเบา)\n\nความดังเป้าหมาย\nในตอนนี้ผมขอกำหนดความดังเป้าหมายที่จะใช้ฟังที่ 60 dB ซึ่งก็เป็นความดังที่เราฟังกันสบาย ๆ ในบ้าน หรือเพลงคลอตามร้านอาหาร\n\nแต่จริง ๆ หลังจากเข้าใจหลักการแล้ว ก็สามารถใช้ได้ความดังเท่าไหร่ก็ได้จนถึงความดังประมาณ 80-90 dB\n\n\nความสามารถในการรับรู้ความดังของมนุษย์\n\nเชื่อว่าทุกคนน่าจะเคยเห็นกราฟนี้กันมาบ้างแล้ว กราฟนี้มีชื่อว่า equal-loud-ness-level contours หรือ ELLC ความดังจริง ๆ เทียบกับความดังในความรู้สึกของมนุษย์ อย่างเช่น คุณจะรู้สึกว่า เสียง 80 dB ที่ความถี่ 63Hz จะมีความดังเท่ากับ เสียง 50 dB ที่ความถี่ 1000Hz ซึ่งจะเรียกความดังในเส้นนี้ว่า 50 phons\nกราฟ ELLC ที่ผมใช้จะมากจากมาตราฐาน ISO 226 ปี 2023\nซึ่งยังมีข้อจำกัดอยู่คือเส้นประที่เห็นในกราฟจะเป็นค่าโดยประมาณที่ยังต้องมีการวิจัยเพิ่มเติมในอนาคต ดังนั้นค่า 100 phons 10 phons ยังไม่น่าใช้เท่าไหร่ และจะยังไม่มีการกำหนด 0 phons จริง ๆ เพราะค่าที่ได้ยังไม่ถูกต้อง จึงเรียกว่า Hearing threshold ไปก่อน\n\n\nแปลงเป็นค่าที่สามารถใช้งานได้\nกราฟใน paper เป็นค่าที่ใช้ได้ลำบาก เพราะฉะนั้นผมก็เอาโปรแกรม tracer จับแล้วเอาไปลงใน REW เพื่อนำมาวิเคราะห์ได้ง่ายขึ้น\n\nสามารถ download ไฟล์ได้ที่\ndrive.google.com/file/d/1jI94zmN8FP6RsJpLBqRqBj72qjo4lzTS/view\nหรือจะ download เป็นไฟล์ .frd ได้ที่\ndrive.google.com/file/d/1tAHuko011aw50gs5nI5laZIJD1scgQjD/view\nโปรแกรมที่ใช้เปิด REW download ได้ที่เว็ป\nwww.roomeqwizard.com/\n\n\nความดังของเพลงตอน Mix ขึ้นมา\n\nผมได้ยินมาว่า Sound Engineer เวลาทำเพลงขึ้นมา เขาจะใช้ความดังประมาณ 50 - 70 dB เวลาทำงานนานๆ และจะใช้ความดัง 80-90 dB เวลาจะตรวจงานสุดท้าย\n\nถ้าใครสามารถยืนยันข้อมูลนี้ได้ หรือมีข้อมูลที่ต่างออกไปก็มาแชร์กันครับ ต่างคน ต่างเทคนิค ต่างเชื้อชาติ ก็ควรจะมีอะไรที่แตกต่างกันบ้าง\n\nแต่ในตอนนี้ผมขอกำหนดไปก่อนละกันครับว่า sound engineer จะใช้ความดังเสียงที่ 80 dB\n\n\nลองเช็ค spectrum ของเพลง\nถ้าเรานำผลวิเคราะห์ spectrum ของเพลง Bliss จาก Ep1 มาดู\nจะเห็นว่า ที่ 60Hz จะมีความดังอยู่ที่ ประมาณ -8 dB\nและความดังที่ 1kHz มีความดังอยู่ที่ ประมาณ -24 dB\nมีส่วนต่าง 16 dB\n\nถ้าดูที่กราฟ 90 phons จะเห็นความดังที่ 60Hz อยู่ที่ 105dB มีส่วนต่าง 15 dB\nถ้าดูที่กราฟ 80 phons จะเห็นความดังที่ 60Hz อยู่ที่ 98dB มีส่วนต่าง 18 dB\nก็จะเห็นว่า sound engineer จะ mix เสียงตามกราฟ ELLC อยู่แล้ว\n(หรือจริง ๆ สำหรับคนที่เคยทำเพลงมาก็คือใช้หน่วย LUFS ช่วยนั่นแหละ)\n\n6. ดังนั้นสิ่งเดียวที่เราต้องสนใจในการ boost เสียง คือ\nการชดเชยความสามารถในการได้ยินวามถี่ต่ำที่ลดลงเมื่อความดังน้องลงเท่านั้นเอง\nซึ่งเราสามารถหาได้โดย\n\nเอาค่าของกราฟ 80 phons มา -20dB เพื่อให้เท่ากับความดังที่ต้องการฟัง\nเอากราฟ 80 phons ที่ประบแล้ว ไปหารกราฟ 60 phons (ใช้หารเพราะเป็น log scale) ซึ่งก็จะได้ผลลัพท์เป็นกราฟความดังที่เราต้อง gain ขึ้นมา\nในภาพ ผมย่อ 60 และ 80 phons ลงมาอีกหน่อยเพื่อให้เก็นได้ชัดเจน\n\nกราฟเส้นล่างสุดคือผลลัพท์ที่ได้ ก็คือ\nboost เสียง 60 Hz ขึ้นมา 8dB\nboost เสียง 100 Hz ขึ้นมา 6dB\nแล้วก็ต่อ ๆ ไปเรื่อย ๆ\nก็ลองไปปรับกันได้ที่โปรแกรม\nlongman694.github.io/audio-spectrum-eq/\n(อย่าลืมปรับความดังในโปรแกรมลงเพื่อป้องกันการเกิด digital clipping)\nใครได้ผลอย่างไรอย่าลืมมาแชร์กันด้วยนะครับ\n"},"Sound-Engineer/Dolby-On":{"title":"Dolby On","links":[],"tags":[],"content":"อันเสียงผ่านมือถืออย่างไรให้เสียงดี\nมีใครเคยเป็นไหมครับที่เวลาอัดเสียงผ่านโทรศัพท์มือถือแล้ว\nเอ… เสียงที่ได้มามันไม่เหมือนกับที่ฟังของจริงเลย\nตัวลำโพงก็อุตส่าห์จูนให้เสียงย่านแอร์สูงแล้วเสียงจริงที่ฟังก็ใส\nแต่พอเสียงที่อัดมามันกลับทึบจนไม่เหลือความสว่างอยู่เลย\n\nผมเป็นคนนึงที่เจออะไรแบบนี้แล้วหงุดหงิดมาก ประมาณว่า “เอาเสียงลำโพงฉันคืนมา”\n\nที่จริงถ้าอยากจะได้เสียงดีที่สุดก็ต้องอัดเสียงด้วยไมค์ RTA นี่แหละ อาจจะอัดลำโพงทีละข้างทำ channel ซ้าย ขวา ส่วนรูปวีดีโอก็เอามาใส่ในโปรแกรมตัดต่อทีหลัง ซึ่งวิธีการก็ยุ่งยากเกินไป\nหรือในมือถือเองก็น่าจะมี setting ในโปรแกรมให้ปรับแหละ แต่คนทั่วไปจะไปรู้ไหมว่าต้องปรับอะไรตรงไหน?\n\n\nนี่เป็นการวิเคราะห์เสียงที่อัดโดยแอปทั่วไป ไม่ได้ปรับอะไร\nจะเห็นว่าความที่ตั้ง 9k Hz ขึ้นไปนี่หายไปเลย\n\nเพลง Hotel California ที่อัดมาเสียง shaker นี่หายไปเลย\nเพลง version นี้นะ\nwww.youtube.com/watch\n\n\nDolby On\n\nผมก็เลยไปลองหาว่ามีแอปไหนน่าจะใช้ได้บ้าง จนไปเจอแอป์นี้เข้า\nDolby On\nซึ่งชื่อก็การันตีระดับนึงละว่าน่าจะดี\nดาวน์โหลดได้ที่\nAndroid\nplay.google.com/store/apps/details\niOS\napps.apple.com/us/app/dolby-on-record-audio-video/id1443964192\nผมก็ลองเอามาใช้อัดเสียงแล้วก็เอามาวิเคราะห์ดู ปรากฎว่าใช้ได้เลย\nจะมีแค่เรื่อง noise cancelling ที่จะต้องปรับเล็กน้อย\n\n\nต่อไปจะเป็นวิธีใช้งาน\n\nพอเข้ามาครั้งแรก ก็จะมีหน้าวิธีใช้ขึ้นมากับให้ผูก account อะไรเล็กน้อย พอผ่านมาแล้วก็จะเจอหน้าด้านซ้าย\nซึ่งก็จะมีให้เลือกว่าจะอัดเป็นเสียง หรือ วีดีโอ\nถ้าอัดเสียงใช้ปุ่มตรงกลาง\nอัดวีดีโอใช้ปุ่มซ้าย ซึ่งก็จะมีภาพกล้องขึ้นมา มีปรับกล้องหน้ากล้องหลังเหมือนแอปวีดีโอปกติ\nส่วนปุ่มหัวคนมีสัญญาณนี่ผมยังไม่เคยลอง ขอข้ามไปละกัน\n\n\nเมื่ออัดเสร็จก็สามารถดูไฟล์ที่อัดได้จาก icon ซ้ายล่าง\nก็จะมีรายการไฟล์วีดีโอหรือเสียงขึ้นมาตามภาพด้านขวา\nจากนั้นก็เลือกไฟล์ที่ต้องการแชร์\n\n\n\nวิธีปิด noise cancelling\n(ผมลืมปรับตะแคงมือถือ ภาพเลยตั้ง ๆ อย่างนั้น)\n\nเวลาอัดเสียงจากลำโพง ส่วนใหญ่แล้วถ้าเปิด noise cancelling ขึ้นมา มันจะทำให้เสียงลำโพงเพี้ยนไป ซึ่งผมก็แนะนำให้ปิดไปดีกว่า\nวิธีปิดก็ทำตามลูกศรได้เลย\n\n\nวิธีแชร์\nในหน้าเดียวกันนี้ก็จะมีปุ่มแชร์อยู่ด้านล่าง โดย default ก็จะมีแชร์ลง fb กับ ig ได้เลย\nถ้าจะแชร์ไปที่อื่นก็ให้เลือก More Audio Apps หรือ More Video Apps\n\nซึ่งถ้าเลือก More Audio Apps โปรแกรมจะตัดออกมาเฉพาะเสียงให้ด้วย\n\n\nเอาไฟล์มาวิเคราะห์\n\nเท่าที่ลองเอาไฟล์มาดูจะเห็นหลุมที่ 8k - 10k ที่เป็นความถี่ของ noise ไม่รู้ว่าที่โปรแกรมตัดออกให้เพราะห้องผมมี noise จากฟัดลม\n(ถ้าจำกันได้ drive.google.com/file/d/1ho7rKuvIVzr4SRGWK1_f3HDNCAt6h0E3/view)\nก็ลองมาฟังเพลงที่อัดมาจาก Dolby On ดูครับ\ndrive.google.com/file/d/1N22Rp_zs_U8cYIEedIyG-pss6V_v2nMR/view\nOriginal\nwww.youtube.com/watch\nโปรแกรมวิเคราะห์เข้าใช้กันได้ที่\nlongman694.github.io/audio-spectrum-eq/\n\n\nเพิ่มเติมสำหรับคนอยากอัดเสียง lossless\n\nใน setting มีให้ปรับด้วยนะ แต่คำเตือนคือมันกินที่มาก ๆ\n"},"Sound-Engineer/Ear-Training-1":{"title":"Ear Training 1","links":["tags/knowledge","tags/eartraining"],"tags":["knowledge","eartraining"],"content":"knowledgeeartraining\nมาฝึกหูกันดีกว่า EP 1\nในตอนแรกนี้ ผมอยากจะมาแรกเปลี่ยนความคิดเห็นด้านการฟังของคนเรากันก่อน สิ่งที่ผมเขียนจะมาจากสิ่งที่ผมเข้าใจจากการหาข้อมูลเองบ้าง ประสบการณ์บ้าง ก็ผิดถูก เห็นด้วย ไม่เห็นด้วย อย่างไรก็ลองแสดงความเห็นมาคุยกันได้ครับ ถ้าใครมีแหล่งอ้างอิงหรืองานวิจัยมาแบ่งปันกันด้วยก็ยิ่งดีครับ\nความสามารถในการฟังเสียง\n\nความสามารถในการได้ยินตามความถี่\n\nทุกคนคงได้ยินกันมาแล้วว่า หูของคนเราเนี่ยสามารถได้ยินช่วงความถี่ตั้งแต่ 20 - 20000 Hz แต่ก็จะเสื่อมสภาพไปตามวัย ตอนเด็ก ๆ อาจจะได้ยินเสียงถึง 20000 Hz เมื่อโตเป็นวัยรุ่นก็เริ่มตกเหลือ 18000 Hz พอช่วง 30-40 ก็เหลือ 16000 Hz เป็นต้น ในช่วงความถี่ต่ำก็เช่นเดียวกัน อยากผมเองอายุประมาณ 30 กลาง ๆ ได้ยินเสียงเบสต่ำสุดประมาณ 40 Hz ต่ำกว่านี้ก็ไม่ได้ยินแล้ว\nแต่สิ่งที่ผมกล่าวมาข้างต้นมันเป็นเพียงการได้ยินจากสัญญาณ ซายเวฟ (sine wave) เท่านั้น มันยังไม่ใช่สิ่งที่คุณสัมพัสได้จากการฟังจริง ๆ อย่างเช่นความถี่ย่าน 18000 Hz ขึ้นไป ถึงคุณจะไม่ได้ยินมัน แต่ถ้าคุณลดมันลงไปซัก 12db ขณะเปิดเพลงอยู่ คุณอาจจะรู้สึกว่าเพลงมันทึบลง หรือถ้าเพิ่มมันขึ้นไปก็อาจจะได้ยินเสียงเล็ก ๆ แหลม ๆ มากขึ้น\nส่วนของเบสก็เช่นกันคุณอาจจะไม่ได้ยินเสียง 30Hz แต่ถ้าคุณเปิดเสียงนี้ให้ดังขึ้นคุณก็จะรู้สึกได้ถึงแรงสั่นสะเทือน ยิ่งลำโพงใหญ่ก็จะยิ่งรู้สึกได้มากขึ้น\n\n\nการได้ยินตามความถี่แต่ละความถี่นั้นไม่เท่ากัน\n\nเรื่องนี้อาจจะเป็นสิ่งที่คุณเคยได้ยินมาก่อนแล้ว หรืออาจจะรู้สึกได้จากประสมการณ์\nคือหูของคนได้ยิน “ความดัง” ของแต่ละ “ความถี่” ไม่เท่ากัน\nมีการรวบรวมงานวิจัย จัดเป็นมาตรฐานชื่อว่า ISO 226 ชื่อว่า Normal Equal-Loudness-Level Contours\nซึ่งได้กำหนดความดังในแต่ละความถี่ที่คนจะรู้สึกว่าดังเท่ากันเอาไว้\nเรียกว่า equal-loudness-level contours (ELLCs)\nมีหน่วยวัดเป็น phons ซึ่ง x phons คือความดังเทียบเท่าความดังของ 1k Hz ที่ x dB\nเช่น ดูที่เส้น 60 phons ตัดความความดัง 75dB ที่ 125 Hz ก็แปรว่าคนเราจะรู้สึกว่ามันจะดังพอ ๆ กับ 1000 kHz ที่ 60dB\nอ้างอิง ISO 226:2023 หรือ ISO 226:2003\n\n\nความสามารถในการรับรู้ความถี่เสียง\n\nโดยหลัก ๆ แล้ว คนเราจะมีความสามารถในการรับรู้ความถี่อยู่ 2 แบบคือ\n\nPerfect pitch\nคนที่มีความสามารถนี้ คือจะเป็นคนที่ฟังตัวโน้ตแล้ว สามารถรับรู้ได้เลยว่าเป็นโน้ตอะไร ถ้าศึกษาเรื่องความถี่มาด้วย เขาก็อาจจะบอกเลขความถี่ได้ใกล้เคียงมาก ๆ\n\nความสามารถนี้เป็นความสามารถที่ฝึกได้ แต่จะต้องฝึกแต่เด็ก ถ้าผ่านอายุช่วงนึงไปแล้ว (เข้าใจว่าน่าจะประมาณ 5 ขวบ ผมไม่แน่ใจ) ก็จะไม่สามารถฝึกได้อีก\nแต่ก็มีงานวิจัยบางตัวที่บอกว่าผู้ใหญ่ก็ยังสามารถฝึกได้อยู่ แต่อันนี้ก็แล้วแต่ความสนใจครับ ใครสนใจก็ลองหาอ่านกันดู\n\nRelative pitch\nคือความสามารถที่บอกได้ว่าโน้ตสองตัวห่างกันเท่าไหร่ เช่นเล่นโน้ต C และตัว A คนที่มีความสามารถนี้ก็จะสามารถบอกได้ว่าทั้งสองโน้ตห่างกัน 9 เซมิโทน หรือเล่น Bb กับ E ห่างกัน 6 เซมิโทนเป็นต้น นอกจากนี้ก็ยังรวมถึงความสามารถในการบอกชนิดคอร์ดด้วยเช่น major minor dim aug 7\n\nซึ่งข่าวดีคือความสามารถนี้ทุกคนสามารถฝึกได้ (ซึ่กบางคนก็ต้องขยันและใช้ความพยายามหน่อย)\nบางคนอาจจะฝึกจำเสียงโน้ตไว้เสียงนึง โดยอาจจะใช้การสั่นพ้องกับร่างกาย ส่วนใหญ่จะนิยมจำเสียงโน้ต C ต่ำ หรือ A ซึ่งเสียง A นี่จะง่ายหน่อยเพราะเป็นโน้ตที่จะต้องเปิดช่องคอพอดี (สำหรับผู้ชายนะ ไม่รู้ว่าผู้หญิงจะเหมือนกันหรือเปล่า) พอจำเสียงโน้ต C หรือ A ได้แล้วก็เอาไปหา pitch ของเสียงอื่นต่อ\n\n\nความสามารถในการรับรู้ความถี่เสียงสำหรับจูนเสียง\nซึ่งที่กล่าวมาในข้อ 3 ก็จะเป็นสกิลของนักร้องนักดนตรี ซึ่งสำหรับคนจูนลำโพงอาจจะไม่จำเป็นต้องมีความสามารถขนาดนั้นก็ได้ แต่มีวามสามารถในการฟังเสียงระดับ sound engineer ก็พอ (โหดกว่าไหมเนี่ย)\nซึ่งวิธีการฝึกผมจะมาบอกต่อใน EP 2\n\n\n\nหูคนสามารถปรับตัวได้\n\nมันมีเรื่องเล่าของนักเล่นเครื่องเสียงคนหนึ่ง เขาได้ไปลองฟังลำโพงฮอร์นเป็นครั้งแรก ซึ่งก็เป็นชุดเครื่องเสียงระดับ audiophile มีราคาไม่น้อย เพลงที่ฟังก็เป็นเพลงเดิม ๆ อัลบั้มที่เขาฟังประจำนั่นแหละ ปรากฎว่าเสียงที่เขาได้ยินในช่วงแรกไม่เป็นที่ประทับใจ แต่เมื่อนั่งฟังไปซักพัก 20 นาที ครึ่งชั่วโมง เสียงที่เขาได้ยินเป็นปกติก็เริ่มกลับมาและเริ่มชอบเสียงชุดลำโพงนี้ (ภาพประกอบไม่เกี่ยวกับชุดลำโพงในเรื่องนี้แต่อย่างไร แต่ฮอร์นก็หน้าตาประมาณนี้แหละสำหรับคนยังไม่เคยเห็น)\nบางคนอาจจะมีประสบการณ์ไปซื้อของที่บ้านหมอแล้วเจอร้านเบสหนัก ๆ ขนาดสังกะสีสะเทือน และรู้สึกว่าเบสนี้มันฟังไม่ได้เลย ส่วนในทางกลับกัน คนที่ฟังเบสเยอะ ๆ ไปเจอเครื่องเสียงที่การตอบสนองเรียบ ๆ ก็จะรู้สึกลอย ๆ ไม่อิ่มไม่แน่นอย่างที่ฟังประจำ\nปรากฏการนี้ยังรวมถึงเวลาซื้อหูฟังคู่ใหม่มา แล้วฟังตอนแรก ๆ อาจจะรู้สึกไม่เพราะ แต่พอฟังไปนาน ๆ วันสองวัน ก็รู้สึกว่าเสียงหูฟังนี้ดีขึ้น ซึ่งมันคือสิ่งที่เข้าใจกันว่าเป็นการเบิร์นหูฟังนั่นแหละ มีการทดลองและวัดหลายที่แล้วว่าการเบิร์นหูฟังนั้นไม่ทำให้หูฟังเปลี่ยนแปลงแต่อย่างใด สิ่งที่ถูกเบิร์นจริง ๆ คือหูของคนฟังนี้แหละ\nจากเหตุการณ์ข้างต้นจะเห็นว่าหูเรามันสามารถปรับตามสภาพแวดล้อมได้ เมื่อคุณอยู่ในสภาพแวดล้อมใดนาน ๆ หูของคุณก็จะปรับตัวเข้ากับมัน มีความสามารถได้ยินในสภาพแวดล้อมนั้น ๆ ได้ดีขึ้น\nซึ่งก็เป็นคำเติอนนึงคือเมื่อคุณได้ยินเสียงเครื่องเสียงแพง ๆ แล้วคุณก็จะพังเครื่องถูก ๆ ไม่ได้อีกต่อไป หรือกรณีนี้เมื่อคุณฝึกหูแล้วคุณก็จะฟังลำโพงแล้วรู้ได้ทันทีว่าเสียงส่วนไหนไม่ดี (หรือจริง ๆ ก็แค่ต่างจากลำโพงที่คุณฟังประจำตรงไหนนั่นแหละ)\n\n\nปรากฏการยาหลอก Placebo Effect\nคุณอาจจะเคยได้ยินเรื่องยาหลอกมาก่อน เช่นคนป่วยคนหนึ่งเป็นโรคที่ไม่สามารถรักษาให้หายได้แล้วไปหาหมอ หมอจ่ายยาตัวหนึ่งให้ (ซึ่งจริงๆ ไม่มีผลต่อโรคนั้นหลอกนะ) แล้วปรากฎว่าอาการคนไข้ดีขึ้น และยิ้งถ้าบอกว่าเป็นยาพิเศษราคาแพงมาก คนไขยิ่งมีอาการที่ดีขึ้น\n\nในวงการเครื่องเสียงก็มีปรากฏการยาหลอกแบบนี้เช่นกัน สมมติว่าคุณมีการซื้ออุปกรณ์อะไรบางอย่างเพิ่มเข้าไปในระบบเครื่องเสียงของคุณ แล้วคุณพยายามฟังว่าเสียงของระบบนั้นต่างไปจากเดิมอย่างไร ในจังหวะที่คุณฟังอยู่นั้น คุณก็จะเพ่งสามาธิไปที่เสียงเพลง ทำให้ได้ยินอะไรมากขึ้น ประกอบกับสิ่งที่คุณรู้คือคุณได้เพิ่มอุปกรณ์ตัวหนึ่งซึ่งคุณอุตสาซื้อมาเข้าไป ทำให้อาจจะเกิดการคิดไปเองได้ว่าเสียงของระบบของคุณนั้นดีขึ้น\nสิ่งนี้อาจจะแก้ได้ด้วยการฟังระบบเก่าและระบบใหม่สลับ ๆ กันไป ยาหลอกก็จะมีผลน้อยลง\nสำหรับผมถ้าอยากจะรู้จริง ๆ ว่าสิ่งเพิ่มเข้าไปในระบบนั้นทำให้เสียงดีขึ้นจริงไหม ให้ใช้วิธีการวัดทางวิทยาศาสตร์จะดีที่สุด\n\n\nแล้วลำโพงควรจะจูนให้มีเสียงอย่างไร\nคำตอบสุดท้าย อาจจะต้องตอบว่า “แล้วแต่คุณชอบ” แต่เอาหละในเมื่อนี่เป็นบทความของผม ผมขอเสนอแบบที่ผมชอบละกัน : D\n\nสำหรับผมแล้วเสียงลำโพงที่ดีควรเป็นดังรูป คือเรียบที่สุดตลอดตั้งแต่ 20 - 20k Hz (แล้วก็ distortion น้อย ๆ off-axis ดี ๆ ไม่มีสะสมพลังงาน บลาๆๆ เอาเถอะไว้วันอื่น)\nเพราะว่า…\n\n\nเหตุผล\n\n\nกราฟเรียบ ๆ ปรับ tone ได้ง่ายกว่า tone ที่ว่าคือวอลลุ่ม bass treble บนแอมนั่นแหละ ใครชอบแบบไหนก็ไปปรับเอาเอง\nซาวด์ เอนจิเนียร์ (sound engineer) ที่ทำเพลงมา เขาปรับระดับเครื่องดนตรีมาให้อยู่แล้ว ในภาพเป็น spectrum analyzer 1 นาทีแรกของเพลง เสียงขลุ่ยเรียกนาย และ Somewhere, Somebody ซึ่งจะเห็นว่าบริมาณย่านเบสก็จะสูงแล้วก็จะต่ำลงมาเรื่อย ๆ ตามความถี่ที่เพิ่มขึ้น ถ้าย้อนกลับไปดูรูปที่ 2 ก็จะเห็นว่ามันสอดคล้องกัน คนเรามีความสามารถในยินเสียงช่วงเบสได้แย่กว่ามิดและไฮ ทำให้ซาวด์เอนจะต้องปรับเสียงต่าง ๆ ให้เหมาะสม ซึ่งก็จะใช้โปรแกรมช่วย เช่น หน่วย LUFS (Loudness units relative to full scale) ซึ่งช่วยให้ซาวด์เอนสามารถรู้ได้ว่าคนฟังจะได้ยินเสียงที่ความถี่นั้น ๆ ดังเท่าไหร่\n\n\n\nตอนต่อไป\nEP ต่อไปเดี๋ยวจะมาแจกวิธีการฝึกฟังเสียง ตามรูปที่ 4 ใครอยากลองให้เตรียมหูฟังไว้ หรือใครมีลำโพง monitor ยิ่งดี\n\n"},"Sound-Engineer/Ear-Training-2":{"title":"Ear Training 2","links":["tags/knowledge","tags/eartraining"],"tags":["knowledge","eartraining"],"content":"knowledgeeartraining\nมาฝึกหูกันดีกว่า EP 2\nอ่าน EP 1 - ความเข้าใจเรื่องเสียงเบื้องต้น\nwww.facebook.com/groups/791461357947350/permalink/1932596877167120/\nตอนนี้จะเป็นภาคปฏิบัติล้วน ๆ แต่ก่อนจะเริ่มผมอยากให้ทุกคนลองฟังคลิปนี้ก่อน\nสำหรับใครไม่เก่งภาษาอังกฤษ ให้ฟังไปก่อนเดี๋ยวผมจะมาแปรให้ในรูปถัด ๆ ไป\nwww.youtube.com/watch\nจากนั้นเปิดโปรแกรมในคลิปนี้\nwebtet.net/apcl/#/parametric\n\nความถี่สำคัญ\n\nจากคลิปจะเห็นว่าเขาแบ่งความถี่เป็น\n63, 125, 250, …\nซึ่งความถี่นี้เป็นการแบ่งแบบ ANSI S1.11-2004 แบบเต็ม Octave\nซึ่งประกอบด้วย\n31.5, 63, 125, 250, 500, 1k, 2k, 4k, 8k, 16k\nใครสนใจอ่านเพิ่มเติมได้ที่\nANSI S1.11: Specification for Octave, Half-Octave, and Third Octave Band Filter Sets\narchive.org/details/gov.law.ansi.s1.11.2004/page/n23/mode/2up\nส่วนบางคนอาจจะเคยเห็น EQ แบ่งเป็นย่าน\n16, 32, 65, 130, 261, 523, 1k, 2k, 4.1k, 8.3k, 16.7k\nซึ่งการแบ่งแบบนี้จะเรียกว่า Equal temperament (A-440 Hz)\nอ่านเพิ่มที่\nhyperphysics.phy-astr.gsu.edu/hbase/Music/et.html\n\n\nวิธีใช้โปรแกรม\nเว็ป webtet.net/apcl/#/parametric\nเป็นสื่อการสอนที่มาพร้อมกับหนังสือ “Audio Production and Critical Listening Technical Ear Training”\nเขียนโดย Jason Corey\n\nเมื่อกด link ก็จะเห็นหน้าจอตามภาพ\nหน้าจอนี้เป็นโปรแกรมแบบฝึกหัดสำหรับฝึกหูจับเสียงย่านความถี่\nโดยโปรแกรมจะให้แบบฝึกหัดสุ่มปรับค่าความถี่ให้เราฟัง จากนั้นให้เราตอบว่าความถี่ที่เปลี่ยนไปคือความถี่อะไร ความดังเท่าไหร่ ถ้าตอบถูกคุณก็จะได้คะแนนในข้อนั้นไป\nรูปนี้จะขออธิบายส่วนประกอบของโปรแกรมก่อน\n1 ชนิดโจทย์\nMatching - ปรับ EQ ตามให้ตรงกับเสียงโจทย์\nMatching memory - ปรับ EQ ตามให้ตรงกับเสียงโจทย์ โดยฟังโจทย์ได้รอบเดียว\nReturn to Flat - ปรับ EQ จากเสียงโจทย์ให้ flat\nAbsolute ID - ให้เราทาย EQ โดยไม่ให้เราลองปรับ\nReturn to Flat Memory - น่าจะไว้ปรับ EQ จากเสียงโจทย์ให้ flat โดยให้ฟังโจทย์รอบเดียวเหมือนกัน แต่ผมใช้แล้วยังงงๆ ไม่เห็นต่างจาก Return to Flat แบบธรรมดาเลย ถ้าใครเจอข้อแต่ต่างแล้วมาแชร์กันหน่อย\n2 ความละเอียดความถี่ มี 1 Octave (แนะนำ) และ 1/3 Octave (ระดับยาก)\n3 จำนวน แบนด์ ที่โดนปรับ เลือกได้ตั้งแต่ 1 - 3\n4 ระดับ gain ของโจทย์ ง่ายสุดจะมีแค่ +12dB พอยากขึ้นก็จะมี +- และระดับความดังที่ปรับได้ละเอียดขึ้น\n5 Q หรือความกว้างของความถี่      Q มาก = แคบ    Q น้อย = กว้าง\n6 เลือกช่วงความถี่ที่จะฝึก\n7 เลือกเสียงที่ใช้\nPink Noise เล่น pink noise\nSound File เล่นไฟล์ที่อัพโหลดขึ้นไป   หรือ    *** กดเพิ่อปิด pink noise ***\nMono ปรับให้เสียงที่ออกเป็น mono\n8 ปรับระดับความดัง\n9 คำตอบของเรา\nมี 3 แกนคือ\nFREQ คือย่านความถี่\nGAIN คือระดับความดัง เพิ่ม/ลด เท่าไหร่\nQ ค่านี้โปรแกรมจะปรับให้อัตโนมัติ แต่จะลองปรับเพื่อฟังดูเองก็ได้\nA ไว้ฟังเสียง เดิม - โจทย์ - คำตอบ ในวงเล็บคือคีย์ลัด\nBypass (w) คือเสียง pink noise หรือไฟล์ดังเดิม\nQuestion (e) คือ โจทย์\nYour Response (r) คือ เสียงจากคำตอบของเราที่ปรับในข้อ 9\nB คือตั้งเวลานับถอยหลังสำหรับทำโจทย์แต่ละข้อ มีให้เลือกตั้งแต่ 0 - 30s หรือ ไม่จำกัด ถ้าเวลาหมดจะถือว่าเราตอยผิดในข้อนั้นไป\nC คะแนน และ ปุ่มรีเซต\nD กดเพื่อส่งคำตอบ หรือ กดปุ่ม enter ก็ได้เช่นกัน\nF คำตอบในข้อนั้น ๆ ถ้าขึ้น สีเขียวคือตอบถูก สีแดงคือตอบผิด\nG เราสามารถใช้ไฟล์เพลงของเราเองได้ โดยคลิกที่สีเหลี่ยมเพื่อเลือกไฟล์ หรือ ลากไฟล์มาวางก็ได้ โดยไฟล์ไม่จำเป็นต้องเป็น .wav จะใช้ .mp3 .flac .m4a หรือไฟล์เสียงอื่น ๆ ก็ได้\n\n\nเตรียมโปรแกรมสำหรับฝึกหู\n\nสำหรับผู้เริ่มต้น ผมขอให้อย่าเพิ่งเล่นตัวแบบฝึกหัด เดี๋ยวมาฝึกแยกเสียงความถี่กันก่อน\n1 ให้กดไปที่ pink noise ซึ่งเมื่อกดแล้วจะต้องเสียง noise ออกมา จากนั้นปรับ Output ให้อยู่ในระดับที่ฟังสบาย ๆ ไม่เบาไป ไม่ดังไป\n2 กดไปที่ ปุ่ม Your Response\n3 ลองเลื่อน FREQ ดูแล้วลองฟังว่าเสียง เสียงจะต้องเปลี่ยนไปตามที่เราปรับ ถ้าเสียงสูงมาก\nส่วนต่อไปผมจะมาแปลคลิปในตอนแรกอีกที\nใครฟังเป็นอยู่แล้วหรือฟังคลิปของ Audio University เข้าใจก็ข้ามส่วนนี้ไปได้เลยครับ\nส่วนใครจะลองวิธีตามผมก็ดูหน้าถัดไปเลย\n\n\n250Hz เสียง อู\n\nอันดับแรกให้คุณปรับ FREQ ไปที่ 250Hz ก่อน\nจากนั้นทำปากออกเสียง “อู”\nจากนั้นหายใจให้เต็มปอด แล้วลองออกเสียง โดยไม่ต้องมีเสียงจริงออกมา ให้ออกมาแต่ลม (เหมือนเวลากระซิบข้างหูคนอื่น แต่อันนี้ใช้ลมเยอะ ๆ หน่อย อารมณ์เล่นเครื่องดนตรีพวกเครื่องเป่า)\nลองปรับความถี่ให้ตรง และใช้ วิธีปรับสลับ bypass และ your response ไปมา (คีย์ลัด w กับ r)\nใครที่ยังจับเสียงไม่ได้ หรือยังไม่รู้สึกสั่น ๆ ให้เพิ่มเสียงขึ้น หรือ เข้าไปลองใกล้ ๆ ลำโพง จะจับเสียงได้ง่ายขึ้น\n\n\n500Hz เสียง โอ\n\nปรับ FREQ ไปที่ 500Hz\nทำปากออกเสียง “โอ”\nยกเพดานปากด้านในขึ้นสูง ๆ (เปิดช่องคอ)\nแล้วออกเสียงโอ โดยไม่ออกเสียง แล้วให้ลมออกเยอะ ๆ\nเหมือนเดิม\nลองปรับความถี่ให้ตรง สลับ bypass และ your response ไปมา (คีย์ลัด w กับ r)\nทำให้ใน ปาก/คอ รู้สึกสั่น ๆ ให้ได้\n\n\n1000Hz เสียง อา\n\nปรับ FREQ ไปที่ 1000Hz\nทำปากออกเสียง “อา”\nเปิดช่องคอ\nออกเสียงอา ไม่ออกเสียง แล้วให้ลมออกเยอะ ๆ\nปรับความถี่ให้ตรง สลับ bypass และ your response ไปมา\n\n\n2000Hz เสียง เฮ\n\nสังเกตว่าผมใช้ “ฮ” แทน “อ” เพราะคนไทยเวลาออกเสียง “เอ” ช่องคอมันจะปิด แต่ถ้าออกเสียงเป็น “เฮ” คอจะเปิดออก\nเอาหละปรับ FREQ ไปที่ 2000Hz\nทำปากออกเสียง “เฮ”\nออกเสียงแบบไม่ออกเสียง แล้วให้ลมออกเยอะ ๆ\nปรับความถี่ให้ตรง สลับ bypass และ your response ไปมา\n\n\n4000Hz เสียง อี\n\nความถี่นี้จะเริ่มมีความแตกต่างละ เพราะไม่ต้องเปิดช่องคอ เนื่องจากความถี่เริ่มมีความยาวคลื่นลดลงเหลือแค่ประมาณ 8 ซม. เท่านั้น\nปรับ FREQ ไปที่ 4000Hz\nทำปากออกเสียง “อี”\nออกเสียงแบบไม่ออกเสียง ใช้ลมเยอะ ๆ\nปรับความถี่ให้ตรง สลับ bypass และ your response ไปมา\n\n\n8000Hz เสียง เอสสสสสสส\n\nจากนี้จะเริ่มเสียงที่ไม่สามารถได้เทียบกับสละได้แล้ว\n8000 Hz จะตรงกับเสียงลงท้ายด้วย “s” ในภาษาอังกฤษ หรือ เริ่มต้นเสียง “ส” ในภาษาไทย\nส่วนตัวชอบแบบภาษาอังกฤษมากกว่าเพราะลาก s ยาว ๆ ถ้า ส ในภาษาไทยมันจะเป็นช่วงสั้นไปหน่อย\nเวลาทำเสียงให้เอาลิ้นไปดุนไว้ที่เพดานปากหลังฟัน แล้วออกเสียง(ลม)ผ่าน ลิ้นและเพดานปาก\nเอาหละปรับ FREQ ไปที่ 8000Hz\nลองออกเสียง “เอสสสสสสสสสสสสสส” แล้วเทียบดูครับ\nปรับความถี่ให้ตรง สลับ bypass และ your response ไปมา\n\n\n16000Hz เสียง ทิซส์\n\nเสียงนี้พูดตามตรง ผมไม่รู้ว่าจะสะกดอย่างไร ใครมีไอเดียแชร์ในคิมเมนต์ได้\nถ้าจะออกเสียงนี้ ก็ให้นึกถึงเสียงกลองชุด ซึ่งก็จะตรงกับ closed hi-hat หรือ ฉาบไฮแฮต แหลม ๆ สั้น ๆ\nรูปปากคล้ายๆ เสียง เอส แต่ให้สั้นและเร็ว และระวังน้ำลายกระเด็น : P\nปรับ FREQ ไปที่ 16000Hz\nลองทำเสียง ฉาบไฮแฮต ดูซิตรงไหม (ส่วนตัวรู้สึกยากพอสมควร)\nอย่าลืม สลับ bypass และ your response ไปมา\n\n\n63 Hz ความรู้สึกส่วนท้อง\n\nช่วงความถี่ต่ำ จะเป็นช่วงที่มีความสั่นพ้องกับร่างกาย\nถ้าอ้างอิงจากในคลิป เขาบอกว่า 63Hz จะสั่นพ้องกับช่วงท้อง\nแต่สรีระร่างกายคนเราไม่เหมือนกัน ก็อาจจะไม่สั่นกับจุดอื่นได้ อย่างผมเอง ผมจะรู้สึกสั่น ๆ ที่กามถึงใต้ใบหู\nแต่ก็อาจจะเป็นเพราะผมใช้ลำโพงคอมพิวเตอร์ตั้งโต๊ะก็ได้ถึงรู้สึกแบบนี้ ใครที่มีลำโพงขนาดใหญ่ก็จะรู้สึกได้ง่ายกว่า\n\n\n125 Hz ความรู้สึกช่วงอก\n\nอ้างอิงจากในคลิป เขาบอกว่า 125Hz จะสั่นพ้องกับช่วงหน้าอก\nส่วนผมจะรู้สึกช่วงโพรงจมูก ก็ใครรู้สึกส่วนไหนก็ลองมาแชร์กันครับ\n\n\nวิธีทำแบบฝึกหัด\n\n1 กด pink noise จะมีเสียง pink noise ออกมา\n2 กดที่ Question (e) เสียงของโจทย์จะถูกเล่นออกมา\n3 กดที่ Your Response (r) แล้ว\n4 เลือกคำตอบ\nแนะนำให้กดปุ่ม 2 และ 3 สลับกับเพื่อเทียบเสียง\n5 เมื่อมั่นใจแล้วกด Check Answer (enter)\n6 เช็คคำตอบ ถ้าถูกจะขึ้นสีเขียว ผิดขึ้นสีแดง\n7 กดปุ่ม Next Question (enter) เพื่อทำข้อต่อไป\n\nวงเล็บคือปุ่มบนคีย์บอร์ด\n\n\n\nเพิ่มความยาก\n\nถ้าต้องการเพิ่มความยาก ให้ลองเปลี่ยน Gain Combination ดูเพื่อทดสอบกับความดังระดับต่าง ๆ\n\n\nหลายแบรนด์\n\nหรือเพิ่มจำนวนแบรนด์ที่ถูก EQ โดยเลือก Number of bands\n\n\nใช้ไฟล์เพลง\n\n1 คลิกที่สีเหลี่ยมเพื่อเลือกไฟล์ หรือ ลากไฟล์มาวาง\n2 กดปุ่มเล่นเพลง จากนั้นก็ทำแบบฝึกหัด ได้เหมือนเดิม\nเพลงที่ใช้ผมแนะนำให้ใช้เพลงที่เปิดเทสลำโพงที่ฟังเป็นประจำ\nหรือใครอยากลองเสียงกลองดาวโหลดได้จากลิงค์นี้\ndrive.google.com/file/d/1GJN6FyjhrZYtdCY5n3OJNe_5NF5Be-h7/view\n\n\nสรุป\nเป็นอย่างไรกันบ้างครับกับการฝึกฟังเสียง ขอแค่ใช้เวลาฝึกซักวันละ 5 - 10 นาที ผมรับประกันเลยว่าหูคุณจะดีขึ้น 100%\n\nใครลองเล่นแล้วผลการทดสอบเป็นอย่างไรก็ลองเอามาอวดกันครับ : D\nแต่สิ่งหนึ่งที่ต้องบอกไว้ก่อนคือวิธีนี้ยังขาดไปอีกอย่างหนึ่ง วิธีนี้จะใช้ให้คุณเปรียบเทียบเสียงได้เฉพาะเสียงในระบบของคุณเท่านั้น ไม่ได้เป็นค่ามาตรฐาน เช่น ถ้าระบบของคุณเสียงแหลมเยอะ คุณก็จะรู้แค่ว่าเสียงลำโพงอื่นที่คุณได้ยินนั้น มากกว่าหรือน้อยกว่าระบบของคุณ กล่าวคือคุณอาจจะฟังว่าลำโพงของคนอื่นมีเสียงแหลมน้อยทั้งที่ระบบของเขาเป็น flat studio monitor ที่มีการสนองที่เรียบทุกความถี่แล้ว เพราะว่าหูของคุณเคยชินกับเสียงแหลมเยอะ ๆ แล้วนั่นเอง\nในตอนต่อไปผมจะมาบอกวิธีที่จะหาเครื่องเสียงมาตรฐาน ในราคาย่อมเยาให้ฟังกัน\n"},"Sound-Engineer/Ear-Training-3":{"title":"Ear Training 3","links":[],"tags":[],"content":"มาฝึกหูกันดีกว่า EP 3\nอ่าน EP 1 - ความเข้าใจเรื่องเสียงเบื้องต้น\nwww.facebook.com/groups/791461357947350/permalink/1932596877167120/\nอ่าน EP 2 - โปรแกรมฝึกหู\nwww.facebook.com/groups/791461357947350/permalink/1937814376645370/\nคิดอยู่นานเหมือนกันว่าเอาอย่างไรกับตอนนี้ดี จะใส่วิธีใช้งานโปรแกรมหมดเลยดีไหม แต่นั้นคงจะเขียนหนังสือได้ซักบทสองบทเลยทีเดีบว ดังนั้นผมคิดว่าผมคงจะลงลายแทงไว้ให้ผู้ที่สนใจอยากพัฒนาตัวเองจริง ๆ ไปหาต่อเองน่าจะดีกว่า\nซึ่งตอนนี้ผมก็จะกล่าวถึงอยู่สองส่วน คือ ส่วนของอุปกรณ์ และอีกส่วนคือโปรแกรม\nส่วนของอุปกรณ์ ผมก็จะแนะนำวิธีหาอุปกรณ์ที่เหมาะสำหรับเอามาฝึกหู ซึ่งก็จะมีทางให้เลือกว่าจะลงทุนมากน้อยเท่าไหร่ ส่วนไกด์ของผมคงจะลงแค่ส่วนที่ผมคิดว่าคุ้มค่าที่สุด และวิธีเลือกซื้ออย่างไร\nส่วนของโปรแกรม คือโปรแกรม Equalizer หรือ EQ เนื่องจากดอุปกรณ์ที่ได้มาอาจจะไม่ตรง 100% หรืออาจจะมีปัจจัยอื่นเช่นเสียงจากห้อง ซึ่งก็จะสามารถแก้ด้วย EQ นี้แหละ\n\n\nอุปกรณ์ที่เหมาะกับการฝึกหู\nการฝึกหูเพื่อให้ได้เป็นกลางที่สุด เราก็ควรเลือกลำโพงที่ใช้ฝึกที่มีเสียงเป็นมาจรฐานด้วย ซึ่งถ้าถามถึงมาตรฐานของเสียงลำโพงนั้นคืออะไร ก็ต้องบอกว่ามีตัวหลัก ๆ อยู่ 2 อย่างคือ\n\n\nFlat frequency response - การตอบสนองความถี่ที่เรียบ ๆ\n\n\nLow distortion - ความเพี้ยนต่ำ\n\n\nซึ่งผมขอยกตัวอย่างลำโพงมาซักชุดหนึ่งเพื่อให้เห็นภาพมากขึ้น\nGenelec 8030C\nwww.audiosciencereview.com/forum/index.php\nGenelec 8341A\nwww.audiosciencereview.com/forum/index.php™-studio-monitor-review.11652/\nNeumann KH80 DSP\nwww.audiosciencereview.com/forum/index.php\nต้องขออภัยที่ต้องยกเว็ปต่างประเทศมา เพราะ เว็ปรีวิวที่วัดได้ละเอียดขนาดนี้ในไทยไม่มีจริง ๆ แต่ไม่เป็นถ้าใครไม่แข็งแรงภาษาอังกฤษ ผมอยากให้ดูสองกราฟคือ Frequency response และ Hamonic distortion คุณจะเห็นว่าลำโพงพวกนี้มีกราฟ FR ที่เรียบมาก ๆ +- ไม่เกิน 3 dB และความเพียนยังไม่เกิน 0.5% ซึ่งต่ำมาก ๆ\nลำโพงที่ (ใช้ฝึก) ดีก็จะมีคุณสมบัติประมาณนี้ ติดอยู่อย่างเดียวคือราคามันแพงมาก ราคาเริ่มตั้งแต่ข้างละหลายหมื่นยันหลักแสน ซึ่งสำหรับคนที่ไม่มีทุนพอ (รวมถึงผมด้วย) ก็ต้องหาวิธีการอื่น\n\n\nหูฟัง\nเนื่องจากลำโพงที่ดีนั้นราคาสูงมาก อีกทางเลือกนึงที่ถูกกว่าก็คือหูฟัง ไม่ว่าจะเป็นหูฟัง IEM (IE) หรือ headphone แบบ over ear (OE) ก็ได้เช่นกัน แต่คราวนี้จะมีอีกปัญหานึงขึ้นมาคือ เสียงหูฟังที่ flat จะไม่เหมือนเสียงลำโพงที่ flat เนื่องจากเวลาฟังเสียงจากลำโพงใบหูของคนจะช่วยทำหน้าที่รวมเสียงบางย่านส่งผลให้ได้ยินเสียงย่านนั้น ๆ ดังขึ้น ทำให้เมื่อผู้ผลิตหูฟังถ้าต้องการให้เสียงออกมาเป็นเสียงที่ flat เขาจะต้องบูสเสียงบางย่านขึ้นมาเพื่อชดเชยการทำงานของใบหู\n\n\nเสียง flat สามารถเรียกได้อีกอย่างว่า Neutral\n\nเป้าหมายการบูสเสียงของหูฟังจะเรียกว่า Target curve ซึ่งตัวที่มักจะเจอกันบ่อย ๆ จะได้แก่\n\nFree field จะเป็นเสียงที่ flat เหมือนกับลำโพง flat ในห้องเงียบ หรือ anechoic chamber ซึ่งจะทำให้รู้สึกแห้งๆ ไม่นิยมเอามาใช้กัน\nDiffuse field เป็นเสียง flat แบบที่ฟังในห้อง ทำให้เสียงฟังดูมีชีวิตมากขึ้น\nHarman Neutral เป็นเสียงที่ไม่ได้ flat เสียงทีเดียว แต่เป็นเสียงที่ผ่านการวิจัยโดย Harman มาแล้วว่าเป็นเสียงที่คนทั่วไปชอบมากที่สุด\nEtymotic เป็นอีกเจ้าหนึ่งที่มีการวิจัยเรื่องเสียง ลักษณะจะคล้าย ๆ Diffuse field แต่จะลดความดังช่วง 10k Hz เป็นต้นไปลงมาเล็กน้อย ทำให้เหมือนฟังในห้องจริง ๆ มากขึ้น\nIEF (In-Ear Fidelity) Neutral target - เสียง flat ที่พัฒนาโดย Crinacle ซึ่งใช้ความรู้สึกของเขาเอง แต่ก็เป็นที่นิยมเช่นกัน\n\nส่วนตัวผมแนะนำหูฟังที่เป็น Harman Neutral, Etymotic หรือ IEF ซึ่งมีความใกล้เคียงกันพอสมควร\nนอกจากนี้ target curve จะมีความแตกต่างออกไปตามไมค์ที่ใช้วัดด้วย ดังนั้นก็จะเป็นเรื่องปกติที่คุณอาจจะเห็นกราฟแต่ละที่อาจจะไม่เหมือนกันซึ่งก็ขึ้นอยู่กับไมค์ที่ใช้วัดนี้เอง\n\n3. หาหูฟัง\nปัจจุบันมีฐานข้อมูลออนไลน์ที่มีคนวัดหูฟังรุ่นต่าง ๆ ไว้ ซึ่งคุณสามารถเข้าไปดูได้โดยไม่เสียค่าใช้จ่ายเช่น\n\nsquig.link/\n\nแนะนำ database ของ aftersound เพราะ target เยอะดี aftersound.squig.link/\n\n\ncrinacle.com/graphs/iems/graphtool/\n\nสำหรับ IEM ที่ผมแนะนำก็จะมี 4 ตัวตามกราฟซึ่งราคาจะไม่เกิน 2000 บาท\nส่วนหูฟัง over ear ผมยังไม่มีคำแนะนำเพราะส่วนใหญ่ตัวที่ดีพอราคาจะเกินหมื่น\n\n\nใช้ EQ\nแน่นอนว่าอุปกรณ์ของเรามันก็อาจจะยังไม่ได้ flat หรือ Neutral อย่างสมบูรณ์ ไม่ว่าจะเป็นเพราะตัวอุปกรณ์เอง หรือสำหรับลำโพงอาจจะเป็นเพราะห้องที่ฟัง การใช้ EQ จะเป็นชิ้นส่วนสุดท้ายที่จะทำให้ระบบของคุณสมบูรณ์ที่สุด\n\nถ้าเป็น Android โปรแกรม EQ ที่นิยมใช้กันคือ Wavelet\nplay.google.com/store/apps/details\nซึ่งใช้งานได้ง่าย สามารถใส่รุ่นหูฟังของคุณลงไป โปรแกรมนี้จะ EQ ให้กลายเป็น Harman target โดยอัตโนมัติ ข้อเสียเดียวคือโปรแกรม webtet.net/apcl/ ไม่ค่อยเหมาะที่จะใช้บนโทรศัพท์\nส่วนบน Windows ก็จะมีโปรแกรม Equalizer APO\nsourceforge.net/projects/equalizerapo/\nซึ่งอาจจะใช้ยากเล็กน้อย แต่ผมบอกเลยว่าคุ้มที่จะศึกษา\nหรือถ้าต้องการลง UI เพื่อให้ใช้งานง่ายขึ้น ก็สามารถ download Peace Equalizer, interface Equalizer APO มาเพิ่มได้\nsourceforge.net/projects/peace-equalizer-apo-extension/\nวิธีใช้งานผมแนะนำให้ลองหาใน Youtube ดูก่อน ถ้าใครมีติดปัญหาส่วนไหน จะ comment ถามหรือ PM มาถามก็ได้ครับ\n\n\nโปรไฟล์ Eq สำหรับหูฟัง\n\nautoeq.app/\nสำหรับคนใช้หูฟัง คุณสามารถหา EQ profile ได้ง่าย ๆ ด้วยเว็ป AutoEQ โดยใส่รุ่นหูฟังคุณลงไป แล้วเลือก equalizer app เป็น EqualizerAPO ParametricEq หรือ EqualizerAPO GraphicEq จากนั้นก็ download เพื่อ import ใน EqualizerAPO ได้เลย\nอีกทางเลือกหนึ่งคือ ใช้เว็ปในข้อ 3\naftersound.squig.link/\ncrinacle.com/graphs/iems/graphtool/\nจะมีเมนูสำหรับสร้าง Eq profile เช่นกัน\nวิธีใช้\nHow to TUNE your headphones (the easy way!)\nwww.youtube.com/watch\n\n\nวัดด้วย REW\n\nถ้าคุณใช้ลำโพง ทางเดียวที่คุณจะ EQ ให้ระบบของคุณ flat ได้คือ คุณจะต้องใช้โปรแกรมวัดเสียง\nเรื่องอุปกรณ์สำหรับวัด\nwww.facebook.com/groups/791461357947350/permalink/1902911593468982/\nโปรแกรม Room EQ Wizard (REW)\nwww.roomeqwizard.com/\nโปรแกรม REW จะมี auto EQ ให้ใช้ในตัว และสามารถ export เป็น ParametricEq มาใส่ EqualizerAPO ได้เลย\nเอาหละเรื่องนี้ผมขอลงลึกเพียงเท่านี้ดีกว่า ถ้าลงลึกมากไปรับรองว่ายาว ถ้าใครมีคำถามหรือติดปัญหาการใช้งานอะไรก็คอมเมนหรือทักมาได้ครับ\n\nEqualizer APO\nsourceforge.net/projects/equalizerapo/\nAutoEq\nautoeq.app/"},"Sound-Engineer/Sound-localization":{"title":"Sound localization","links":[],"tags":[],"content":"จากคำถามว่า\nในระบบเสียง 2.1 วางลำโพงซ้าย - ขวาไว้บนโต๊ะ และวางซับวูฟเฟอร์ไว้ใต้โต๊ะ\nช่อง ซ้าย - ขวา มีฟิวเตอร์ความถี่สูงผ่าน (high pass filter) และ\nช่องซับวูฟเฟอร์ มีฟิวเตอร์ความถี่ต่ำผ่าน (low pass filter)\nซึ่งทั้งคู่มีความถี่คัดออฟที่ 110 Hz\nคำถามคือ\nคุณจะได้ยินเสียงเบสที่ต่ำกว่า 110 Hz จาก “ด้านบน” หรือ “ด้านล่าง”\nวันนี้เราจะมาหาคำตอบกัน\n\nบน หรือ ล่าง ใส่คำตอบของตัวเองไว้ในคอมเมนต์ก่อนไปต่อ\nถูกผิดไม่ต้องกลัว ไม่มีใครว่าหรอก เพราะมันเป็นเรื่องที่ลึกและคนไม่ค่อยจะรู้กัน\n\n\n2. การรับรู้ทิศทางของเสียงของมนุษย์นั้น จะมีอยู่ 3 แบบ\n1 Interaural level difference (ILD) หรือ ระดับเสียงที่ต่างกันระหว่างหูทั้งสองข้าง\n2 Interaural time difference (ITD) หรือ เวลาที่เสียงเข้าหูทั้งสองข้างไม่พร้อมกัน\n3 Head Relate Transfer Function (HRTF) หรือเสียงที่เปลี่ยนไปเนื่องจากสรีระของศีรษะ\n\n\nILD - Interaural level difference\nระดับเสียงที่ต่างกันระหว่างหูทั้งสองข้าง\n\nเป็นการรับรู้ทิศทางจากความดังของเสียงที่ไม่เท่ากัน เนื่องจากหัวของเราบังไว้อยู่\nตามคุณสมบัติของคลื่น จากคลื่นลูกหนึ่ง หรือ ครึ่งหนึ่งของความยาวคลื่น\nถ้าลูกคลื่นสั้นกว่าขนาดของวัตถุมาก ๆ คลื่นจะสะท้อนวัตถุ\nถ้าลูกคลื่นใกล้เคียงขนาดของวัตถุ คลื่นจะเกิดการเบี่ยงเบน\nถ้าลูกคลื่นใหญ่กว่าขนาดของวัตถุมาก ๆ คลื่นจะผ่านวัตถุไปเลยเหมือนไม่มีอะไรบัง\nจากการวิจัย หัวของมนุษย์ใหญ่ประมาณ 21.5 ซม.\nซึ่งจะไปตรงกับความถี่คลื่นประมาณ 800 Hz\nดังนั้นเมื่อคลื่นมีความถี่ต่ำกว่า 800 Hz สมองมนุษย์ก็จะใช้วิธีแยกทิศทางถัดไป\nรูปจาก pressbooks.umn.edu/sensationandperception/chapter/interaural-level-difference-draft/\n\n\nITD Interaural time difference\n\nเวลาที่เสียงเข้าหูทั้งสองข้างไม่พร้อมกัน\nถ้าจะดูจากระยะห่างระหว่างหู 21.5 ซม. เมื่อคำนวนความเร็วเสียง จะได้ค่าดีเลย์ระหว่างหูคือ 626 us\nถ้าเป็นเสียงที่มาเพียงคลื่นเดียว หรือ impulse สมองเราจะสามารถรับรู้ได้จากเวลาที่เสียงเข้าถึงหูปกติ แต่ถ้าเป็นเสียงคลื่นไซน์ (sine wave) สมองก็ยังสามารถรับรู้ทิศทางได้จากการเปลี่ยนแปลงของเฟส\nถ้าคำนวนเฟสที่เปลี่ยนไปของคลื่นในเวลา 626 us จะได้ค่าดังนี้\n800 Hz → 180°\n400 Hz → 90°\n200 Hz → 45°\n100 Hz → 22.5°\n50 Hz → 11.25°\nแต่อย่างไรก็ตามเมื่อเฟสของทั้งสองหูมีความต่างกันน้อยลง สมองก็จะเริ่มจับทิศทางของเสียงได้ยากขึ้น ซึ่งเดียวจะกล่าวต่อไป\nรูปจาก\nwww.researchgate.net/figure/Interaural-Time-Difference-ITD-and-Interaural-Level-Difference-ILD_fig1_276473132\n\n\nHRTF - Head Relate Transfer Function\nเสียงที่เปลี่ยนไปเนื่องจากสรีระของศีรษะ\n\nตัวนี้เป็นเทคโนโลยีใหม่ ที่ได้มาจากการใช้ binaural microphone ที่จำลองเป็นศรีษะของคน แล้วนำไปวัดเสียงที่เกิดขึ้นในต่ำแหน่งต่าง ๆ ในพื้นที่ 3 มิติ แล้วได้การตอบสนองความถี่ไม่เท่ากัน\nจากนั้นจึงนำการตอบสนองความถี่มาออกแบบเป็นฟิวเตอร์และ effect สำหรับโปรแกรมมิกซ์เสียง\nเราอาจจะได้ยินเทคโนโลยี่นี้ในชื่อ Immersive Audio ซึ่งใช้กับหูฟัง\nแนะนำคลิปศึกษาเพิ่มเติม\nwww.youtube.com/watch\nรูปจาก\nwww.mathworks.com/help/audio/ref/interpolatehrtf.html\n\n\nทิศทางของเบส\nเนื่องจากเบสมีความถี่ต่ำกว่า 800Hz สมองมนุษย์จะใช้วิธีรับรู้ทิศทางด้วยวิธี ITD\nถ้าเป็นเสียงคลื่นลูกน้อย ๆ สมองก็จะพอบอกได้ว่าเสียงมาจากต่ำแหน่งไหน แต่ในชีวิตจริงเสียงจะมาเป็นคลื่นไซน์ ต่อเนื่องเสมอทำให้สมองจะต้องใช้การเปลี่ยบเทียบเฟสหูซ้าย-หูขวาแทน\n\nแต่ว่าเบสที่ความถี่ต่ำมาก ๆ เช่น 50Hz จะมีเฟสต่างกันแค่ 11.25° เท่านั้นทำให้ไม่สามารถรับรู้ทิศทางได้อีกต่อไป\nสมองของมนุษย์จะเริ่มหาทิศทางของเสียงไม่ได้ จะเริ่มขึ่นเมื่อความถี่ต่ำกว่าความถี่หนึ่ง\nซึ่งความถี่นี้ในวงการ home theater จะมักใช้ที่ค่า 120 Hz จึงมักจะเห็นจุด cutoff ของซับวูฟเฟอร์ชุด home theater ต่ำกว่า 120Hz เสมอ\nและถ้าดูวิธีติดตั้งซับวูฟเฟอร์ของชุดโรงหนัง เขาจะเอาซับไปวางที่ข้างโต๊ะทีวีบ้าง ที่นั่งบ้าง มุมห้องบ้าง หรือจุดไหนก็ได้ตราบใดที่เสียงออกมาดี\n\n\nดังนั้นคำตอบของคำถามนี้จะเป็นอะไรหละ ไม่มีทิศทางอย่างนั้นหรือ\n\n\n\nเฉย\nจริง ๆ แล้วโน้ตตัวหนึ่ง ๆ ของเครื่องดนตรีนั้นมันไม่ได้มีแค่ความถี่เดียว\nเสียงต่าง ๆ ของเครื่องดนตรีจะมาพร้อมกับความถี่ harmonic ด้วยเสมอ ซึ่งก็จะเป็นความถี่ที่มากพอที่สมองจะสามารถบอกทิศทางได้\n\nเช่นเมื่อลำโพงเล่นเสียงกระเดื่องของกลองชุด ซัพวูฟเฟอร์ก็จะเล่นเสียงเบสใหญ่ ๆ ส่วน harmonic อื่น ๆ และเสียงจากหน้ากลอง ก็จะเล่นจากลำโพงซ้าย ขวา ด้านบน ทำให้สุดท้ายแล้วเราจะรู้สึกเหมือนว่าได้ยินเสียงมาจากด้านบนนั่นเอง\nอีกตัวอย่างหนึ่งสมมติว่าคุณกำลังดูหนังระบบ 7.1 แล้วมีเสียงระเบิดมาจากด้านขวา ลำโพงซับวูฟเฟอร์ที่อยู่มุมห้องด้านซ้ายก็เล่นเสียงระเบิดต่ำ ๆ ใหญ่ ๆ ออกมา ส่วนลำโพงช่องขวามือก็เล่นเสียง harmonic อื่น ๆ สมองของคุณก็จะนำข้อมูลเสียงทั้งสองมารวมกัน แล้วก็สรุปว่าเป็นเสียงระเบิดออกมาจากขวามือ เหมือนเป็นการ “จิตพาไป” จริง ๆ\nดังนั้นคำตอบของคำตอบข้อนี้คือ\n”ด้านบน”\nหรือถ้าดูให้ลึกขึ้น ปกติซาวด์เอ็นจิเนียร์นั้นจะเอาเครื่องดนตรีเบสไว้ตรงกลางเสมอ ทำให้เสียงเบสที่เกิดขึ้นนั้นจะรู้สึกว่ามาจากตำแหน่งระหว่างลำโพงทั้งสองตัว หรือ center image นั่นแหละครับ\nรูปจาก\nwww.soundonsound.com/techniques/physics-percussion\n\n\nข้อควรระวังอย่างหนึ่ง\nถ้าท่านสามารถรู้ทิศทางของซับวูฟเฟอร์ได้ และซับวูฟเฟอร์นั้นเล่นความถี่ที่ต่ำว่า 120Hz อยู่แน่ ๆ ต้องดูว่าเสียงที่ซับวูฟเฟอร์นั้นมีเสียงความเพี้ยน (Harmonic Distortion) ปนมาด้วยหรือไม่ ซึ่งก็มีสาเหตุต่าง ๆ มากมาย ตั้งแต่ปัญหาการออกแบบ การเปิดดังเกินไป หรือมีสิ่งของบางอย่างสั่นอยู่ข้าง ๆ ก็เป็นได้\n\nรูปจาก\nemaudio.com/got-excursion/\n"},"Sound-Power":{"title":"Sound Power","links":["Thiele-Small-Parameters"],"tags":[],"content":"Sound Power (P)\nP=ρcAp2​⋅cosθ\n\nA is the area of the surface;\nρ is the mass density;\nc is the sound velocity;\nθ is the angle between the direction of propagation of the sound and the normal to the surface.\np is the sound pressure.\n\nIn air, ρ = 1.2 kg/m3 and c = 343m/s\nSound Pressure Level SPL Lp​ - (dB)\nSound pressure p (N/m2) or (Pa)\nLp​=20logp0​p​\nwhere p is sound pressure in pascals (Pa)\nand p0​=20\\microPa accordance with ISO 1683.\np0​ comes from lowest sound pressure that human can hear at 3,000−4,000Hz\nSound Level (L)  vs  Distance (r)\nL1​−L2​=∣20⋅logr2r1​∣\nSound level drop by 6 dB per double the distance.\nSound intensity (I)\nP=AI\nwhere\n\nA stands for the area;\nI stands for the sound intensity.\n\nSound energy density (ω)\nP=Acω\nwhere\n\nc stands for the speed of sound;\nw stands for the sound energy density.\n\nCalculator\nmehlau.net/audio/spl/\nfunction doCalc() {\n\tvar efficiency = eval(formSPL.efficiency.value * 1)  // SPL (1W/1m)\n\tvar dBPower = eval(10 * (Math.log(formSPL.power.value) / Math.log(10)));  // Amp Power Watt\n\tvar dBDistance = eval(-20 * ((Math.log(formSPL.distance.value) / Math.log(10)))); // m\n\tvar dBPlacement = eval(formSPL.placement.value);\n\tvar dBResult = eval(efficiency + dBPower + dBDistance + dBPlacement * 1);  // dB\n\tdBResult = round(dBResult, 1);\n\tformSPL.result.value = dBResult;\n}\n \n&lt;option value=&quot;0&quot;&gt;Away from walls&lt;/option&gt;\n&lt;option selected value=&quot;3&quot;&gt;Close to wall (60-120cm)&lt;/option&gt;\n&lt;option value=&quot;6&quot;&gt;In corner (45-60cm)&lt;/option&gt;\nSPL\nSPL\nSPL @ 1W/1m\nHow many decibels (dB) are doubling a sound\n ×2 the sound intensity is +3 dB.\n ×2  the sound pressure is +6 dB.\n ×2  the loudness feeling is about +10 dB.\n ×2 the power (Watt) is +3 dB. 10 dB = 10-fold\n ×2 the Voltage (V) or Current (I) is +6 dB. 20 dB = 10-fold\nref. Damping of sound level\nThe human perception of loudness\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPressure Level ChangeVolume LoudnessVoltage / Sound pressureAcoustic Power / Sound Intensity+40 dB1610010000+30 dB831.61000+20 dB410100+10 dB2 double3.16 = 10​10+6 dB1.52 times2 double4+3 dB1.23 times1.414 times = √22 double±0 dB**- - - 1.0 - - - **- - - 1.0 - - -- - - 1.0 - - -−3 dB0.816 times0.707 times0.5 half−6 dB0.660 times0.5 half0.25−10 dB0.5 half0.3160.1−20 dB0.250.10.01−30 dB0.1250.03160.001−40 dB0.06250.010.0001Log. sizePsycho sizeField sizeEnergy sizedB changeLoudness multiplierAmplitude multiplierPower multiplier\nFrom Genelec\nwww.genelec.com/correct-monitors\nSound Basics\nSound is ultimately pressure which exists in a sequence of waves which propagates through compressible media such as air or water. Sound travels approximately 344 m/s (1130 ft/s). It takes 3 ms for sound to travel 1 metre (3,3 ft).\nIn free-field conditions (no walls, floor, or ceiling) the sound volume drops 6 dB when the distance doubles.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDistanceSound LevelVolume Drop1 m100 dB0 dB2 m94 dB-6 dB4 m88 dB-12 dB\nSound level increases by 3 dB when the amplifier power doubles.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAmp PowerSound LevelVolume Increase100 W85 dB0 dB200 W88 dB+3 dB400 W91 dB+6 dB\nThe industry standard reference sound pressure level (SPL) for cinema and TV sound production work is between 82 and 85 dB at the listening position.\nFrequency Spectrum\nThe frequency spectrum of an electrical signal is, by definition of Collins online dictionary, “the distribution of the amplitudes and phases of each frequency component against frequency”. The audible frequency spectrum covers 10 octaves (up to 40 Hz, 80, 160, 320, 640, 1’280, 2’560, 5’120, 10’240, 20’480 Hz) which can conveniently divide the spectrum as follows.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSubsonic bass frequenciesbelow 16 HzNot audible for humans.Very low frequencies16 – 40 Hz  40 – 80 HzLowest audible octave for humans.  Music low frequencies, kick drums, bass instrumentsLow frequencies80 – 160 Hz  160 – 320 HzLow register of a grand piano.  Middle C of a piano.Midrange frequencies320 – 1,280 HzMusic midrange frequenciesUpper midrange frequencies1,280 – 2,560 Hz  2,560 – 5,120 HzLow-order harmonics of most instruments.  The ear is the most sensitive in this range.High frequencies5,120 – 10,240 HzBrightness and harmonicsExtremely high frequencies10,240 – 20,480 HzHighest harmonics. Inaudible to humans above 20 kHz\n"},"Speaker-Placement":{"title":"Speaker Placement","links":["Enclosure-Types/MTM-Speaker"],"tags":[],"content":"Subwoofer\n\nmost human cannot hearing the direction of the sound under 180 Hz\n120 Hz is a good crossover point\n2 subwoofers are good to prevent room mode\n4 subs is better than 2!\n\n1 sub woofer placement\n\ncenter on one side of the room\n\n2 sub woofer placement\n\ncenter on opposite side of the room\n1/3 point of the room\n\n4 woofer placement\n\ncenter on each side of the room\n1/4 position on each side of the room\n\nLeft Center Right\n\nideally\n\nAll behind the screen, screen must be audio transpirent\nC is on center\nL on left center and R on right center\n\n\n3 ways speakers\n\nL R on the left and right close to the TV\nC on the bottom of the TV\n\n\nCenter and MTM configuration speaker\n\nMTM will generate comb filter\nit is not good for front sound\n\n\n"},"Speaker-parts-and-Materials":{"title":"Speaker parts and Materials","links":[],"tags":[],"content":"Voice Coil\n\nLow efficiency ~ 3-5% power convert: electric → 3-5% acoustic power + Heat\ngenerating heat\n\nCoil\n\nCopper wire\n\nEg AWG31 4 layer DCR 3.5 Ohm\n\n\nCopper clade aluminum wire\n\nForm\nheat management\n\nfiber glass\nAluminum\npoly MI film (Capton)\n\nCone\n\nPaper → most common\n\ncraft paper abaca fiber\n\n\npolypropylene → out-door mostly woofer\ncarbon fiber → out-door in-door durable\nacrylic treat fiber\n\nMagnet\nFerrite - heavy, low cost, common\nNeodymium - 10 time power of ferrite and also the cost\nAlnico - (Aluminum + Nickel + Cobalt) very high cost, find in guitar amp\nT-Yoke\nFront plate\nDemodulating ring / Short turn / Faraday loop\nBecause of the pole piece of T-yoke act like a iron core of the inductance (voice coil), when the voice coil extrude out the area of iron core inside the voice coil will be reduced. That will cause a distortion, called inductance distortion\nBasket\nStamp Steel -\nCast Aluminum - higher end\nSpider\n\ntreated cloth\n\nSurround\nRubber\npolyether foam\nTinsel wire\ncopper wire wrap around keplar\nDust cap\nGasket\n\ncompatible form\n\nTweeter\nDome\n\n\naluminium\n\n\naluminium-magnesium alloys\n\n\ntitanium\n\n\nberyllium (hazardous)\n\n\npolyester film\n\n\nsilk\n\n\npolyester fabric\n\n\n[add] polymer resin\n\n"},"Spec":{"title":"Spec","links":["tags/ts-parameters"],"tags":["ts-parameters"],"content":"ts-parameters\nตัวอย่างที่ไม่ดี\nwww.aliexpress.com/i/1005005432680072.html\nDescription\nSize: 3 inch\nImpedance: 4Ω/ 8Ω\nRated power: 20W/30w\nPackage include: 2pcs speaker\n\nตัวอย่างพอดูได้\nwww.aliexpress.com/item/1005005820259984.html\nSpeaker type: subwoofer\nRated power: 35W\nMaximum power: 60W\nRated impedance: 4 Ω / 8 Ω\nFrequency response range: 85HZ-5KHZ\nResonance frequency: 85HZ\nSensitivity: 87db±3db\nBasin material: Polymer pp\nMaximum outer diameter: 89.5 mm\nSpeaker height: 51 mm\nScrew diagonal distance: 83 mm\nVoice coil diameter: 25 mm\nQts :0.43\n\n\nตัวอย่างพอดูได้ แต่ต้องระวัง\nwww.aliexpress.com/item/1005002028341057.html\n4 inch subwoofer HiFi glass fiber cone speaker\nRated power: 40W\nMaximum power: 80W\nImpedance: 4 Ohm, 8 Ohm\nFrequency: 69-2KHz\nSensitivity: 88db±3db\nEquivalent volume: 8L\nQts: 0.49\nFo: 69Hz\nVoice coil: 25mm\nNet weight: 1.05kg\n\nค่าที่วัดได้จริง ๆ\nTS Parameters file\nRoom EQ V5.20.13\nDated: Jul 23, 2023 11:23:25 PM\nFrom measurement sub Jul 23\nZmin 3.58 ohm\nfmin 249 Hz\nf3 633 Hz\nLe(f3) 0.717 mH\nMotional impedance parameters\nR0 18.47 ohm\nCMES 457.3 uF\nL0 9.663 mH\nbeta 0.0002\nomega0 705.6\nBlocked impedance parameters\nRDC 3.50 ohm\ndR -0.39 ohm\nRe 3.11 ohm\nLeb 0.0 uH\nLe 1.319 mH\nRss 627.9 ohm\nKe 0.1450 S-H\nThiele-Small parameters\nfs 75.7 Hz\nQms 4.014\nQes 0.676\nQts 0.578\nFts 130.9\nMms 11.48 g\nCms 0.385 mm/N\nRms 1.360 kg/s\nVas 1.52 litres\nBl 5.010 Tm\nEta 0.09 %\nLp (1W/1m) 81.78 dB\nDd 8.20 cm\nSd 52.8 cm^2\nAdded mass 1 measurement:\nAdded mass 1 10.000 g\nAdded mass 2 measurement:\nAdded mass 2 5.000 g\nAir temperature 26.0 C\nAir pressure 1013.25 mB\nAir density 1.1799 kg/m^3\nSpeed of sound 346.7 m/s\nตัวอย่างที่เป็นมาตรฐาน\n"},"Spectral-Decays":{"title":"Spectral Decays","links":["tags/spectral_decays","tags/waterfall","Room-Mode"],"tags":["spectral_decays","waterfall"],"content":"spectral_decayswaterfall\nXmin​: 200 Hz\nXmax​: 20,000 Hz\nYmax​: Max SPL\nYmin​: Max SPL - 25 dB\nZmin​: 0\nZmax​: 4.5 ms\nwindows: IR response\n\n[/] CSD (Cumulative Spectral Decay) mode\nRise: 0.580 ms\nunsmoothed\n\nWave should be disappeared before 2 ms\nWhy measure only frequency greater than 200 Hz?\nThe frequency below 200 Hz will be effected by Room Mode."},"Standard/มอก.":{"title":"มอก.","links":[],"tags":[],"content":"คำถาม\n\n\nสินค้าลำโพงแบบไหนต้องขอ มอก. บ้าง\n\n\nผลิตภัณฑ์อุตสาหกรรมลำโพง\n\nพร้อมขยายสัญญาณ\nไม่มีวงจรขยายสัญญาณ\n\n\n\nผลิตภัณฑ์จากการจ้างทำของ\n\n\nผลิตภัณฑ์อุตสาหกรรมลำโพงขนาดเล็ก\n\n\nสินค้าที่ประดิษฐ์ขึ้นมาเพื่อใช้เอง\n\n\n\n\nลำโพงและอุปกรณ์แต่ละชนิดต้องผ่าน มอก. อะไรบ้าง\n\nลำโพง แบบไม่มีวงจรขยายสัญญาณ หรือต้องใช้วงจรขยายสัญญาณภายนอก\nลำโพงพร้อมขยายสัญญาณ ที่ต่อไฟประธาน\nลำโพงพร้อมขยายสัญญาณ ที่ต่อไฟจากอะแดปเตอร์\n\nแรงดันภายในเกิน 50 VAC 75VDC\n\n\nลำโพงที่มีแบตเตอรี่ภายใน\n\nน้อยกว่า 5 V\nboost converter\n\n\nอะแดปเตอร์ (เครื่องจ่ายไฟฟ้า)\nเครื่องขยายสัญญาณ\n\n\n\nค่าใช้จ่ายในการขอ\n\n\nข้อปฏิบัติเพื่อความคุมคุณภาพผลิตภัณฑ์ ให้ได้ตาม มอก.\n\nการตรวจติดตามภายหลังได้รับใบอนุญาตฯ จาก สมอ.\n\nขอดูบัตรพนักงาน สามารถติดต่อ 02 202 3321-2 เพื่อตรวจสอบ\n\n\n\n\n\nผู้จำหน่ายสินค้าที่ไม่มีมอก. มีความผิดไดบ้าง\n\nยึดหรืออายัด?\nอาญา\nจำคุก? &lt;1 เดือน\nปรับ? 5000 - 50000 บาท\n\n\n\nเครื่องหมายมาตรฐานสําหรับผลิตภัณฑ์ชุมชน (มผช.)\n\n\nปัจุบันมีอะแดปเตอร์ ที่ไม่ผ่าน มอก. ขายบนร้านค้าออนไลน์จำนวนมาก ในฐานะผู้บริโภคควรทำอย่างไร\n\n\nสินค้าที่ผู้บริโภคซื้อตรงจากต่างประเทศเพื่อใช้เอง (ไม่ได้ไว้เพื่อจำหน่าย) โดยสินค้านั้นอาจจะไม่ได้มาตรฐาน หรือมีมาตรฐานแต่ไม่ผ่านการรับลองโดย มอก. ผู้บริโภคมีความผิดหรือไม่\n\n\nIEC 62368-2023 พึ่งออกจะมีอัพเดทตามเร็ว ๆ นี้ไหม\n\n\nถ้าสินค้ามีสัญลักษณ์ CE EN หรือ UL อยู่แล้วจะใช้ได้เลยไหม\n\n\nเล่มที่รู้จัก\nมอก.62368 เล่ม 1-2563 - ลำโพง แอมป์ เครื่องจ่ายไฟฟ้า\nมอก. 1195 - อุปกรณ์อิเล็กทรอนิกส์ ที่ใช้ไฟประธาน\nมอก. 2217 - แบตเตอรี่  มอก. 2879-2560 - แบตเตอรี่พกพา\nIEC 62133-1 62133-2\nเลขหมายโทรศัพท์ : สำนักงานมาตรฐานผลิตภัณฑ์อุตสาหกรรม\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nลำดับทีกอง/สำนัก/ศูนย์โทรศัพท์1โอเปอเรเตอร์02 430 68152กองควบคุมมาตรฐาน02 430 68213กองตรวจการมาตรฐาน 102 430 68224กองตรวจการมาตรฐาน 202 430 68235กองตรวจการมาตรฐาน 302 430 68246สำนักงานคณะกรรมการมาตรฐานแห่งชาติ02 430 68257กองกำกับองค์กรด้านการมาตรฐาน02 430 68268กองบริหารมาตรฐานผลิตภัณฑ์ชุมชน02 430 68279กองกำหนดมาตรฐาน02 430 682810สำนักงานเลขานุการกรม02 430 682911กองกฏหมาย02 430 683012กองบริหารมาตรฐานระหว่างประเทศ02 430 683113กองยุทธศาสตร์และแผนงาน02 430 683214กองส่งเสริมและพัฒนาด้านการมาตรฐาน02 430 683315ศูนย์เทคโนโลยีสารสนเทศและการสื่อสาร02 430 683416กลุ่มตรวจสอบภายใน02 430 6820\nถ้าผมมีคำถามเกี่ยวกับการขอ มอก.\nอยากจะติดต่อสอบถามเพื่อเป็นความรู้ สามารถติดต่อไปทางไหนได้บ้างครับ"},"Standard/มาตรฐานการวัดลำโพง":{"title":"มาตรฐานการวัดลำโพง","links":[],"tags":[],"content":"TIS1538-2552.P65 (fio.co.th)\nIEC 60268-5:2003"},"Thiele-Small-Parameters":{"title":"Thiele-Small Parameters","links":["Sound-Power"],"tags":[],"content":"Or T/S Parameters\nF\nFs​ - driver resonance frequency\nany speaker will have a hard time to play any frequency below the Fs​\nfs​=2πCms​⋅Mms​​1​\nF0​ - The frequency when frequency response start to drop\nF3​ - frequency where the 3 decibel power drop occurs, less than this you will feel that the sound is quieter\nFb​ - box resonance frequency\nQ\nQ - Quantity factor, the magnification of resonance factor of any resonant device or circuit. A driver with a high Q is more resonant than one with a low Q.\nQ can also be called as “damping” lower Q will have more damping (more damping is more clear more good things)\nQms​ - the mechanical Q of the driver.  (Spring from surround and spider)\n\nHigher Qms​ drivers displaying a higher impedance peak\n\nQes​ - the electrical Q of the driver.  This causes by Back EMF (same as motor)\nQts​ - the total Q of the driver at Fs.\nQts​1​=Qms​1​+Qes​1​\nQts​=Qes​+Qms​Qes​⋅Qms​​\nFinding Qms​ and Qes​\n\nZmax​ = impedance at Fs​\nZ0​=Re​×Zmax​​\nfind F1​ and F2​ in impedance curve (F1​ and F2​ have difference meaning from F3​)\nQms​=F2​−F1​Fs​​×Re​Zmax​​​\n Qms = Fs/(F2 - F1)*sqrt(Zmax/Re)\n\nQes​=Re​Zmax​​−1Qms​​\nQes​=F2​−F1​Fs​​×Zmax​−Re​Zmax​⋅Re​​​\nQes = Qms/(Zmax/Re - 1)\n\nRelation with other variables\nQes​=(Bl)22π⋅fs​⋅Mms​⋅Re​​=(Bl)2Re​​Cms​Mms​​​\nQms​=Rms​2π⋅fs​⋅Mms​​=Rms​1​Cms​Mms​​​\nref. Measuring transducer Qms, Qes, Qts (wavecor.com)\nCms​ - Compliance\nHigher (loose suspension) → yield a lower frequency\nLower (stiffer suspension) → yield a higher frequency\nRe​ - DC resistance (normally 30% less than impedance)\nImpedance, Z - AC resistance\nBl - Magnetic force factor / motor strength (T⋅Nm)\nB×l. Which is (the flux density) x (the length of the voice coil)\nOr, actually\nBl=B×lsinθ\nθ=90°,sin(90°)=1\nSo,\nBl=B×l\nRelative to other parameters\nQes=Bl22π⋅Fs​⋅Mms⋅Re​​\nBl=Qes2π⋅Fs​⋅Mms⋅Re​​​\nDimensions\nV\nVas - air volume equal equal to compliance of driver suspension (springiness of driver)\n= Cms​ describe in volume\nVas​=ρ⋅c2⋅Sd2​⋅Cms​\nVb - Net enclosure internal volume\nXmax - maximum distance that coin can travel without distortion\n(they said that travel of 115% Xmax will not introduce audible distortion)\n\n\nIn 5-7” speaker Xmax should be more than 3mm\nIn 8-12” speaker Xmax should be more than 6mm\nXmech - maximum distance a speaker can travel without damaging the driver\n&gt;Xmax  = Distortion\n&gt;Xmech = Damage!!\nSd - effective area of the cone (πr2)\nmore Sd = more bass\nless Sd = more spread high frequency\nMmd = moving mass (mass of Coil + Cone + spider/2 + surround/2)\nMms = Mmd + mass of air in front of the cone\nHigh Mmd → Low Fs​\nLow Mmd → High Fs​\nSPL\nSPL\nunits\n\ndB@W/m\ndB@2.83V/m\n\nDifference driver Impedance will effect dB@2.83V/m unit\nW​=V2/Z=2.832/8=8/8=1​\ndB\\;@\\;2.83V/m\\;@\\;8\\ohm &amp;= \\pm 0\\;dB\\;@\\;W/m \\\\\ndB\\;@\\;2.83V/m\\;@\\;6\\ohm &amp;= -1.3\\;dB\\;@\\;W/m \\\\\ndB\\;@\\;2.83V/m\\;@\\;4\\ohm &amp;= -3\\;dB\\;@\\;W/m \\\\\ndB\\;@\\;2.83V/m\\;@\\;2\\ohm &amp;= -6\\;dB\\;@\\;W/m \\\\\n\\end{split}\ntwice the power give +3 dB\nhalf the power give -3 dB\none tenth the power give -10 dB\nΔdB=10log(P2​P1​​)\nEx\n1W2W4W8W10W16W​⇒⇒⇒⇒⇒⇒​90dB93dB96dB99dB100dB102dB​\nMax SPL\nMaxSPL=Efficiency@W/m+10×log(MaxPower)\nPerceived loudness\n\n3 dB difference is difficult to hear\n10 dB considered to be twice as loud\n\nη(n0​) Efficiency\n1 Watt of acoustic power = 112 dB SPL 1W/1m\nSPL=112+10logη\nη=1010SPL−112​\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEfficiencyPercentSensitivity0.220 %105 dB0.110 %102 dB0.055 %99 dB0.022 %95 dB0.011 %92 dB0.0050.5 %89 dB0.0020.2 %85 dB0.0010.1 %82 dB\nη relation to other parameters\nη=(2πc⋅Mms2​Re​ρ⋅B2⋅l2⋅Sd2​​)×100%\nη=(c3⋅Qes​4π2⋅fs3​Vas​​)×100%\n** ρ/2π =5.365×10−4 m2⋅s/kg\n** 4π2/c3=9.523×10−7s3/m3\n** @ 25 °C and 50% humidity\nref. Efficiency and sensitivity conversion - sengpielaudio Sengpiel Berlin\nHofmann’s Iron Law\nη=k⋅Vb​⋅f33​"},"Tone":{"title":"Tone","links":[],"tags":[],"content":"\nเข้าวงการลำโพง EP.2 มือใหม่ต้องรู้ ศัพท์รีวิวเสียง คำไหนคืออะไรบ้าง? (youtube.com)"},"VituixCAD":{"title":"VituixCAD","links":["tags/VituixCAD"],"tags":["VituixCAD"],"content":"VituixCAD\nRadiator type\n\nSome variables\nQa\nNo filled = 120\nMinimal filled = 80\nWalls coverage = 20\nHeavy filled = 5\nQl\nNo leaks = 30\nminimal leaks = 15\nminor leaks = 10\nVented\nQa\nNo filled = 120\nMinimal filled = 80\nWalls coverage = 20\nHeavy filled = 5\nQl\nNo leaks = 30\nminimal leaks = 15\nminor leaks = 10\nQp\nNo flush ends = 70\nOne flush end = 80\ntwo flush ends = 90\none flared end = 120\ntwo flared ends = 140\nEnd correction\nTwo free ends = 0.614\nOne flanged end = 0.732\nTwo flanged ends = 0.850"},"Vow-sound":{"title":"Vow sound","links":[],"tags":[],"content":"“Vow sound” is a alphabet sound that you will herd at difference frequencies\noo - 250 Hz\no - 500 Hz\nah - 1000 Hz\na - 2000 Hz\ne - 4000 Hz\nss - 8000 Hz\nHaptic sound\n63 Hz - belly?\n125 Hz - chest/shoulder?"},"Waveguide":{"title":"Waveguide","links":[],"tags":[],"content":"an-introduction-to-horn-theory.pdf (grc.com)\nwww.aes.org/e-lib/browse.cfm\nwww.aes.org/e-lib/browse.cfm\nwww.aes.org/e-lib/browse.cfm\nwww.aes.org/e-lib/browse.cfm"},"WinISD":{"title":"WinISD","links":["tags/WinISD"],"tags":["WinISD"],"content":"WinISD\nIntroduction to equivalent circuits\nThese are the models which WinISD graph calculations are based on. Models are documented here for reference. Most box-program authors are not documenting publicly these things. They are also useful, if someone wishes to evaluate validity of used models. Most people don’t need these.\nCircuits are reduced to acoustical side. Models for currently supported enclosure types are:\n\nClosed box\nVented box\nPassive radiator\n4th order bandpass\n6th order bandpass type A\n\nVoltage source, Uad, is so called “constant pressure generator”. Resistance models acoustic resistance, capacitor models compliance (volumes) and inductor models mass. There are several ways to determine component values. One, which is used in WinISD pro, is where we start on driver Vas to determine Ccas:\nCcas=roo⋅c2Vas​\nCcas = Vas/roo/c**2\nThen, we’ll use fs to determine Lmas:\nLmas=(2πfs)2⋅Ccas1​\nLmas = 1/(2*pi*fs)**2/Ccas\nLmas = 1/((2·pi·fs)²·Ccas)\nThen, Qes and Qms is used to determine Rae and Ram:\nRaeRam​=2πfs⋅Qes⋅Ccas1​=2πfs⋅Qms⋅Ccas1​​​\nRae = 1/2/pi/fs/Qes/Ccas\nRam = 1/2/pi/fs/Qms/Ccas\nRae = 1/(2·pi·fs·Qes·Ccas)\nRam = 1/(2·pi·fs·Qms·Ccas)\nNow, we’ll calculate box volume modelling capacitor Ccab just like Ccas. If we have closed box, we’ll have only determine the leak and absorption modelling resistors. These are determined by so called Q-factors. For lack of better models, these are determined at resonance frequency of boxed driver.\nDetermining frequency response\nWhen all component values are in place, then we’ll just simulate completed circuit, using any circuit simulation program, e.g. SPICE (Simulation Program with Integrated Circuit Emphasis). Frequency response is calculatable from determining the volume velocity through Ccab. Using one well-known relation, we can get to far-field pressure value from volume velocity:\np(r) = roo·s·U0(w)/(2·pi·r)·exp(-j·k·r)\nwhere k is so called wave number (k=w/c), and r is distance from diaphraghm. U0 is total volume velocity produced by box. If there is only one chamber, then U0 is current through Ccab. If there are several chambers, like in bandpass enclosures, then total volume velocity is vector sum of all volume velocities of chambers. Latter exp()..-part is the phase factor (which has always gain of unity), which is neglected in WinISD, in order to show more clear graph. Pressure is therefore complex valued. Now, when we have obtained absolute pressure level, we may use reference pressure of 20 μPa, the 0 dB reference.\nGroup delay\nGroup delay can be extracted from frequency response data by numerically derivating the phase by mathematical definition: gd(w)=-d(arg(H(f)))/dw, where arg(H(f)) is phase part of transfer function. In practice, it is done by just calculating two phase values on very small interval, and then just approximating above differential by (arg(H(f+d))-arg(H(f-d)))/(2·d).\nCone excursion\nCone excursion is calculated by first determining volume velocity through driver. Then, volume velocity is integrated, and the result is then divided by Sd to get cone excursion. Still, we need to scale result by sqrt(2) if we want to get peak value and 2·sqrt(2) if we want peak-to-peak value.\nPort velocity\nPort velocity is like cone excursion. Again, volume velocity through port is determined. Since we need port velocity, then, we just divide volume velocity by port area. This gives us RMS port velocity, which is optionally scaled, like cone excursion.\nImpedance\nImpedance is calculated by first calculating acoustical impedance seen by Uad and Rae is subtracted. By using conversion formula, Zem = Bl²/(Sd²·Za), where Za is aforementioned acoustical impedance and Zem is additional motional impedance reflected from mechanical circuit. Then final electrical impedance Ze is calculated by Ze = Re + jw·Le + Zem. All impedances are complex.\nClosed box\n\nVented box\n\nPassive radiator\n\n4th order bandpass\n\n6th order bandpass type A\n"},"index":{"title":"Home","links":[],"tags":[],"content":"Knowledge of loudspeaker design I’ve collected."},"meterials/Mortar":{"title":"Mortar","links":[],"tags":[],"content":"TPI M100 Plaster Mortar\nTPI M400 Floor Cement\nTPI M600 Generic Portland Cement\n\nBetter damping than Plaster of Paris\nThe resonance frequency is below Plaster of Paris\nheavier than Plaster of Paris\nThe setting time is more than 12 hours\nnot too smelly and not smelly at all after setted\n\n"},"meterials/Plaster-of-Paris":{"title":"Plaster of Paris","links":[],"tags":[],"content":"Composition mostly gypsum\nDensity 2.320 g/cm3\nRecent best formula for speaker is\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCementWaterLatex glue1005015 - 2020010030 - 40"},"meterials/Rockwool":{"title":"Rockwool","links":[],"tags":[],"content":"30303355.4\nDensity: 60-150 kg/m³\nRaw materials: Basalt\nThickness: 25-150mm\nAsbestos: 100% Non Asbestos\nFunction: Thermal insulation, Sound absorption\nDirect Radiator closed-box enclosure acoustical lining airflow resistivity (Fr)\nFr: 12,000 Rayls/m\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMaterialSampleConditionTwo mic method, MKS Rayls/mThree mic method, MKS Rayls/mRockwoolDD2Uncompressed12,00018,000FoamFoam 2Uncompressed3,5004,000Foam 3Uncompressed4,0004,500\nMaterials for Noise Control: Paper ICA2016-490\nType\n\nAFB Acoustic Fire Batt Insulation\nDD HardRock® Multi-Fix - High Density\nRXX eg. R24 COMFORTBATT\nSafe ‘n’ Silent\n"},"review/Measurement-Method":{"title":"Measurement Method","links":[],"tags":[],"content":"อยากแรกที่ต้องบอกก่อนคือวิธีนี้วัดเป็นวิธีวัดที่ผมคิดขึ้นเอง ไม่ใช่วิธีวัดตามมาตรฐาน ซึ่งเดี๋ยวจะมาเล่าให้ฟังในตอนนี้ว่าการวัดตามมาตรฐานเป็นอย่างไร\n\nวิธีการวัดตามาตรฐาน\nมาตรฐานวิธีการวัดลำโพงสามารถอ่านได้ใน IEC 60268-5:2003 ซึ่งถ้าจะอ่านจะต้องเสียตังซื้อ\n\nแต่ว่ามีมาตรฐานประเทศหนึ่งใจดีมากเอามาแจกให้เราอ่านฟรี : D\nอ่านได้ที่นี่เลย\nมอก. 1538-2552\nwww.fio.co.th/web/tisi_fio/fulltext/TIS1538-2552.pdf\n\nแต่ผมก็แค่อ่านผ่าน ๆ ตานะ ยังไม่ได้อ่านทั้งหมดโดยละเอียด ใครสนใจอ่านแล้วเอาความรู้มาแบ่งปันกันก็ยินดีครับ\n\n\n\nBaffle\nตามมาตรฐานเวลาวัดดอกลำโพง จำต้องมีการทำ baffle หรือหน้าตู้ลำโพงขึ้นมา ซึ่งจะมีขนาดตามภาพ\nหน้าตู้ลำโพงนี้มีขนาดใหญ่มาก ด้วยข้อจำกัดทั้งด้านพื้นที่และอุปกรณ์ของผมทำให้ไม่สามารถใช้วิธีนี้ได้\n\n\n\nCustomize Baffle\n\nผมใช้วิธีการสร้างตู้ลำโพงแบบ open baffle ขึ้นมาแทน\nข้อเสียคือความถี่ช่วงเบสจนถึงน่าจะประมาณมิดกลาง ๆ จะไม่สามารถใช้ได้ เพราะคลื่นความถี่นี้มีความยาวคลื่นสูงทำให้สามารถอ้อมจากด้านหลังมาด้านหน้าได้\nจะออกแบบให้ด้านหลังยาวขึ้นก็จะต้องใช้พลาสติกมากขึ้น และอาจจะกลายเป็น horn load อีก ซึ่งก็คงต้องค่อย ๆ พัฒนากันไป\n\n\nBox Dimension\n\n\n\nวิธีวัดช่วงความถี่ เบส และ มิด\n\nแน่นอนว่าผมก็จะใช้วิธี Near field measurement ซึ่งจริง ๆ ผมก็ไม่รู้ทฤษฎีของตัวนี้เท่าไหร่ว่าต้องใกล้ขนาดไหน และใช้ความถี่ได้ถึงเท่าไหร่ ดังนั้นผมขอเชื่องเครื่องคิดเลขของ VituixCAD ละกัน\nซึ่งดอกกว้าง 80 มม. สามารถใช้ความถี่สูงสุดที่ 1369 Hz และต้องตั้งไมค์ให้ใกล้ลำโพงที่สุด ห่างได้ไม่เกิน 4.4 มม.\n(รูปลืมถ่ายมาเอารูปเก่าไปดูประกอบนะ : P )\n\n\nBaffle step compensation\nเมื่อวัด Near field แล้วต้องทำ baffle step compensation เสมอ\n\nBaffle step คืออะไร?\nความถี่เสียงที่มีความยาวคลื่นสูง ๆ จะสามารถอ้อมไปด้านหลังได้ทำให้พลังงานหายไป\nในขณะที่ความถี่เสียงที่มีความยาวคลื่นสั้น ๆ มันจะพุ่งมาข้างหน้าเสมอ ไม่กระจายไปด้านหลังทำให้พลังงานทั้งหมดพุ่งมาฝั่งด้านหน้า\nเมื่อเราวัด near field เราจะวัดใกล้มาก ๆ วัดก่อนที่จะเกิดการกระจายของเสียงไปด้านหลังเสียอีก ทำให้เสียงเบสถึงมิดดังขึ้นมากว่าการฟังแบบไกล ๆ\nBaffle step compensation ก็คือการแก้ปรากฏการนี้นี่แหละ ซึ่งผมก็จะใช้ tool ใน VituixCAD เช่นเคย\n\n\nลองเอาผลวัดมาดู\nผลจากการวัดที่องศาต่าง ๆ ตั้งแต่ 0 - 90 องศา ซึ่งผมคิดว่าน่าจะใช้ความถี่ตั้งแต่ 700 Hz ขึ้นไปได้อยู่\n\n\n\nต่อ near field measurement ลงไป\n\n\n\nสรุป\nผลการวัด COL4.0 รอบนี้น่าจะพอใช้ได้อย่างฉิวเฉียด ถ้าตู้เทสผมเกิดการแทรกสอดที่ความถี่สูงกว่านี้อีกหน่อยซัก 100Hz ก็คงจะใช้ไม่ได้\nแต่อย่างไรก็คงจะต้องหาวิธีทำให้การแทรกสอดเกิดที่จุดต่ำกว่านี้ให้ได้ ซึ่งจุดที่ต่ำกำลังดีคือต่ำกว่า 400Hz\n\nสำหรับการเอาผลการวัด near field และ far field มาต่อกันนั้นก็เป็นที่นิยมใช้กันในโรงงานหลาย ๆ ที่ เช่นในรูปมาจากลำโพง Dayton SIG120-4 ซึงก็จะเขียนไว้ว่าตั้งแต่ความถี่ 450 Hz ลงไปมาจากการวัดแบบ near field\n"},"review/T.Audio-4.0MH-CCAW":{"title":"T.Audio 4.0MH CCAW","links":[],"tags":[],"content":"\n\n"},"review/T.Audio-4MHYKevlar":{"title":"T.Audio 4MHYKevlar","links":[],"tags":[],"content":"\n\n4 Ohm T/S Parameters\n\nPiston Diameter = 77 mm\nf(s)= 160.7 Hz\nR(e)= 3.719 Ohms\nZ(max)= 43.4 Ohms\nQ(ms)= 11.76\nQ(es)= 1.102\nQ(ts)= 1.007\nV(as)= 0.5614 liters     (0.01983 cubic feet)\nL(e)= 0 mH\nn(0)= 0.2015 %\nSPL= 85.14 1W/1m\nM(ms)= 5.324 grams\nC(ms)= 0.184 mm/N\nBL= 4.259\nK(r)= 1.925\nX(r)= 0.1067\nK(i)= 0.002702\nX(i)= 0.6069\n\n\n8 Ohm T/S Parameters\n\nPiston Diameter = 77 mm\nf(s)= 152 Hz\nR(e)= 5.783 Ohms\nZ(max)= 49.78 Ohms\nQ(ms)= 8.739\nQ(es)= 1.149\nQ(ts)= 1.015\nV(as)= 0.943 liters     (0.0333 cubic feet)\nL(e)= 0 mH\nn(0)= 0.2748 %\nSPL= 86.49 1W/1m\nM(ms)= 3.542 grams\nC(ms)= 0.31 mm/N\nBL= 4.126\nK(r)= 3.227\nX(r)= 0.09555\nK(i)= 0.0006072\nX(i)= 0.7701\n\n"},"review/T.Audio-COL4.0-8":{"title":"T.Audio COL4.0-8","links":[],"tags":[],"content":"รีวิว T.Audio COL4.0 8 Ohm 80W Ep 1\n\nทั้งหมดนี้เป็นการวัดจากตัวอย่างที่ผมได้มา ซึ่งถ้ามีคนอื่นสนใจช่วยวัดและมาแชร์กันก็ดีเช่นกัน\n\nสเป็คจากโรงงาน\nCOL 4.0 8 Ohm\nFrequency: 40Hz - 18k Hz\npower: 80 W (ไม่ระบุว่า Peak หรือ RMS)\n\nลักษณะลำโพง\n\nผมได้มา 2 ดอก\nดอกด้านซ้าย งานไม่ค่อยเรียบร้อย มีกาวสีแดงที่ใช้กับ dust cap เปื้อนออกมา\nส่วนดอกขวาตอน burn in ลำโพง ได้ยินเสียง noise ออกมานิด ๆ\n\n\nDriver hole dimension\n\n\n\nXmax\n\nเนื่องจาก โรงงานไม่ได้ระบุค่ามาให้ และผมไม่มีเครื่องมือวัด สิ่งที่ทำได้คือประมาณจาก voice coil ที่เห็นโผล่ออกมา\nจากการประมาณ Xmax น่าจะอยู่ประมาณ 3mm\n\nแต่อันนี้ต้องขอชมเรื่องการออกแบบสติกเกอร์ด้านหลังซึ่งสวยดูดีมีราคา ดีกว่าไปทำโลโก้หน้าดอกลำโพงซึ่งมันจะไปมีผลกับคุณภาพเสียงที่ได้\nอีกอย่างคือ basket ที่แข็งแรงดูดี อาจจะมีส่วนกลวง ๆ บ้าง แต่ผมไม่คิดว่าจะทำให้ถึงกับเกิดลมรั่วหรือเกิดปัญหาอื่น ๆ\n\n\n\nT/S parameters ดอกเปื้อน เสียงปกติ\nจะเห็นค่า impedance เป็นคลื่น ๆ ในบางช่วง ซึ่งค่อนข้างน่าเป็นห่วง แต่ผมเป็นอย่างไรต้องรอตอนวัดเสียงอีกทีหนึ่ง\n\nT/S parameters\n\nPiston Diameter = 80 mm\nf(s)= 101.9 Hz\nR(e)= 6.035 Ohms\nZ(max)= 62.91 Ohms\nQ(ms)= 8.102\nQ(es)= 0.8597\nQ(ts)= 0.7772\nV(as)= 1.794 liters\nL(e)= 0.1346 mH\nn(0)= 0.2104 %\nSPL= 85.33 1W/1m\nM(ms)= 4.828 grams\nC(ms)= 0.505 mm/N\nBL= 4.658\nK(r)= 2.095\nX(r)= 0.1373\nK(i)= 1.404\nX(i)= 0.0662\n\n\n\nT/S parameters ดอกมีปัญหา\nfs กับ Qts จะสู่งกว่าเล็กน้อย Vas ลดลง\nส่วนเสียง noise ที่ได้ยินจะมีปัญหาไหมคงต้องรอดูตอนวัดเสียง\n\nT/S parameters\n\nPiston Diameter = 80 mm\nf(s)= 106.8 Hz\nR(e)= 6.025 Ohms\nZ(max)= 65.6 Ohms\nQ(ms)= 8.608\nQ(es)= 0.8705\nQ(ts)= 0.7906\nV(as)= 1.46 liters     (0.05156 cubic feet)\nL(e)= 0.1329 mH\nn(0)= 0.1946 %\nSPL= 84.99 1W/1m\nM(ms)= 5.401 grams\nC(ms)= 0.411 mm/N\nBL= 5.008\nK(r)= 2.582\nX(r)= 0.1182\nK(i)= 0.3996\nX(i)= 0.1838\n\n\n\nแนวทางออกแบบตู้\n\nEPS = Fs / Qes = 102 / 0.86 = 118.6 &gt; 100\nดังนั้นเหทาะสำหรับตู้ bass reflex\nและเนื่องจาก Qts &gt;0.7 อาจจะเอาไปทำ open baffle ก็น่าจะได้อยู่\nเมื่อเอาไปทำ bass reflex จะได้ bass ลงไปถึงเกือบ 50Hz แต่เนื่องจาก Qts &gt;0.7\nทำให้กราฟไม่เรียบเท่าไหร่ อีกอย่างคือขนาดตู้ ที่ใหญ่ถึง 14 ลิตร ซึ่งผมคิดว่าใหญ่ไปหน่อยสำหรับดอก 4 นิ้ว\n\n\n\nความเห็นเบื้องต้น\n\n\nผมคิดว่า Qts สูงไปหน่อย แนวทางแก้ไขคือ ต้องลด Qes ลงมาอีกหน่อย ซึ่งน่าจะยากอยู่เหมือนกันสำหรับลำโพง full range เพราะถ้าลดส่วนนี้ลงก็อาจจะส่งผลกับย่านเสียงสูงด้วย\n\n\nXmax ยังน้อยไปสำหรับ mid bass ทำให้ลำโพงไม่สามารถแสดงประสิทธิภาพได้เท่าที่ออกแบบ จากที่ดอกลำโพงสามารถรับกำลังได้สูงถึง 80W แต่ด้วย Xmax ที่น้อยทำให้เล่นได้แค่ 6W เท่านั้น แต่ก็เนื่องจากข้อจำกัดการเป็นดอก full range ด้วย ทำให้ไม่สามารถทำ voice coil สูง ๆ ไดเ้นื่องจากจะส่งผลกับย่านเสียงสูงเช่นกัน\n\n\nงานออกแบบยังไม่เรียบร้อยเท่าไหร่ จากกาวที่เปื้อนออกมา และจริงๆ ผมไม่ค่อยชอบสีแดงซักเท่าไหร่ น่าจะใช้สีดำไปเลย\n\n\nอันนี้เป็นข้อกังวนของผม เพราะผมซื้อลำโพงนี้มาโดยร้านกำหนดราคาไว้ที่ 450 บาท แต่ไม่กี่วันต่อมาผมก็เจออีกร้านหนึ่งขายในราคาถูกกว่าพอสมควร แสดงว่ามีการแข่งตัดราคากัน ซึ่งจริง ๆ มันเป็นปัญหาทั้งโรงงานที่ผลิตและผู้รับมาขายเลย ผมคิดว่าโรงงานควรจะตั้งราคาขายมาให้เรียบร้อย ไม่ควรให้ตัวแทนจำหน่ายตั้งราคากันเอง รวมถึงโรงงานจะต้องไม่เอาสินค้ามาขายเองตรง ๆ หรืออย่างน้อย ๆ ก็ต้องตั้งราคาเท่ากับตัวแทนจำหน่าย ไม่อย่างนั้นจะเจอการตัดราคาขายแข่งกันแบบนี้ซึ่งไม่เป็นผลดีกับใครเลย\n\n\n\nรีวิว T.Audio COL4.0 8 Ohm 80W Ep 2\nวันนี้เป็นเรื่องเสียง มาดูกันว่าเสียงของ COL4.0 เป็นอย่างไร\nDisclaimer\nนี่ไม่ใช้การวัดแบบมาตรฐาน สามารถดูวิธีวัดได้ที่\nwww.facebook.com/groups/791461357947350/permalink/2009226592837481/\n\nตู้ที่ใช้วัดและตำแหน่งวัด\n\nวัดที่สัญญาณ 2.83V rms\nระยะห่าง 50 ซม.\nซึ่งถ้าต้องการ SPL @ 2.83V, 1m สามารถเอาค่าในกราฟ -6 dB ได้เลย\n(สารภาพว่าลืมลบให้)\n\n\nFrequency Response\n\n\n\nDistortion\nตัวนี้ผมไม่อยากให้เชื่อผมมาก วันนี้ไม่รู้เป็นอะไร วัดอะไรแล้ว 2nd harmonic มันขึ้นมาเยอะกว่าปกติหมดเลย อันนี้ผมเผื่อว่าใครจะลองวัดบ้างแล้วเอามาเทียบกันดูครับ\n\nส่วนลำโพงที่ตอนที่แล้วเหมือนจะมีปัญหา ตอนทดสอบไม่พบสิ่งปกติ distortion ออกมาเหมือนกัน\n\n\nWaterfall\nตั้งแต่ 700 - 20k Hz ด้วยเหตุว่าต่ำกว่า 700Hz เป็นการวัดแบบ near field\n\nเตือนอีกอย่างหนึ่งคือผมยังไม่สามารถบอกได้แน่นอนว่าส่วนไหนเกิดจาก cone breakup จริง ๆ หรือเกิดจากกล่องที่ใช้เทส\n\n\noff-axis\nวัด 0 - 90 องศา response ของ 60 องศาขึ้นไปอาจจะเชื่อไม่ค่อยได้\n\n\n\nDirectivity\n\n\n\nแนะนำ notch filter\nเป็นปกติที่เราจะใส่ notch filter ในดอก full range ส่วนตัวนี้ผมแนะนำวงจรตามนี้\n\n\n\nnotch filter 2\nสำหรับคนอยากลดช่วง 10k Hz ซึ่งจริง ๆ ก็สูงมาก ๆ แหละ\nแต่อุปกรณ์น่าจะหาค่อนข้างหายาก และให้ละวังเรื่องเฟสของ impedance ด้วย ต้องดูว่าแอมป์เล่นไหวไหม หรือจะลองปรับ R 150 ohm ให้เหลือซัก 33 หรือ 47 ohm แอมป์ก็จะทำงานง่ายขึ้น\n\n"}}